bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/**
  ******************************************************************************
  * @file    glb_reg.h
  * @version V1.0
  * @date    2022-07-14
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __GLB_REG_H__
#define  __GLB_REG_H__

#include "bl702l.h"

/* 0x0 : clk_cfg0 */
#define GLB_CLK_CFG0_OFFSET                                     (0x0)
#define GLB_REG_PLL_EN                                          GLB_REG_PLL_EN
#define GLB_REG_PLL_EN_POS                                      (0U)
#define GLB_REG_PLL_EN_LEN                                      (1U)
#define GLB_REG_PLL_EN_MSK                                      (((1U<<GLB_REG_PLL_EN_LEN)-1)<<GLB_REG_PLL_EN_POS)
#define GLB_REG_PLL_EN_UMSK                                     (~(((1U<<GLB_REG_PLL_EN_LEN)-1)<<GLB_REG_PLL_EN_POS))
#define GLB_REG_FCLK_EN                                         GLB_REG_FCLK_EN
#define GLB_REG_FCLK_EN_POS                                     (1U)
#define GLB_REG_FCLK_EN_LEN                                     (1U)
#define GLB_REG_FCLK_EN_MSK                                     (((1U<<GLB_REG_FCLK_EN_LEN)-1)<<GLB_REG_FCLK_EN_POS)
#define GLB_REG_FCLK_EN_UMSK                                    (~(((1U<<GLB_REG_FCLK_EN_LEN)-1)<<GLB_REG_FCLK_EN_POS))
#define GLB_REG_HCLK_EN                                         GLB_REG_HCLK_EN
#define GLB_REG_HCLK_EN_POS                                     (2U)
#define GLB_REG_HCLK_EN_LEN                                     (1U)
#define GLB_REG_HCLK_EN_MSK                                     (((1U<<GLB_REG_HCLK_EN_LEN)-1)<<GLB_REG_HCLK_EN_POS)
#define GLB_REG_HCLK_EN_UMSK                                    (~(((1U<<GLB_REG_HCLK_EN_LEN)-1)<<GLB_REG_HCLK_EN_POS))
#define GLB_REG_BCLK_EN                                         GLB_REG_BCLK_EN
#define GLB_REG_BCLK_EN_POS                                     (3U)
#define GLB_REG_BCLK_EN_LEN                                     (1U)
#define GLB_REG_BCLK_EN_MSK                                     (((1U<<GLB_REG_BCLK_EN_LEN)-1)<<GLB_REG_BCLK_EN_POS)
#define GLB_REG_BCLK_EN_UMSK                                    (~(((1U<<GLB_REG_BCLK_EN_LEN)-1)<<GLB_REG_BCLK_EN_POS))
#define GLB_REG_PLL_SEL                                         GLB_REG_PLL_SEL
#define GLB_REG_PLL_SEL_POS                                     (4U)
#define GLB_REG_PLL_SEL_LEN                                     (2U)
#define GLB_REG_PLL_SEL_MSK                                     (((1U<<GLB_REG_PLL_SEL_LEN)-1)<<GLB_REG_PLL_SEL_POS)
#define GLB_REG_PLL_SEL_UMSK                                    (~(((1U<<GLB_REG_PLL_SEL_LEN)-1)<<GLB_REG_PLL_SEL_POS))
#define GLB_HBN_ROOT_CLK_SEL                                    GLB_HBN_ROOT_CLK_SEL
#define GLB_HBN_ROOT_CLK_SEL_POS                                (6U)
#define GLB_HBN_ROOT_CLK_SEL_LEN                                (2U)
#define GLB_HBN_ROOT_CLK_SEL_MSK                                (((1U<<GLB_HBN_ROOT_CLK_SEL_LEN)-1)<<GLB_HBN_ROOT_CLK_SEL_POS)
#define GLB_HBN_ROOT_CLK_SEL_UMSK                               (~(((1U<<GLB_HBN_ROOT_CLK_SEL_LEN)-1)<<GLB_HBN_ROOT_CLK_SEL_POS))
#define GLB_REG_HCLK_DIV                                        GLB_REG_HCLK_DIV
#define GLB_REG_HCLK_DIV_POS                                    (8U)
#define GLB_REG_HCLK_DIV_LEN                                    (8U)
#define GLB_REG_HCLK_DIV_MSK                                    (((1U<<GLB_REG_HCLK_DIV_LEN)-1)<<GLB_REG_HCLK_DIV_POS)
#define GLB_REG_HCLK_DIV_UMSK                                   (~(((1U<<GLB_REG_HCLK_DIV_LEN)-1)<<GLB_REG_HCLK_DIV_POS))
#define GLB_REG_BCLK_DIV                                        GLB_REG_BCLK_DIV
#define GLB_REG_BCLK_DIV_POS                                    (16U)
#define GLB_REG_BCLK_DIV_LEN                                    (8U)
#define GLB_REG_BCLK_DIV_MSK                                    (((1U<<GLB_REG_BCLK_DIV_LEN)-1)<<GLB_REG_BCLK_DIV_POS)
#define GLB_REG_BCLK_DIV_UMSK                                   (~(((1U<<GLB_REG_BCLK_DIV_LEN)-1)<<GLB_REG_BCLK_DIV_POS))
#define GLB_FCLK_SW_STATE                                       GLB_FCLK_SW_STATE
#define GLB_FCLK_SW_STATE_POS                                   (24U)
#define GLB_FCLK_SW_STATE_LEN                                   (3U)
#define GLB_FCLK_SW_STATE_MSK                                   (((1U<<GLB_FCLK_SW_STATE_LEN)-1)<<GLB_FCLK_SW_STATE_POS)
#define GLB_FCLK_SW_STATE_UMSK                                  (~(((1U<<GLB_FCLK_SW_STATE_LEN)-1)<<GLB_FCLK_SW_STATE_POS))
#define GLB_CHIP_RDY                                            GLB_CHIP_RDY
#define GLB_CHIP_RDY_POS                                        (27U)
#define GLB_CHIP_RDY_LEN                                        (1U)
#define GLB_CHIP_RDY_MSK                                        (((1U<<GLB_CHIP_RDY_LEN)-1)<<GLB_CHIP_RDY_POS)
#define GLB_CHIP_RDY_UMSK                                       (~(((1U<<GLB_CHIP_RDY_LEN)-1)<<GLB_CHIP_RDY_POS))
#define GLB_ID                                                  GLB_ID
#define GLB_ID_POS                                              (28U)
#define GLB_ID_LEN                                              (4U)
#define GLB_ID_MSK                                              (((1U<<GLB_ID_LEN)-1)<<GLB_ID_POS)
#define GLB_ID_UMSK                                             (~(((1U<<GLB_ID_LEN)-1)<<GLB_ID_POS))

/* 0x4 : clk_cfg1 */
#define GLB_CLK_CFG1_OFFSET                                     (0x4)
#define GLB_KYS_1M_CLK_DIV                                      GLB_KYS_1M_CLK_DIV
#define GLB_KYS_1M_CLK_DIV_POS                                  (0U)
#define GLB_KYS_1M_CLK_DIV_LEN                                  (5U)
#define GLB_KYS_1M_CLK_DIV_MSK                                  (((1U<<GLB_KYS_1M_CLK_DIV_LEN)-1)<<GLB_KYS_1M_CLK_DIV_POS)
#define GLB_KYS_1M_CLK_DIV_UMSK                                 (~(((1U<<GLB_KYS_1M_CLK_DIV_LEN)-1)<<GLB_KYS_1M_CLK_DIV_POS))
#define GLB_KYS_1M_CLK_SEL                                      GLB_KYS_1M_CLK_SEL
#define GLB_KYS_1M_CLK_SEL_POS                                  (7U)
#define GLB_KYS_1M_CLK_SEL_LEN                                  (1U)
#define GLB_KYS_1M_CLK_SEL_MSK                                  (((1U<<GLB_KYS_1M_CLK_SEL_LEN)-1)<<GLB_KYS_1M_CLK_SEL_POS)
#define GLB_KYS_1M_CLK_SEL_UMSK                                 (~(((1U<<GLB_KYS_1M_CLK_SEL_LEN)-1)<<GLB_KYS_1M_CLK_SEL_POS))
#define GLB_REG_AUDIO_CLK_DIV                                   GLB_REG_AUDIO_CLK_DIV
#define GLB_REG_AUDIO_CLK_DIV_POS                               (8U)
#define GLB_REG_AUDIO_CLK_DIV_LEN                               (4U)
#define GLB_REG_AUDIO_CLK_DIV_MSK                               (((1U<<GLB_REG_AUDIO_CLK_DIV_LEN)-1)<<GLB_REG_AUDIO_CLK_DIV_POS)
#define GLB_REG_AUDIO_CLK_DIV_UMSK                              (~(((1U<<GLB_REG_AUDIO_CLK_DIV_LEN)-1)<<GLB_REG_AUDIO_CLK_DIV_POS))
#define GLB_REG_AUDIO_CLK_DIV_EN                                GLB_REG_AUDIO_CLK_DIV_EN
#define GLB_REG_AUDIO_CLK_DIV_EN_POS                            (12U)
#define GLB_REG_AUDIO_CLK_DIV_EN_LEN                            (1U)
#define GLB_REG_AUDIO_CLK_DIV_EN_MSK                            (((1U<<GLB_REG_AUDIO_CLK_DIV_EN_LEN)-1)<<GLB_REG_AUDIO_CLK_DIV_EN_POS)
#define GLB_REG_AUDIO_CLK_DIV_EN_UMSK                           (~(((1U<<GLB_REG_AUDIO_CLK_DIV_EN_LEN)-1)<<GLB_REG_AUDIO_CLK_DIV_EN_POS))
#define GLB_REG_AUDIO_AUTO_DIV_EN                               GLB_REG_AUDIO_AUTO_DIV_EN
#define GLB_REG_AUDIO_AUTO_DIV_EN_POS                           (13U)
#define GLB_REG_AUDIO_AUTO_DIV_EN_LEN                           (1U)
#define GLB_REG_AUDIO_AUTO_DIV_EN_MSK                           (((1U<<GLB_REG_AUDIO_AUTO_DIV_EN_LEN)-1)<<GLB_REG_AUDIO_AUTO_DIV_EN_POS)
#define GLB_REG_AUDIO_AUTO_DIV_EN_UMSK                          (~(((1U<<GLB_REG_AUDIO_AUTO_DIV_EN_LEN)-1)<<GLB_REG_AUDIO_AUTO_DIV_EN_POS))
#define GLB_REG_AUDIO_CLK_SRC_SEL                               GLB_REG_AUDIO_CLK_SRC_SEL
#define GLB_REG_AUDIO_CLK_SRC_SEL_POS                           (14U)
#define GLB_REG_AUDIO_CLK_SRC_SEL_LEN                           (1U)
#define GLB_REG_AUDIO_CLK_SRC_SEL_MSK                           (((1U<<GLB_REG_AUDIO_CLK_SRC_SEL_LEN)-1)<<GLB_REG_AUDIO_CLK_SRC_SEL_POS)
#define GLB_REG_AUDIO_CLK_SRC_SEL_UMSK                          (~(((1U<<GLB_REG_AUDIO_CLK_SRC_SEL_LEN)-1)<<GLB_REG_AUDIO_CLK_SRC_SEL_POS))
#define GLB_BLE_CLK_SEL                                         GLB_BLE_CLK_SEL
#define GLB_BLE_CLK_SEL_POS                                     (16U)
#define GLB_BLE_CLK_SEL_LEN                                     (6U)
#define GLB_BLE_CLK_SEL_MSK                                     (((1U<<GLB_BLE_CLK_SEL_LEN)-1)<<GLB_BLE_CLK_SEL_POS)
#define GLB_BLE_CLK_SEL_UMSK                                    (~(((1U<<GLB_BLE_CLK_SEL_LEN)-1)<<GLB_BLE_CLK_SEL_POS))
#define GLB_BLE_EN                                              GLB_BLE_EN
#define GLB_BLE_EN_POS                                          (24U)
#define GLB_BLE_EN_LEN                                          (1U)
#define GLB_BLE_EN_MSK                                          (((1U<<GLB_BLE_EN_LEN)-1)<<GLB_BLE_EN_POS)
#define GLB_BLE_EN_UMSK                                         (~(((1U<<GLB_BLE_EN_LEN)-1)<<GLB_BLE_EN_POS))
#define GLB_M154_ZBEN                                           GLB_M154_ZBEN
#define GLB_M154_ZBEN_POS                                       (25U)
#define GLB_M154_ZBEN_LEN                                       (1U)
#define GLB_M154_ZBEN_MSK                                       (((1U<<GLB_M154_ZBEN_LEN)-1)<<GLB_M154_ZBEN_POS)
#define GLB_M154_ZBEN_UMSK                                      (~(((1U<<GLB_M154_ZBEN_LEN)-1)<<GLB_M154_ZBEN_POS))

