bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x8 : clk_cfg2 */
#define GLB_CLK_CFG2_OFFSET                                     (0x8)
#define GLB_UART_CLK_DIV                                        GLB_UART_CLK_DIV
#define GLB_UART_CLK_DIV_POS                                    (0U)
#define GLB_UART_CLK_DIV_LEN                                    (3U)
#define GLB_UART_CLK_DIV_MSK                                    (((1U<<GLB_UART_CLK_DIV_LEN)-1)<<GLB_UART_CLK_DIV_POS)
#define GLB_UART_CLK_DIV_UMSK                                   (~(((1U<<GLB_UART_CLK_DIV_LEN)-1)<<GLB_UART_CLK_DIV_POS))
#define GLB_UART_CLK_EN                                         GLB_UART_CLK_EN
#define GLB_UART_CLK_EN_POS                                     (4U)
#define GLB_UART_CLK_EN_LEN                                     (1U)
#define GLB_UART_CLK_EN_MSK                                     (((1U<<GLB_UART_CLK_EN_LEN)-1)<<GLB_UART_CLK_EN_POS)
#define GLB_UART_CLK_EN_UMSK                                    (~(((1U<<GLB_UART_CLK_EN_LEN)-1)<<GLB_UART_CLK_EN_POS))
#define GLB_HBN_UART_CLK_SEL                                    GLB_HBN_UART_CLK_SEL
#define GLB_HBN_UART_CLK_SEL_POS                                (7U)
#define GLB_HBN_UART_CLK_SEL_LEN                                (1U)
#define GLB_HBN_UART_CLK_SEL_MSK                                (((1U<<GLB_HBN_UART_CLK_SEL_LEN)-1)<<GLB_HBN_UART_CLK_SEL_POS)
#define GLB_HBN_UART_CLK_SEL_UMSK                               (~(((1U<<GLB_HBN_UART_CLK_SEL_LEN)-1)<<GLB_HBN_UART_CLK_SEL_POS))
#define GLB_SF_CLK_DIV                                          GLB_SF_CLK_DIV
#define GLB_SF_CLK_DIV_POS                                      (8U)
#define GLB_SF_CLK_DIV_LEN                                      (3U)
#define GLB_SF_CLK_DIV_MSK                                      (((1U<<GLB_SF_CLK_DIV_LEN)-1)<<GLB_SF_CLK_DIV_POS)
#define GLB_SF_CLK_DIV_UMSK                                     (~(((1U<<GLB_SF_CLK_DIV_LEN)-1)<<GLB_SF_CLK_DIV_POS))
#define GLB_SF_CLK_EN                                           GLB_SF_CLK_EN
#define GLB_SF_CLK_EN_POS                                       (11U)
#define GLB_SF_CLK_EN_LEN                                       (1U)
#define GLB_SF_CLK_EN_MSK                                       (((1U<<GLB_SF_CLK_EN_LEN)-1)<<GLB_SF_CLK_EN_POS)
#define GLB_SF_CLK_EN_UMSK                                      (~(((1U<<GLB_SF_CLK_EN_LEN)-1)<<GLB_SF_CLK_EN_POS))
#define GLB_SF_CLK_SEL                                          GLB_SF_CLK_SEL
#define GLB_SF_CLK_SEL_POS                                      (12U)
#define GLB_SF_CLK_SEL_LEN                                      (2U)
#define GLB_SF_CLK_SEL_MSK                                      (((1U<<GLB_SF_CLK_SEL_LEN)-1)<<GLB_SF_CLK_SEL_POS)
#define GLB_SF_CLK_SEL_UMSK                                     (~(((1U<<GLB_SF_CLK_SEL_LEN)-1)<<GLB_SF_CLK_SEL_POS))
#define GLB_IR_CLK_DIV                                          GLB_IR_CLK_DIV
#define GLB_IR_CLK_DIV_POS                                      (16U)
#define GLB_IR_CLK_DIV_LEN                                      (6U)
#define GLB_IR_CLK_DIV_MSK                                      (((1U<<GLB_IR_CLK_DIV_LEN)-1)<<GLB_IR_CLK_DIV_POS)
#define GLB_IR_CLK_DIV_UMSK                                     (~(((1U<<GLB_IR_CLK_DIV_LEN)-1)<<GLB_IR_CLK_DIV_POS))
#define GLB_HBN_UART_CLK_SEL2                                   GLB_HBN_UART_CLK_SEL2
#define GLB_HBN_UART_CLK_SEL2_POS                               (22U)
#define GLB_HBN_UART_CLK_SEL2_LEN                               (1U)
#define GLB_HBN_UART_CLK_SEL2_MSK                               (((1U<<GLB_HBN_UART_CLK_SEL2_LEN)-1)<<GLB_HBN_UART_CLK_SEL2_POS)
#define GLB_HBN_UART_CLK_SEL2_UMSK                              (~(((1U<<GLB_HBN_UART_CLK_SEL2_LEN)-1)<<GLB_HBN_UART_CLK_SEL2_POS))
#define GLB_IR_CLK_EN                                           GLB_IR_CLK_EN
#define GLB_IR_CLK_EN_POS                                       (23U)
#define GLB_IR_CLK_EN_LEN                                       (1U)
#define GLB_IR_CLK_EN_MSK                                       (((1U<<GLB_IR_CLK_EN_LEN)-1)<<GLB_IR_CLK_EN_POS)
#define GLB_IR_CLK_EN_UMSK                                      (~(((1U<<GLB_IR_CLK_EN_LEN)-1)<<GLB_IR_CLK_EN_POS))
#define GLB_DMA_CLK_EN                                          GLB_DMA_CLK_EN
#define GLB_DMA_CLK_EN_POS                                      (24U)
#define GLB_DMA_CLK_EN_LEN                                      (4U)
#define GLB_DMA_CLK_EN_MSK                                      (((1U<<GLB_DMA_CLK_EN_LEN)-1)<<GLB_DMA_CLK_EN_POS)
#define GLB_DMA_CLK_EN_UMSK                                     (~(((1U<<GLB_DMA_CLK_EN_LEN)-1)<<GLB_DMA_CLK_EN_POS))

/* 0xC : clk_cfg3 */
#define GLB_CLK_CFG3_OFFSET                                     (0xC)
#define GLB_SPI_CLK_DIV                                         GLB_SPI_CLK_DIV
#define GLB_SPI_CLK_DIV_POS                                     (0U)
#define GLB_SPI_CLK_DIV_LEN                                     (5U)
#define GLB_SPI_CLK_DIV_MSK                                     (((1U<<GLB_SPI_CLK_DIV_LEN)-1)<<GLB_SPI_CLK_DIV_POS)
#define GLB_SPI_CLK_DIV_UMSK                                    (~(((1U<<GLB_SPI_CLK_DIV_LEN)-1)<<GLB_SPI_CLK_DIV_POS))
#define GLB_SPI_CLK_EN                                          GLB_SPI_CLK_EN
#define GLB_SPI_CLK_EN_POS                                      (8U)
#define GLB_SPI_CLK_EN_LEN                                      (1U)
#define GLB_SPI_CLK_EN_MSK                                      (((1U<<GLB_SPI_CLK_EN_LEN)-1)<<GLB_SPI_CLK_EN_POS)
#define GLB_SPI_CLK_EN_UMSK                                     (~(((1U<<GLB_SPI_CLK_EN_LEN)-1)<<GLB_SPI_CLK_EN_POS))
#define GLB_SPI_CLK_SEL                                         GLB_SPI_CLK_SEL
#define GLB_SPI_CLK_SEL_POS                                     (9U)
#define GLB_SPI_CLK_SEL_LEN                                     (1U)
#define GLB_SPI_CLK_SEL_MSK                                     (((1U<<GLB_SPI_CLK_SEL_LEN)-1)<<GLB_SPI_CLK_SEL_POS)
#define GLB_SPI_CLK_SEL_UMSK                                    (~(((1U<<GLB_SPI_CLK_SEL_LEN)-1)<<GLB_SPI_CLK_SEL_POS))
#define GLB_CHIP_CLK_OUT_EN                                     GLB_CHIP_CLK_OUT_EN
#define GLB_CHIP_CLK_OUT_EN_POS                                 (10U)
#define GLB_CHIP_CLK_OUT_EN_LEN                                 (4U)
#define GLB_CHIP_CLK_OUT_EN_MSK                                 (((1U<<GLB_CHIP_CLK_OUT_EN_LEN)-1)<<GLB_CHIP_CLK_OUT_EN_POS)
#define GLB_CHIP_CLK_OUT_EN_UMSK                                (~(((1U<<GLB_CHIP_CLK_OUT_EN_LEN)-1)<<GLB_CHIP_CLK_OUT_EN_POS))
#define GLB_GPIO_TMR_CLK_SEL                                    GLB_GPIO_TMR_CLK_SEL
#define GLB_GPIO_TMR_CLK_SEL_POS                                (14U)
#define GLB_GPIO_TMR_CLK_SEL_LEN                                (2U)
#define GLB_GPIO_TMR_CLK_SEL_MSK                                (((1U<<GLB_GPIO_TMR_CLK_SEL_LEN)-1)<<GLB_GPIO_TMR_CLK_SEL_POS)
#define GLB_GPIO_TMR_CLK_SEL_UMSK                               (~(((1U<<GLB_GPIO_TMR_CLK_SEL_LEN)-1)<<GLB_GPIO_TMR_CLK_SEL_POS))
#define GLB_I2C_CLK_DIV                                         GLB_I2C_CLK_DIV
#define GLB_I2C_CLK_DIV_POS                                     (16U)
#define GLB_I2C_CLK_DIV_LEN                                     (8U)
#define GLB_I2C_CLK_DIV_MSK                                     (((1U<<GLB_I2C_CLK_DIV_LEN)-1)<<GLB_I2C_CLK_DIV_POS)
#define GLB_I2C_CLK_DIV_UMSK                                    (~(((1U<<GLB_I2C_CLK_DIV_LEN)-1)<<GLB_I2C_CLK_DIV_POS))
#define GLB_I2C_CLK_EN                                          GLB_I2C_CLK_EN
#define GLB_I2C_CLK_EN_POS                                      (24U)
#define GLB_I2C_CLK_EN_LEN                                      (1U)
#define GLB_I2C_CLK_EN_MSK                                      (((1U<<GLB_I2C_CLK_EN_LEN)-1)<<GLB_I2C_CLK_EN_POS)
#define GLB_I2C_CLK_EN_UMSK                                     (~(((1U<<GLB_I2C_CLK_EN_LEN)-1)<<GLB_I2C_CLK_EN_POS))
#define GLB_I2C_CLK_SEL                                         GLB_I2C_CLK_SEL
#define GLB_I2C_CLK_SEL_POS                                     (25U)
#define GLB_I2C_CLK_SEL_LEN                                     (1U)
#define GLB_I2C_CLK_SEL_MSK                                     (((1U<<GLB_I2C_CLK_SEL_LEN)-1)<<GLB_I2C_CLK_SEL_POS)
#define GLB_I2C_CLK_SEL_UMSK                                    (~(((1U<<GLB_I2C_CLK_SEL_LEN)-1)<<GLB_I2C_CLK_SEL_POS))
#define GLB_CHIP_CLK_OUT_0_SEL                                  GLB_CHIP_CLK_OUT_0_SEL
#define GLB_CHIP_CLK_OUT_0_SEL_POS                              (28U)
#define GLB_CHIP_CLK_OUT_0_SEL_LEN                              (2U)
#define GLB_CHIP_CLK_OUT_0_SEL_MSK                              (((1U<<GLB_CHIP_CLK_OUT_0_SEL_LEN)-1)<<GLB_CHIP_CLK_OUT_0_SEL_POS)
#define GLB_CHIP_CLK_OUT_0_SEL_UMSK                             (~(((1U<<GLB_CHIP_CLK_OUT_0_SEL_LEN)-1)<<GLB_CHIP_CLK_OUT_0_SEL_POS))
#define GLB_CHIP_CLK_OUT_1_SEL                                  GLB_CHIP_CLK_OUT_1_SEL
#define GLB_CHIP_CLK_OUT_1_SEL_POS                              (30U)
#define GLB_CHIP_CLK_OUT_1_SEL_LEN                              (2U)
#define GLB_CHIP_CLK_OUT_1_SEL_MSK                              (((1U<<GLB_CHIP_CLK_OUT_1_SEL_LEN)-1)<<GLB_CHIP_CLK_OUT_1_SEL_POS)
#define GLB_CHIP_CLK_OUT_1_SEL_UMSK                             (~(((1U<<GLB_CHIP_CLK_OUT_1_SEL_LEN)-1)<<GLB_CHIP_CLK_OUT_1_SEL_POS))

/* 0x10 : swrst_cfg0 */
#define GLB_SWRST_CFG0_OFFSET                                   (0x10)
#define GLB_SWRST_S300                                          GLB_SWRST_S300
#define GLB_SWRST_S300_POS                                      (4U)
#define GLB_SWRST_S300_LEN                                      (1U)
#define GLB_SWRST_S300_MSK                                      (((1U<<GLB_SWRST_S300_LEN)-1)<<GLB_SWRST_S300_POS)
#define GLB_SWRST_S300_UMSK                                     (~(((1U<<GLB_SWRST_S300_LEN)-1)<<GLB_SWRST_S300_POS))
#define GLB_SWRST_S301                                          GLB_SWRST_S301
#define GLB_SWRST_S301_POS                                      (8U)
#define GLB_SWRST_S301_LEN                                      (1U)
#define GLB_SWRST_S301_MSK                                      (((1U<<GLB_SWRST_S301_LEN)-1)<<GLB_SWRST_S301_POS)
#define GLB_SWRST_S301_UMSK                                     (~(((1U<<GLB_SWRST_S301_LEN)-1)<<GLB_SWRST_S301_POS))

/* 0x14 : swrst_cfg1 */
#define GLB_SWRST_CFG1_OFFSET                                   (0x14)
#define GLB_SWRST_S10                                           GLB_SWRST_S10
#define GLB_SWRST_S10_POS                                       (0U)
#define GLB_SWRST_S10_LEN                                       (1U)
#define GLB_SWRST_S10_MSK                                       (((1U<<GLB_SWRST_S10_LEN)-1)<<GLB_SWRST_S10_POS)
#define GLB_SWRST_S10_UMSK                                      (~(((1U<<GLB_SWRST_S10_LEN)-1)<<GLB_SWRST_S10_POS))
#define GLB_SWRST_S11                                           GLB_SWRST_S11
#define GLB_SWRST_S11_POS                                       (1U)
#define GLB_SWRST_S11_LEN                                       (1U)
#define GLB_SWRST_S11_MSK                                       (((1U<<GLB_SWRST_S11_LEN)-1)<<GLB_SWRST_S11_POS)
#define GLB_SWRST_S11_UMSK                                      (~(((1U<<GLB_SWRST_S11_LEN)-1)<<GLB_SWRST_S11_POS))
#define GLB_SWRST_S12                                           GLB_SWRST_S12
#define GLB_SWRST_S12_POS                                       (2U)
#define GLB_SWRST_S12_LEN                                       (1U)
#define GLB_SWRST_S12_MSK                                       (((1U<<GLB_SWRST_S12_LEN)-1)<<GLB_SWRST_S12_POS)
#define GLB_SWRST_S12_UMSK                                      (~(((1U<<GLB_SWRST_S12_LEN)-1)<<GLB_SWRST_S12_POS))
#define GLB_SWRST_S13                                           GLB_SWRST_S13
#define GLB_SWRST_S13_POS                                       (3U)
#define GLB_SWRST_S13_LEN                                       (1U)
#define GLB_SWRST_S13_MSK                                       (((1U<<GLB_SWRST_S13_LEN)-1)<<GLB_SWRST_S13_POS)
#define GLB_SWRST_S13_UMSK                                      (~(((1U<<GLB_SWRST_S13_LEN)-1)<<GLB_SWRST_S13_POS))
#define GLB_SWRST_S14                                           GLB_SWRST_S14
#define GLB_SWRST_S14_POS                                       (4U)
#define GLB_SWRST_S14_LEN                                       (1U)
#define GLB_SWRST_S14_MSK                                       (((1U<<GLB_SWRST_S14_LEN)-1)<<GLB_SWRST_S14_POS)
#define GLB_SWRST_S14_UMSK                                      (~(((1U<<GLB_SWRST_S14_LEN)-1)<<GLB_SWRST_S14_POS))
#define GLB_SWRST_S15                                           GLB_SWRST_S15
#define GLB_SWRST_S15_POS                                       (5U)
#define GLB_SWRST_S15_LEN                                       (1U)
#define GLB_SWRST_S15_MSK                                       (((1U<<GLB_SWRST_S15_LEN)-1)<<GLB_SWRST_S15_POS)
#define GLB_SWRST_S15_UMSK                                      (~(((1U<<GLB_SWRST_S15_LEN)-1)<<GLB_SWRST_S15_POS))
#define GLB_SWRST_S16                                           GLB_SWRST_S16
#define GLB_SWRST_S16_POS                                       (6U)
#define GLB_SWRST_S16_LEN                                       (1U)
#define GLB_SWRST_S16_MSK                                       (((1U<<GLB_SWRST_S16_LEN)-1)<<GLB_SWRST_S16_POS)
#define GLB_SWRST_S16_UMSK                                      (~(((1U<<GLB_SWRST_S16_LEN)-1)<<GLB_SWRST_S16_POS))
#define GLB_SWRST_S17                                           GLB_SWRST_S17
#define GLB_SWRST_S17_POS                                       (7U)
#define GLB_SWRST_S17_LEN                                       (1U)
#define GLB_SWRST_S17_MSK                                       (((1U<<GLB_SWRST_S17_LEN)-1)<<GLB_SWRST_S17_POS)
#define GLB_SWRST_S17_UMSK                                      (~(((1U<<GLB_SWRST_S17_LEN)-1)<<GLB_SWRST_S17_POS))
#define GLB_SWRST_S18                                           GLB_SWRST_S18
#define GLB_SWRST_S18_POS                                       (8U)
#define GLB_SWRST_S18_LEN                                       (1U)
#define GLB_SWRST_S18_MSK                                       (((1U<<GLB_SWRST_S18_LEN)-1)<<GLB_SWRST_S18_POS)
#define GLB_SWRST_S18_UMSK                                      (~(((1U<<GLB_SWRST_S18_LEN)-1)<<GLB_SWRST_S18_POS))
#define GLB_SWRST_S19                                           GLB_SWRST_S19
#define GLB_SWRST_S19_POS                                       (9U)
#define GLB_SWRST_S19_LEN                                       (1U)
#define GLB_SWRST_S19_MSK                                       (((1U<<GLB_SWRST_S19_LEN)-1)<<GLB_SWRST_S19_POS)
#define GLB_SWRST_S19_UMSK                                      (~(((1U<<GLB_SWRST_S19_LEN)-1)<<GLB_SWRST_S19_POS))
#define GLB_SWRST_S1B                                           GLB_SWRST_S1B
#define GLB_SWRST_S1B_POS                                       (11U)
#define GLB_SWRST_S1B_LEN                                       (1U)
#define GLB_SWRST_S1B_MSK                                       (((1U<<GLB_SWRST_S1B_LEN)-1)<<GLB_SWRST_S1B_POS)
#define GLB_SWRST_S1B_UMSK                                      (~(((1U<<GLB_SWRST_S1B_LEN)-1)<<GLB_SWRST_S1B_POS))
#define GLB_SWRST_S1C                                           GLB_SWRST_S1C
#define GLB_SWRST_S1C_POS                                       (12U)
#define GLB_SWRST_S1C_LEN                                       (1U)
#define GLB_SWRST_S1C_MSK                                       (((1U<<GLB_SWRST_S1C_LEN)-1)<<GLB_SWRST_S1C_POS)
#define GLB_SWRST_S1C_UMSK                                      (~(((1U<<GLB_SWRST_S1C_LEN)-1)<<GLB_SWRST_S1C_POS))
#define GLB_SWRST_S1E                                           GLB_SWRST_S1E
#define GLB_SWRST_S1E_POS                                       (14U)
#define GLB_SWRST_S1E_LEN                                       (1U)
#define GLB_SWRST_S1E_MSK                                       (((1U<<GLB_SWRST_S1E_LEN)-1)<<GLB_SWRST_S1E_POS)
#define GLB_SWRST_S1E_UMSK                                      (~(((1U<<GLB_SWRST_S1E_LEN)-1)<<GLB_SWRST_S1E_POS))
#define GLB_SWRST_S1A0                                          GLB_SWRST_S1A0
#define GLB_SWRST_S1A0_POS                                      (16U)
#define GLB_SWRST_S1A0_LEN                                      (1U)
#define GLB_SWRST_S1A0_MSK                                      (((1U<<GLB_SWRST_S1A0_LEN)-1)<<GLB_SWRST_S1A0_POS)
#define GLB_SWRST_S1A0_UMSK                                     (~(((1U<<GLB_SWRST_S1A0_LEN)-1)<<GLB_SWRST_S1A0_POS))
#define GLB_SWRST_S1A2                                          GLB_SWRST_S1A2
#define GLB_SWRST_S1A2_POS                                      (18U)
#define GLB_SWRST_S1A2_LEN                                      (1U)
#define GLB_SWRST_S1A2_MSK                                      (((1U<<GLB_SWRST_S1A2_LEN)-1)<<GLB_SWRST_S1A2_POS)
#define GLB_SWRST_S1A2_UMSK                                     (~(((1U<<GLB_SWRST_S1A2_LEN)-1)<<GLB_SWRST_S1A2_POS))
#define GLB_SWRST_S1A3                                          GLB_SWRST_S1A3
#define GLB_SWRST_S1A3_POS                                      (19U)
#define GLB_SWRST_S1A3_LEN                                      (1U)
#define GLB_SWRST_S1A3_MSK                                      (((1U<<GLB_SWRST_S1A3_LEN)-1)<<GLB_SWRST_S1A3_POS)
#define GLB_SWRST_S1A3_UMSK                                     (~(((1U<<GLB_SWRST_S1A3_LEN)-1)<<GLB_SWRST_S1A3_POS))
#define GLB_SWRST_S1A4                                          GLB_SWRST_S1A4
#define GLB_SWRST_S1A4_POS                                      (20U)
#define GLB_SWRST_S1A4_LEN                                      (1U)
#define GLB_SWRST_S1A4_MSK                                      (((1U<<GLB_SWRST_S1A4_LEN)-1)<<GLB_SWRST_S1A4_POS)
#define GLB_SWRST_S1A4_UMSK                                     (~(((1U<<GLB_SWRST_S1A4_LEN)-1)<<GLB_SWRST_S1A4_POS))
#define GLB_SWRST_S1A5                                          GLB_SWRST_S1A5
#define GLB_SWRST_S1A5_POS                                      (21U)
#define GLB_SWRST_S1A5_LEN                                      (1U)
#define GLB_SWRST_S1A5_MSK                                      (((1U<<GLB_SWRST_S1A5_LEN)-1)<<GLB_SWRST_S1A5_POS)
#define GLB_SWRST_S1A5_UMSK                                     (~(((1U<<GLB_SWRST_S1A5_LEN)-1)<<GLB_SWRST_S1A5_POS))
#define GLB_SWRST_S1A6                                          GLB_SWRST_S1A6
#define GLB_SWRST_S1A6_POS                                      (22U)
#define GLB_SWRST_S1A6_LEN                                      (1U)
#define GLB_SWRST_S1A6_MSK                                      (((1U<<GLB_SWRST_S1A6_LEN)-1)<<GLB_SWRST_S1A6_POS)
#define GLB_SWRST_S1A6_UMSK                                     (~(((1U<<GLB_SWRST_S1A6_LEN)-1)<<GLB_SWRST_S1A6_POS))
#define GLB_SWRST_S1A7                                          GLB_SWRST_S1A7
#define GLB_SWRST_S1A7_POS                                      (23U)
#define GLB_SWRST_S1A7_LEN                                      (1U)
#define GLB_SWRST_S1A7_MSK                                      (((1U<<GLB_SWRST_S1A7_LEN)-1)<<GLB_SWRST_S1A7_POS)
#define GLB_SWRST_S1A7_UMSK                                     (~(((1U<<GLB_SWRST_S1A7_LEN)-1)<<GLB_SWRST_S1A7_POS))
#define GLB_SWRST_S1A9                                          GLB_SWRST_S1A9
#define GLB_SWRST_S1A9_POS                                      (25U)
#define GLB_SWRST_S1A9_LEN                                      (1U)
#define GLB_SWRST_S1A9_MSK                                      (((1U<<GLB_SWRST_S1A9_LEN)-1)<<GLB_SWRST_S1A9_POS)
#define GLB_SWRST_S1A9_UMSK                                     (~(((1U<<GLB_SWRST_S1A9_LEN)-1)<<GLB_SWRST_S1A9_POS))
#define GLB_SWRST_S1AD                                          GLB_SWRST_S1AD
#define GLB_SWRST_S1AD_POS                                      (29U)
#define GLB_SWRST_S1AD_LEN                                      (1U)
#define GLB_SWRST_S1AD_MSK                                      (((1U<<GLB_SWRST_S1AD_LEN)-1)<<GLB_SWRST_S1AD_POS)
#define GLB_SWRST_S1AD_UMSK                                     (~(((1U<<GLB_SWRST_S1AD_LEN)-1)<<GLB_SWRST_S1AD_POS))

/* 0x18 : swrst_cfg2 */
#define GLB_SWRST_CFG2_OFFSET                                   (0x18)
#define GLB_REG_CTRL_PWRON_RST                                  GLB_REG_CTRL_PWRON_RST
#define GLB_REG_CTRL_PWRON_RST_POS                              (0U)
#define GLB_REG_CTRL_PWRON_RST_LEN                              (1U)
#define GLB_REG_CTRL_PWRON_RST_MSK                              (((1U<<GLB_REG_CTRL_PWRON_RST_LEN)-1)<<GLB_REG_CTRL_PWRON_RST_POS)
#define GLB_REG_CTRL_PWRON_RST_UMSK                             (~(((1U<<GLB_REG_CTRL_PWRON_RST_LEN)-1)<<GLB_REG_CTRL_PWRON_RST_POS))
#define GLB_REG_CTRL_CPU_RESET                                  GLB_REG_CTRL_CPU_RESET
#define GLB_REG_CTRL_CPU_RESET_POS                              (1U)
#define GLB_REG_CTRL_CPU_RESET_LEN                              (1U)
#define GLB_REG_CTRL_CPU_RESET_MSK                              (((1U<<GLB_REG_CTRL_CPU_RESET_LEN)-1)<<GLB_REG_CTRL_CPU_RESET_POS)
#define GLB_REG_CTRL_CPU_RESET_UMSK                             (~(((1U<<GLB_REG_CTRL_CPU_RESET_LEN)-1)<<GLB_REG_CTRL_CPU_RESET_POS))
#define GLB_REG_CTRL_SYS_RESET                                  GLB_REG_CTRL_SYS_RESET
#define GLB_REG_CTRL_SYS_RESET_POS                              (2U)
#define GLB_REG_CTRL_SYS_RESET_LEN                              (1U)
#define GLB_REG_CTRL_SYS_RESET_MSK                              (((1U<<GLB_REG_CTRL_SYS_RESET_LEN)-1)<<GLB_REG_CTRL_SYS_RESET_POS)
#define GLB_REG_CTRL_SYS_RESET_UMSK                             (~(((1U<<GLB_REG_CTRL_SYS_RESET_LEN)-1)<<GLB_REG_CTRL_SYS_RESET_POS))
#define GLB_REG_CTRL_RESET_DUMMY                                GLB_REG_CTRL_RESET_DUMMY
#define GLB_REG_CTRL_RESET_DUMMY_POS                            (4U)
#define GLB_REG_CTRL_RESET_DUMMY_LEN                            (4U)
#define GLB_REG_CTRL_RESET_DUMMY_MSK                            (((1U<<GLB_REG_CTRL_RESET_DUMMY_LEN)-1)<<GLB_REG_CTRL_RESET_DUMMY_POS)
#define GLB_REG_CTRL_RESET_DUMMY_UMSK                           (~(((1U<<GLB_REG_CTRL_RESET_DUMMY_LEN)-1)<<GLB_REG_CTRL_RESET_DUMMY_POS))
#define GLB_PKA_CLK_SEL                                         GLB_PKA_CLK_SEL
#define GLB_PKA_CLK_SEL_POS                                     (24U)
#define GLB_PKA_CLK_SEL_LEN                                     (2U)
#define GLB_PKA_CLK_SEL_MSK                                     (((1U<<GLB_PKA_CLK_SEL_LEN)-1)<<GLB_PKA_CLK_SEL_POS)
#define GLB_PKA_CLK_SEL_UMSK                                    (~(((1U<<GLB_PKA_CLK_SEL_LEN)-1)<<GLB_PKA_CLK_SEL_POS))

