bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x1C : swrst_cfg3 */
#define GLB_SWRST_CFG3_OFFSET                                   (0x1C)
#define GLB_DISRST_S11                                          GLB_DISRST_S11
#define GLB_DISRST_S11_POS                                      (1U)
#define GLB_DISRST_S11_LEN                                      (1U)
#define GLB_DISRST_S11_MSK                                      (((1U<<GLB_DISRST_S11_LEN)-1)<<GLB_DISRST_S11_POS)
#define GLB_DISRST_S11_UMSK                                     (~(((1U<<GLB_DISRST_S11_LEN)-1)<<GLB_DISRST_S11_POS))
#define GLB_DISRST_S12                                          GLB_DISRST_S12
#define GLB_DISRST_S12_POS                                      (2U)
#define GLB_DISRST_S12_LEN                                      (1U)
#define GLB_DISRST_S12_MSK                                      (((1U<<GLB_DISRST_S12_LEN)-1)<<GLB_DISRST_S12_POS)
#define GLB_DISRST_S12_UMSK                                     (~(((1U<<GLB_DISRST_S12_LEN)-1)<<GLB_DISRST_S12_POS))
#define GLB_DISRST_S18                                          GLB_DISRST_S18
#define GLB_DISRST_S18_POS                                      (8U)
#define GLB_DISRST_S18_LEN                                      (1U)
#define GLB_DISRST_S18_MSK                                      (((1U<<GLB_DISRST_S18_LEN)-1)<<GLB_DISRST_S18_POS)
#define GLB_DISRST_S18_UMSK                                     (~(((1U<<GLB_DISRST_S18_LEN)-1)<<GLB_DISRST_S18_POS))
#define GLB_DISRST_S1B                                          GLB_DISRST_S1B
#define GLB_DISRST_S1B_POS                                      (11U)
#define GLB_DISRST_S1B_LEN                                      (1U)
#define GLB_DISRST_S1B_MSK                                      (((1U<<GLB_DISRST_S1B_LEN)-1)<<GLB_DISRST_S1B_POS)
#define GLB_DISRST_S1B_UMSK                                     (~(((1U<<GLB_DISRST_S1B_LEN)-1)<<GLB_DISRST_S1B_POS))
#define GLB_DISRST_S1C                                          GLB_DISRST_S1C
#define GLB_DISRST_S1C_POS                                      (12U)
#define GLB_DISRST_S1C_LEN                                      (1U)
#define GLB_DISRST_S1C_MSK                                      (((1U<<GLB_DISRST_S1C_LEN)-1)<<GLB_DISRST_S1C_POS)
#define GLB_DISRST_S1C_UMSK                                     (~(((1U<<GLB_DISRST_S1C_LEN)-1)<<GLB_DISRST_S1C_POS))
#define GLB_DISRST_S1A0                                         GLB_DISRST_S1A0
#define GLB_DISRST_S1A0_POS                                     (16U)
#define GLB_DISRST_S1A0_LEN                                     (1U)
#define GLB_DISRST_S1A0_MSK                                     (((1U<<GLB_DISRST_S1A0_LEN)-1)<<GLB_DISRST_S1A0_POS)
#define GLB_DISRST_S1A0_UMSK                                    (~(((1U<<GLB_DISRST_S1A0_LEN)-1)<<GLB_DISRST_S1A0_POS))
#define GLB_DISRST_S1A2                                         GLB_DISRST_S1A2
#define GLB_DISRST_S1A2_POS                                     (18U)
#define GLB_DISRST_S1A2_LEN                                     (1U)
#define GLB_DISRST_S1A2_MSK                                     (((1U<<GLB_DISRST_S1A2_LEN)-1)<<GLB_DISRST_S1A2_POS)
#define GLB_DISRST_S1A2_UMSK                                    (~(((1U<<GLB_DISRST_S1A2_LEN)-1)<<GLB_DISRST_S1A2_POS))
#define GLB_DISRST_S1A3                                         GLB_DISRST_S1A3
#define GLB_DISRST_S1A3_POS                                     (19U)
#define GLB_DISRST_S1A3_LEN                                     (1U)
#define GLB_DISRST_S1A3_MSK                                     (((1U<<GLB_DISRST_S1A3_LEN)-1)<<GLB_DISRST_S1A3_POS)
#define GLB_DISRST_S1A3_UMSK                                    (~(((1U<<GLB_DISRST_S1A3_LEN)-1)<<GLB_DISRST_S1A3_POS))
#define GLB_DISRST_S1A4                                         GLB_DISRST_S1A4
#define GLB_DISRST_S1A4_POS                                     (20U)
#define GLB_DISRST_S1A4_LEN                                     (1U)
#define GLB_DISRST_S1A4_MSK                                     (((1U<<GLB_DISRST_S1A4_LEN)-1)<<GLB_DISRST_S1A4_POS)
#define GLB_DISRST_S1A4_UMSK                                    (~(((1U<<GLB_DISRST_S1A4_LEN)-1)<<GLB_DISRST_S1A4_POS))
#define GLB_DISRST_S1A5                                         GLB_DISRST_S1A5
#define GLB_DISRST_S1A5_POS                                     (21U)
#define GLB_DISRST_S1A5_LEN                                     (1U)
#define GLB_DISRST_S1A5_MSK                                     (((1U<<GLB_DISRST_S1A5_LEN)-1)<<GLB_DISRST_S1A5_POS)
#define GLB_DISRST_S1A5_UMSK                                    (~(((1U<<GLB_DISRST_S1A5_LEN)-1)<<GLB_DISRST_S1A5_POS))
#define GLB_DISRST_S1A6                                         GLB_DISRST_S1A6
#define GLB_DISRST_S1A6_POS                                     (22U)
#define GLB_DISRST_S1A6_LEN                                     (1U)
#define GLB_DISRST_S1A6_MSK                                     (((1U<<GLB_DISRST_S1A6_LEN)-1)<<GLB_DISRST_S1A6_POS)
#define GLB_DISRST_S1A6_UMSK                                    (~(((1U<<GLB_DISRST_S1A6_LEN)-1)<<GLB_DISRST_S1A6_POS))
#define GLB_DISRST_S1A7                                         GLB_DISRST_S1A7
#define GLB_DISRST_S1A7_POS                                     (23U)
#define GLB_DISRST_S1A7_LEN                                     (1U)
#define GLB_DISRST_S1A7_MSK                                     (((1U<<GLB_DISRST_S1A7_LEN)-1)<<GLB_DISRST_S1A7_POS)
#define GLB_DISRST_S1A7_UMSK                                    (~(((1U<<GLB_DISRST_S1A7_LEN)-1)<<GLB_DISRST_S1A7_POS))
#define GLB_DISRST_S1A9                                         GLB_DISRST_S1A9
#define GLB_DISRST_S1A9_POS                                     (25U)
#define GLB_DISRST_S1A9_LEN                                     (1U)
#define GLB_DISRST_S1A9_MSK                                     (((1U<<GLB_DISRST_S1A9_LEN)-1)<<GLB_DISRST_S1A9_POS)
#define GLB_DISRST_S1A9_UMSK                                    (~(((1U<<GLB_DISRST_S1A9_LEN)-1)<<GLB_DISRST_S1A9_POS))
#define GLB_DISRST_S1AD                                         GLB_DISRST_S1AD
#define GLB_DISRST_S1AD_POS                                     (29U)
#define GLB_DISRST_S1AD_LEN                                     (1U)
#define GLB_DISRST_S1AD_MSK                                     (((1U<<GLB_DISRST_S1AD_LEN)-1)<<GLB_DISRST_S1AD_POS)
#define GLB_DISRST_S1AD_UMSK                                    (~(((1U<<GLB_DISRST_S1AD_LEN)-1)<<GLB_DISRST_S1AD_POS))

/* 0x20 : cgen_cfg0 */
#define GLB_CGEN_CFG0_OFFSET                                    (0x20)
#define GLB_CGEN_M0                                             GLB_CGEN_M0
#define GLB_CGEN_M0_POS                                         (0U)
#define GLB_CGEN_M0_LEN                                         (1U)
#define GLB_CGEN_M0_MSK                                         (((1U<<GLB_CGEN_M0_LEN)-1)<<GLB_CGEN_M0_POS)
#define GLB_CGEN_M0_UMSK                                        (~(((1U<<GLB_CGEN_M0_LEN)-1)<<GLB_CGEN_M0_POS))
#define GLB_CGEN_M2                                             GLB_CGEN_M2
#define GLB_CGEN_M2_POS                                         (2U)
#define GLB_CGEN_M2_LEN                                         (1U)
#define GLB_CGEN_M2_MSK                                         (((1U<<GLB_CGEN_M2_LEN)-1)<<GLB_CGEN_M2_POS)
#define GLB_CGEN_M2_UMSK                                        (~(((1U<<GLB_CGEN_M2_LEN)-1)<<GLB_CGEN_M2_POS))
#define GLB_CGEN_M3                                             GLB_CGEN_M3
#define GLB_CGEN_M3_POS                                         (3U)
#define GLB_CGEN_M3_LEN                                         (1U)
#define GLB_CGEN_M3_MSK                                         (((1U<<GLB_CGEN_M3_LEN)-1)<<GLB_CGEN_M3_POS)
#define GLB_CGEN_M3_UMSK                                        (~(((1U<<GLB_CGEN_M3_LEN)-1)<<GLB_CGEN_M3_POS))
#define GLB_CGEN_M4                                             GLB_CGEN_M4
#define GLB_CGEN_M4_POS                                         (4U)
#define GLB_CGEN_M4_LEN                                         (1U)
#define GLB_CGEN_M4_MSK                                         (((1U<<GLB_CGEN_M4_LEN)-1)<<GLB_CGEN_M4_POS)
#define GLB_CGEN_M4_UMSK                                        (~(((1U<<GLB_CGEN_M4_LEN)-1)<<GLB_CGEN_M4_POS))

/* 0x24 : cgen_cfg1 */
#define GLB_CGEN_CFG1_OFFSET                                    (0x24)
#define GLB_CGEN_S12                                            GLB_CGEN_S12
#define GLB_CGEN_S12_POS                                        (2U)
#define GLB_CGEN_S12_LEN                                        (1U)
#define GLB_CGEN_S12_MSK                                        (((1U<<GLB_CGEN_S12_LEN)-1)<<GLB_CGEN_S12_POS)
#define GLB_CGEN_S12_UMSK                                       (~(((1U<<GLB_CGEN_S12_LEN)-1)<<GLB_CGEN_S12_POS))
#define GLB_CGEN_S13                                            GLB_CGEN_S13
#define GLB_CGEN_S13_POS                                        (3U)
#define GLB_CGEN_S13_LEN                                        (1U)
#define GLB_CGEN_S13_MSK                                        (((1U<<GLB_CGEN_S13_LEN)-1)<<GLB_CGEN_S13_POS)
#define GLB_CGEN_S13_UMSK                                       (~(((1U<<GLB_CGEN_S13_LEN)-1)<<GLB_CGEN_S13_POS))
#define GLB_CGEN_S14                                            GLB_CGEN_S14
#define GLB_CGEN_S14_POS                                        (4U)
#define GLB_CGEN_S14_LEN                                        (1U)
#define GLB_CGEN_S14_MSK                                        (((1U<<GLB_CGEN_S14_LEN)-1)<<GLB_CGEN_S14_POS)
#define GLB_CGEN_S14_UMSK                                       (~(((1U<<GLB_CGEN_S14_LEN)-1)<<GLB_CGEN_S14_POS))
#define GLB_CGEN_S15                                            GLB_CGEN_S15
#define GLB_CGEN_S15_POS                                        (5U)
#define GLB_CGEN_S15_LEN                                        (1U)
#define GLB_CGEN_S15_MSK                                        (((1U<<GLB_CGEN_S15_LEN)-1)<<GLB_CGEN_S15_POS)
#define GLB_CGEN_S15_UMSK                                       (~(((1U<<GLB_CGEN_S15_LEN)-1)<<GLB_CGEN_S15_POS))
#define GLB_CGEN_S17                                            GLB_CGEN_S17
#define GLB_CGEN_S17_POS                                        (7U)
#define GLB_CGEN_S17_LEN                                        (1U)
#define GLB_CGEN_S17_MSK                                        (((1U<<GLB_CGEN_S17_LEN)-1)<<GLB_CGEN_S17_POS)
#define GLB_CGEN_S17_UMSK                                       (~(((1U<<GLB_CGEN_S17_LEN)-1)<<GLB_CGEN_S17_POS))
#define GLB_CGEN_S1B                                            GLB_CGEN_S1B
#define GLB_CGEN_S1B_POS                                        (11U)
#define GLB_CGEN_S1B_LEN                                        (1U)
#define GLB_CGEN_S1B_MSK                                        (((1U<<GLB_CGEN_S1B_LEN)-1)<<GLB_CGEN_S1B_POS)
#define GLB_CGEN_S1B_UMSK                                       (~(((1U<<GLB_CGEN_S1B_LEN)-1)<<GLB_CGEN_S1B_POS))
#define GLB_CGEN_S1C                                            GLB_CGEN_S1C
#define GLB_CGEN_S1C_POS                                        (12U)
#define GLB_CGEN_S1C_LEN                                        (1U)
#define GLB_CGEN_S1C_MSK                                        (((1U<<GLB_CGEN_S1C_LEN)-1)<<GLB_CGEN_S1C_POS)
#define GLB_CGEN_S1C_UMSK                                       (~(((1U<<GLB_CGEN_S1C_LEN)-1)<<GLB_CGEN_S1C_POS))
#define GLB_CGEN_S1A0                                           GLB_CGEN_S1A0
#define GLB_CGEN_S1A0_POS                                       (16U)
#define GLB_CGEN_S1A0_LEN                                       (1U)
#define GLB_CGEN_S1A0_MSK                                       (((1U<<GLB_CGEN_S1A0_LEN)-1)<<GLB_CGEN_S1A0_POS)
#define GLB_CGEN_S1A0_UMSK                                      (~(((1U<<GLB_CGEN_S1A0_LEN)-1)<<GLB_CGEN_S1A0_POS))
#define GLB_CGEN_S1A2                                           GLB_CGEN_S1A2
#define GLB_CGEN_S1A2_POS                                       (18U)
#define GLB_CGEN_S1A2_LEN                                       (1U)
#define GLB_CGEN_S1A2_MSK                                       (((1U<<GLB_CGEN_S1A2_LEN)-1)<<GLB_CGEN_S1A2_POS)
#define GLB_CGEN_S1A2_UMSK                                      (~(((1U<<GLB_CGEN_S1A2_LEN)-1)<<GLB_CGEN_S1A2_POS))
#define GLB_CGEN_S1A3                                           GLB_CGEN_S1A3
#define GLB_CGEN_S1A3_POS                                       (19U)
#define GLB_CGEN_S1A3_LEN                                       (1U)
#define GLB_CGEN_S1A3_MSK                                       (((1U<<GLB_CGEN_S1A3_LEN)-1)<<GLB_CGEN_S1A3_POS)
#define GLB_CGEN_S1A3_UMSK                                      (~(((1U<<GLB_CGEN_S1A3_LEN)-1)<<GLB_CGEN_S1A3_POS))
#define GLB_CGEN_S1A4                                           GLB_CGEN_S1A4
#define GLB_CGEN_S1A4_POS                                       (20U)
#define GLB_CGEN_S1A4_LEN                                       (1U)
#define GLB_CGEN_S1A4_MSK                                       (((1U<<GLB_CGEN_S1A4_LEN)-1)<<GLB_CGEN_S1A4_POS)
#define GLB_CGEN_S1A4_UMSK                                      (~(((1U<<GLB_CGEN_S1A4_LEN)-1)<<GLB_CGEN_S1A4_POS))
#define GLB_CGEN_S1A5                                           GLB_CGEN_S1A5
#define GLB_CGEN_S1A5_POS                                       (21U)
#define GLB_CGEN_S1A5_LEN                                       (1U)
#define GLB_CGEN_S1A5_MSK                                       (((1U<<GLB_CGEN_S1A5_LEN)-1)<<GLB_CGEN_S1A5_POS)
#define GLB_CGEN_S1A5_UMSK                                      (~(((1U<<GLB_CGEN_S1A5_LEN)-1)<<GLB_CGEN_S1A5_POS))
#define GLB_CGEN_S1A6                                           GLB_CGEN_S1A6
#define GLB_CGEN_S1A6_POS                                       (22U)
#define GLB_CGEN_S1A6_LEN                                       (1U)
#define GLB_CGEN_S1A6_MSK                                       (((1U<<GLB_CGEN_S1A6_LEN)-1)<<GLB_CGEN_S1A6_POS)
#define GLB_CGEN_S1A6_UMSK                                      (~(((1U<<GLB_CGEN_S1A6_LEN)-1)<<GLB_CGEN_S1A6_POS))
#define GLB_CGEN_S1A7                                           GLB_CGEN_S1A7
#define GLB_CGEN_S1A7_POS                                       (23U)
#define GLB_CGEN_S1A7_LEN                                       (1U)
#define GLB_CGEN_S1A7_MSK                                       (((1U<<GLB_CGEN_S1A7_LEN)-1)<<GLB_CGEN_S1A7_POS)
#define GLB_CGEN_S1A7_UMSK                                      (~(((1U<<GLB_CGEN_S1A7_LEN)-1)<<GLB_CGEN_S1A7_POS))
#define GLB_CGEN_S1A9                                           GLB_CGEN_S1A9
#define GLB_CGEN_S1A9_POS                                       (25U)
#define GLB_CGEN_S1A9_LEN                                       (1U)
#define GLB_CGEN_S1A9_MSK                                       (((1U<<GLB_CGEN_S1A9_LEN)-1)<<GLB_CGEN_S1A9_POS)
#define GLB_CGEN_S1A9_UMSK                                      (~(((1U<<GLB_CGEN_S1A9_LEN)-1)<<GLB_CGEN_S1A9_POS))
#define GLB_CGEN_S1AD                                           GLB_CGEN_S1AD
#define GLB_CGEN_S1AD_POS                                       (29U)
#define GLB_CGEN_S1AD_LEN                                       (1U)
#define GLB_CGEN_S1AD_MSK                                       (((1U<<GLB_CGEN_S1AD_LEN)-1)<<GLB_CGEN_S1AD_POS)
#define GLB_CGEN_S1AD_UMSK                                      (~(((1U<<GLB_CGEN_S1AD_LEN)-1)<<GLB_CGEN_S1AD_POS))

/* 0x28 : cgen_cfg2 */
#define GLB_CGEN_CFG2_OFFSET                                    (0x28)
#define GLB_CGEN_S300                                           GLB_CGEN_S300
#define GLB_CGEN_S300_POS                                       (0U)
#define GLB_CGEN_S300_LEN                                       (1U)
#define GLB_CGEN_S300_MSK                                       (((1U<<GLB_CGEN_S300_LEN)-1)<<GLB_CGEN_S300_POS)
#define GLB_CGEN_S300_UMSK                                      (~(((1U<<GLB_CGEN_S300_LEN)-1)<<GLB_CGEN_S300_POS))
#define GLB_CGEN_S301                                           GLB_CGEN_S301
#define GLB_CGEN_S301_POS                                       (4U)
#define GLB_CGEN_S301_LEN                                       (1U)
#define GLB_CGEN_S301_MSK                                       (((1U<<GLB_CGEN_S301_LEN)-1)<<GLB_CGEN_S301_POS)
#define GLB_CGEN_S301_UMSK                                      (~(((1U<<GLB_CGEN_S301_LEN)-1)<<GLB_CGEN_S301_POS))

/* 0x2C : cgen_cfg3 */
#define GLB_CGEN_CFG3_OFFSET                                    (0x2C)

/* 0x30 : MBIST_CTL */
#define GLB_MBIST_CTL_OFFSET                                    (0x30)
#define GLB_IROM_MBIST_MODE                                     GLB_IROM_MBIST_MODE
#define GLB_IROM_MBIST_MODE_POS                                 (0U)
#define GLB_IROM_MBIST_MODE_LEN                                 (1U)
#define GLB_IROM_MBIST_MODE_MSK                                 (((1U<<GLB_IROM_MBIST_MODE_LEN)-1)<<GLB_IROM_MBIST_MODE_POS)
#define GLB_IROM_MBIST_MODE_UMSK                                (~(((1U<<GLB_IROM_MBIST_MODE_LEN)-1)<<GLB_IROM_MBIST_MODE_POS))
#define GLB_HSRAM_CACHE_MBIST_MODE                              GLB_HSRAM_CACHE_MBIST_MODE
#define GLB_HSRAM_CACHE_MBIST_MODE_POS                          (2U)
#define GLB_HSRAM_CACHE_MBIST_MODE_LEN                          (1U)
#define GLB_HSRAM_CACHE_MBIST_MODE_MSK                          (((1U<<GLB_HSRAM_CACHE_MBIST_MODE_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_MODE_POS)
#define GLB_HSRAM_CACHE_MBIST_MODE_UMSK                         (~(((1U<<GLB_HSRAM_CACHE_MBIST_MODE_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_MODE_POS))
#define GLB_TAG_MBIST_MODE                                      GLB_TAG_MBIST_MODE
#define GLB_TAG_MBIST_MODE_POS                                  (3U)
#define GLB_TAG_MBIST_MODE_LEN                                  (1U)
#define GLB_TAG_MBIST_MODE_MSK                                  (((1U<<GLB_TAG_MBIST_MODE_LEN)-1)<<GLB_TAG_MBIST_MODE_POS)
#define GLB_TAG_MBIST_MODE_UMSK                                 (~(((1U<<GLB_TAG_MBIST_MODE_LEN)-1)<<GLB_TAG_MBIST_MODE_POS))
#define GLB_OCRAM_MBIST_MODE                                    GLB_OCRAM_MBIST_MODE
#define GLB_OCRAM_MBIST_MODE_POS                                (4U)
#define GLB_OCRAM_MBIST_MODE_LEN                                (1U)
#define GLB_OCRAM_MBIST_MODE_MSK                                (((1U<<GLB_OCRAM_MBIST_MODE_LEN)-1)<<GLB_OCRAM_MBIST_MODE_POS)
#define GLB_OCRAM_MBIST_MODE_UMSK                               (~(((1U<<GLB_OCRAM_MBIST_MODE_LEN)-1)<<GLB_OCRAM_MBIST_MODE_POS))
#define GLB_EM_RAM_MBIST_MODE                                   GLB_EM_RAM_MBIST_MODE
#define GLB_EM_RAM_MBIST_MODE_POS                               (5U)
#define GLB_EM_RAM_MBIST_MODE_LEN                               (1U)
#define GLB_EM_RAM_MBIST_MODE_MSK                               (((1U<<GLB_EM_RAM_MBIST_MODE_LEN)-1)<<GLB_EM_RAM_MBIST_MODE_POS)
#define GLB_EM_RAM_MBIST_MODE_UMSK                              (~(((1U<<GLB_EM_RAM_MBIST_MODE_LEN)-1)<<GLB_EM_RAM_MBIST_MODE_POS))
#define GLB_M154_MBIST_MODE                                     GLB_M154_MBIST_MODE
#define GLB_M154_MBIST_MODE_POS                                 (6U)
#define GLB_M154_MBIST_MODE_LEN                                 (1U)
#define GLB_M154_MBIST_MODE_MSK                                 (((1U<<GLB_M154_MBIST_MODE_LEN)-1)<<GLB_M154_MBIST_MODE_POS)
#define GLB_M154_MBIST_MODE_UMSK                                (~(((1U<<GLB_M154_MBIST_MODE_LEN)-1)<<GLB_M154_MBIST_MODE_POS))
#define GLB_SF_MBIST_MODE                                       GLB_SF_MBIST_MODE
#define GLB_SF_MBIST_MODE_POS                                   (7U)
#define GLB_SF_MBIST_MODE_LEN                                   (1U)
#define GLB_SF_MBIST_MODE_MSK                                   (((1U<<GLB_SF_MBIST_MODE_LEN)-1)<<GLB_SF_MBIST_MODE_POS)
#define GLB_SF_MBIST_MODE_UMSK                                  (~(((1U<<GLB_SF_MBIST_MODE_LEN)-1)<<GLB_SF_MBIST_MODE_POS))
#define GLB_SEC_MBIST_MODE                                      GLB_SEC_MBIST_MODE
#define GLB_SEC_MBIST_MODE_POS                                  (8U)
#define GLB_SEC_MBIST_MODE_LEN                                  (1U)
#define GLB_SEC_MBIST_MODE_MSK                                  (((1U<<GLB_SEC_MBIST_MODE_LEN)-1)<<GLB_SEC_MBIST_MODE_POS)
#define GLB_SEC_MBIST_MODE_UMSK                                 (~(((1U<<GLB_SEC_MBIST_MODE_LEN)-1)<<GLB_SEC_MBIST_MODE_POS))
#define GLB_REG_MBIST_RST_N                                     GLB_REG_MBIST_RST_N
#define GLB_REG_MBIST_RST_N_POS                                 (31U)
#define GLB_REG_MBIST_RST_N_LEN                                 (1U)
#define GLB_REG_MBIST_RST_N_MSK                                 (((1U<<GLB_REG_MBIST_RST_N_LEN)-1)<<GLB_REG_MBIST_RST_N_POS)
#define GLB_REG_MBIST_RST_N_UMSK                                (~(((1U<<GLB_REG_MBIST_RST_N_LEN)-1)<<GLB_REG_MBIST_RST_N_POS))

