bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x34 : MBIST_STAT */
#define GLB_MBIST_STAT_OFFSET                                   (0x34)
#define GLB_IROM_MBIST_DONE                                     GLB_IROM_MBIST_DONE
#define GLB_IROM_MBIST_DONE_POS                                 (0U)
#define GLB_IROM_MBIST_DONE_LEN                                 (1U)
#define GLB_IROM_MBIST_DONE_MSK                                 (((1U<<GLB_IROM_MBIST_DONE_LEN)-1)<<GLB_IROM_MBIST_DONE_POS)
#define GLB_IROM_MBIST_DONE_UMSK                                (~(((1U<<GLB_IROM_MBIST_DONE_LEN)-1)<<GLB_IROM_MBIST_DONE_POS))
#define GLB_HSRAM_CACHE_MBIST_DONE                              GLB_HSRAM_CACHE_MBIST_DONE
#define GLB_HSRAM_CACHE_MBIST_DONE_POS                          (2U)
#define GLB_HSRAM_CACHE_MBIST_DONE_LEN                          (1U)
#define GLB_HSRAM_CACHE_MBIST_DONE_MSK                          (((1U<<GLB_HSRAM_CACHE_MBIST_DONE_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_DONE_POS)
#define GLB_HSRAM_CACHE_MBIST_DONE_UMSK                         (~(((1U<<GLB_HSRAM_CACHE_MBIST_DONE_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_DONE_POS))
#define GLB_TAG_MBIST_DONE                                      GLB_TAG_MBIST_DONE
#define GLB_TAG_MBIST_DONE_POS                                  (3U)
#define GLB_TAG_MBIST_DONE_LEN                                  (1U)
#define GLB_TAG_MBIST_DONE_MSK                                  (((1U<<GLB_TAG_MBIST_DONE_LEN)-1)<<GLB_TAG_MBIST_DONE_POS)
#define GLB_TAG_MBIST_DONE_UMSK                                 (~(((1U<<GLB_TAG_MBIST_DONE_LEN)-1)<<GLB_TAG_MBIST_DONE_POS))
#define GLB_OCRAM_MBIST_DONE                                    GLB_OCRAM_MBIST_DONE
#define GLB_OCRAM_MBIST_DONE_POS                                (4U)
#define GLB_OCRAM_MBIST_DONE_LEN                                (1U)
#define GLB_OCRAM_MBIST_DONE_MSK                                (((1U<<GLB_OCRAM_MBIST_DONE_LEN)-1)<<GLB_OCRAM_MBIST_DONE_POS)
#define GLB_OCRAM_MBIST_DONE_UMSK                               (~(((1U<<GLB_OCRAM_MBIST_DONE_LEN)-1)<<GLB_OCRAM_MBIST_DONE_POS))
#define GLB_EM_RAM_MBIST_DONE                                   GLB_EM_RAM_MBIST_DONE
#define GLB_EM_RAM_MBIST_DONE_POS                               (5U)
#define GLB_EM_RAM_MBIST_DONE_LEN                               (1U)
#define GLB_EM_RAM_MBIST_DONE_MSK                               (((1U<<GLB_EM_RAM_MBIST_DONE_LEN)-1)<<GLB_EM_RAM_MBIST_DONE_POS)
#define GLB_EM_RAM_MBIST_DONE_UMSK                              (~(((1U<<GLB_EM_RAM_MBIST_DONE_LEN)-1)<<GLB_EM_RAM_MBIST_DONE_POS))
#define GLB_M154_MBIST_DONE                                     GLB_M154_MBIST_DONE
#define GLB_M154_MBIST_DONE_POS                                 (6U)
#define GLB_M154_MBIST_DONE_LEN                                 (1U)
#define GLB_M154_MBIST_DONE_MSK                                 (((1U<<GLB_M154_MBIST_DONE_LEN)-1)<<GLB_M154_MBIST_DONE_POS)
#define GLB_M154_MBIST_DONE_UMSK                                (~(((1U<<GLB_M154_MBIST_DONE_LEN)-1)<<GLB_M154_MBIST_DONE_POS))
#define GLB_SF_MBIST_DONE                                       GLB_SF_MBIST_DONE
#define GLB_SF_MBIST_DONE_POS                                   (7U)
#define GLB_SF_MBIST_DONE_LEN                                   (1U)
#define GLB_SF_MBIST_DONE_MSK                                   (((1U<<GLB_SF_MBIST_DONE_LEN)-1)<<GLB_SF_MBIST_DONE_POS)
#define GLB_SF_MBIST_DONE_UMSK                                  (~(((1U<<GLB_SF_MBIST_DONE_LEN)-1)<<GLB_SF_MBIST_DONE_POS))
#define GLB_SEC_MBIST_DONE                                      GLB_SEC_MBIST_DONE
#define GLB_SEC_MBIST_DONE_POS                                  (8U)
#define GLB_SEC_MBIST_DONE_LEN                                  (1U)
#define GLB_SEC_MBIST_DONE_MSK                                  (((1U<<GLB_SEC_MBIST_DONE_LEN)-1)<<GLB_SEC_MBIST_DONE_POS)
#define GLB_SEC_MBIST_DONE_UMSK                                 (~(((1U<<GLB_SEC_MBIST_DONE_LEN)-1)<<GLB_SEC_MBIST_DONE_POS))
#define GLB_IROM_MBIST_FAIL                                     GLB_IROM_MBIST_FAIL
#define GLB_IROM_MBIST_FAIL_POS                                 (16U)
#define GLB_IROM_MBIST_FAIL_LEN                                 (1U)
#define GLB_IROM_MBIST_FAIL_MSK                                 (((1U<<GLB_IROM_MBIST_FAIL_LEN)-1)<<GLB_IROM_MBIST_FAIL_POS)
#define GLB_IROM_MBIST_FAIL_UMSK                                (~(((1U<<GLB_IROM_MBIST_FAIL_LEN)-1)<<GLB_IROM_MBIST_FAIL_POS))
#define GLB_HSRAM_CACHE_MBIST_FAIL                              GLB_HSRAM_CACHE_MBIST_FAIL
#define GLB_HSRAM_CACHE_MBIST_FAIL_POS                          (18U)
#define GLB_HSRAM_CACHE_MBIST_FAIL_LEN                          (1U)
#define GLB_HSRAM_CACHE_MBIST_FAIL_MSK                          (((1U<<GLB_HSRAM_CACHE_MBIST_FAIL_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_FAIL_POS)
#define GLB_HSRAM_CACHE_MBIST_FAIL_UMSK                         (~(((1U<<GLB_HSRAM_CACHE_MBIST_FAIL_LEN)-1)<<GLB_HSRAM_CACHE_MBIST_FAIL_POS))
#define GLB_TAG_MBIST_FAIL                                      GLB_TAG_MBIST_FAIL
#define GLB_TAG_MBIST_FAIL_POS                                  (19U)
#define GLB_TAG_MBIST_FAIL_LEN                                  (1U)
#define GLB_TAG_MBIST_FAIL_MSK                                  (((1U<<GLB_TAG_MBIST_FAIL_LEN)-1)<<GLB_TAG_MBIST_FAIL_POS)
#define GLB_TAG_MBIST_FAIL_UMSK                                 (~(((1U<<GLB_TAG_MBIST_FAIL_LEN)-1)<<GLB_TAG_MBIST_FAIL_POS))
#define GLB_OCRAM_MBIST_FAIL                                    GLB_OCRAM_MBIST_FAIL
#define GLB_OCRAM_MBIST_FAIL_POS                                (20U)
#define GLB_OCRAM_MBIST_FAIL_LEN                                (1U)
#define GLB_OCRAM_MBIST_FAIL_MSK                                (((1U<<GLB_OCRAM_MBIST_FAIL_LEN)-1)<<GLB_OCRAM_MBIST_FAIL_POS)
#define GLB_OCRAM_MBIST_FAIL_UMSK                               (~(((1U<<GLB_OCRAM_MBIST_FAIL_LEN)-1)<<GLB_OCRAM_MBIST_FAIL_POS))
#define GLB_EM_RAM_MBIST_FAIL                                   GLB_EM_RAM_MBIST_FAIL
#define GLB_EM_RAM_MBIST_FAIL_POS                               (21U)
#define GLB_EM_RAM_MBIST_FAIL_LEN                               (1U)
#define GLB_EM_RAM_MBIST_FAIL_MSK                               (((1U<<GLB_EM_RAM_MBIST_FAIL_LEN)-1)<<GLB_EM_RAM_MBIST_FAIL_POS)
#define GLB_EM_RAM_MBIST_FAIL_UMSK                              (~(((1U<<GLB_EM_RAM_MBIST_FAIL_LEN)-1)<<GLB_EM_RAM_MBIST_FAIL_POS))
#define GLB_M154_MBIST_FAIL                                     GLB_M154_MBIST_FAIL
#define GLB_M154_MBIST_FAIL_POS                                 (22U)
#define GLB_M154_MBIST_FAIL_LEN                                 (1U)
#define GLB_M154_MBIST_FAIL_MSK                                 (((1U<<GLB_M154_MBIST_FAIL_LEN)-1)<<GLB_M154_MBIST_FAIL_POS)
#define GLB_M154_MBIST_FAIL_UMSK                                (~(((1U<<GLB_M154_MBIST_FAIL_LEN)-1)<<GLB_M154_MBIST_FAIL_POS))
#define GLB_SF_MBIST_FAIL                                       GLB_SF_MBIST_FAIL
#define GLB_SF_MBIST_FAIL_POS                                   (23U)
#define GLB_SF_MBIST_FAIL_LEN                                   (1U)
#define GLB_SF_MBIST_FAIL_MSK                                   (((1U<<GLB_SF_MBIST_FAIL_LEN)-1)<<GLB_SF_MBIST_FAIL_POS)
#define GLB_SF_MBIST_FAIL_UMSK                                  (~(((1U<<GLB_SF_MBIST_FAIL_LEN)-1)<<GLB_SF_MBIST_FAIL_POS))
#define GLB_SEC_MBIST_FAIL                                      GLB_SEC_MBIST_FAIL
#define GLB_SEC_MBIST_FAIL_POS                                  (24U)
#define GLB_SEC_MBIST_FAIL_LEN                                  (1U)
#define GLB_SEC_MBIST_FAIL_MSK                                  (((1U<<GLB_SEC_MBIST_FAIL_LEN)-1)<<GLB_SEC_MBIST_FAIL_POS)
#define GLB_SEC_MBIST_FAIL_UMSK                                 (~(((1U<<GLB_SEC_MBIST_FAIL_LEN)-1)<<GLB_SEC_MBIST_FAIL_POS))

/* 0x40 : NEW_RTC_TIME_L */
#define GLB_NEW_RTC_TIME_L_OFFSET                               (0x40)
#define GLB_RTC_TIMER_LATCH_L                                   GLB_RTC_TIMER_LATCH_L
#define GLB_RTC_TIMER_LATCH_L_POS                               (0U)
#define GLB_RTC_TIMER_LATCH_L_LEN                               (32U)
#define GLB_RTC_TIMER_LATCH_L_MSK                               (((1U<<GLB_RTC_TIMER_LATCH_L_LEN)-1)<<GLB_RTC_TIMER_LATCH_L_POS)
#define GLB_RTC_TIMER_LATCH_L_UMSK                              (~(((1U<<GLB_RTC_TIMER_LATCH_L_LEN)-1)<<GLB_RTC_TIMER_LATCH_L_POS))

/* 0x44 : NEW_RTC_TIME_H */
#define GLB_NEW_RTC_TIME_H_OFFSET                               (0x44)
#define GLB_RTC_TIMER_LATCH_H                                   GLB_RTC_TIMER_LATCH_H
#define GLB_RTC_TIMER_LATCH_H_POS                               (0U)
#define GLB_RTC_TIMER_LATCH_H_LEN                               (8U)
#define GLB_RTC_TIMER_LATCH_H_MSK                               (((1U<<GLB_RTC_TIMER_LATCH_H_LEN)-1)<<GLB_RTC_TIMER_LATCH_H_POS)
#define GLB_RTC_TIMER_LATCH_H_UMSK                              (~(((1U<<GLB_RTC_TIMER_LATCH_H_LEN)-1)<<GLB_RTC_TIMER_LATCH_H_POS))
#define GLB_REG_RTC_TIMER_LATCH_EN                              GLB_REG_RTC_TIMER_LATCH_EN
#define GLB_REG_RTC_TIMER_LATCH_EN_POS                          (24U)
#define GLB_REG_RTC_TIMER_LATCH_EN_LEN                          (1U)
#define GLB_REG_RTC_TIMER_LATCH_EN_MSK                          (((1U<<GLB_REG_RTC_TIMER_LATCH_EN_LEN)-1)<<GLB_REG_RTC_TIMER_LATCH_EN_POS)
#define GLB_REG_RTC_TIMER_LATCH_EN_UMSK                         (~(((1U<<GLB_REG_RTC_TIMER_LATCH_EN_LEN)-1)<<GLB_REG_RTC_TIMER_LATCH_EN_POS))

/* 0x4C : XTAL_DEG_32K */
#define GLB_XTAL_DEG_32K_OFFSET                                 (0x4C)
#define GLB_XTAL_DEG_CNT_LIMIT                                  GLB_XTAL_DEG_CNT_LIMIT
#define GLB_XTAL_DEG_CNT_LIMIT_POS                              (0U)
#define GLB_XTAL_DEG_CNT_LIMIT_LEN                              (8U)
#define GLB_XTAL_DEG_CNT_LIMIT_MSK                              (((1U<<GLB_XTAL_DEG_CNT_LIMIT_LEN)-1)<<GLB_XTAL_DEG_CNT_LIMIT_POS)
#define GLB_XTAL_DEG_CNT_LIMIT_UMSK                             (~(((1U<<GLB_XTAL_DEG_CNT_LIMIT_LEN)-1)<<GLB_XTAL_DEG_CNT_LIMIT_POS))
#define GLB_REG_RC32K_DEG_EN                                    GLB_REG_RC32K_DEG_EN
#define GLB_REG_RC32K_DEG_EN_POS                                (13U)
#define GLB_REG_RC32K_DEG_EN_LEN                                (1U)
#define GLB_REG_RC32K_DEG_EN_MSK                                (((1U<<GLB_REG_RC32K_DEG_EN_LEN)-1)<<GLB_REG_RC32K_DEG_EN_POS)
#define GLB_REG_RC32K_DEG_EN_UMSK                               (~(((1U<<GLB_REG_RC32K_DEG_EN_LEN)-1)<<GLB_REG_RC32K_DEG_EN_POS))
#define GLB_RC32K_DEG_END_PS                                    GLB_RC32K_DEG_END_PS
#define GLB_RC32K_DEG_END_PS_POS                                (14U)
#define GLB_RC32K_DEG_END_PS_LEN                                (1U)
#define GLB_RC32K_DEG_END_PS_MSK                                (((1U<<GLB_RC32K_DEG_END_PS_LEN)-1)<<GLB_RC32K_DEG_END_PS_POS)
#define GLB_RC32K_DEG_END_PS_UMSK                               (~(((1U<<GLB_RC32K_DEG_END_PS_LEN)-1)<<GLB_RC32K_DEG_END_PS_POS))
#define GLB_RC32K_DEG_START_PS                                  GLB_RC32K_DEG_START_PS
#define GLB_RC32K_DEG_START_PS_POS                              (15U)
#define GLB_RC32K_DEG_START_PS_LEN                              (1U)
#define GLB_RC32K_DEG_START_PS_MSK                              (((1U<<GLB_RC32K_DEG_START_PS_LEN)-1)<<GLB_RC32K_DEG_START_PS_POS)
#define GLB_RC32K_DEG_START_PS_UMSK                             (~(((1U<<GLB_RC32K_DEG_START_PS_LEN)-1)<<GLB_RC32K_DEG_START_PS_POS))
#define GLB_XTAL_CNT_32K_CGEN                                   GLB_XTAL_CNT_32K_CGEN
#define GLB_XTAL_CNT_32K_CGEN_POS                               (27U)
#define GLB_XTAL_CNT_32K_CGEN_LEN                               (1U)
#define GLB_XTAL_CNT_32K_CGEN_MSK                               (((1U<<GLB_XTAL_CNT_32K_CGEN_LEN)-1)<<GLB_XTAL_CNT_32K_CGEN_POS)
#define GLB_XTAL_CNT_32K_CGEN_UMSK                              (~(((1U<<GLB_XTAL_CNT_32K_CGEN_LEN)-1)<<GLB_XTAL_CNT_32K_CGEN_POS))
#define GLB_CLR_XTAL_CNT_32K_DONE                               GLB_CLR_XTAL_CNT_32K_DONE
#define GLB_CLR_XTAL_CNT_32K_DONE_POS                           (28U)
#define GLB_CLR_XTAL_CNT_32K_DONE_LEN                           (1U)
#define GLB_CLR_XTAL_CNT_32K_DONE_MSK                           (((1U<<GLB_CLR_XTAL_CNT_32K_DONE_LEN)-1)<<GLB_CLR_XTAL_CNT_32K_DONE_POS)
#define GLB_CLR_XTAL_CNT_32K_DONE_UMSK                          (~(((1U<<GLB_CLR_XTAL_CNT_32K_DONE_LEN)-1)<<GLB_CLR_XTAL_CNT_32K_DONE_POS))
#define GLB_XTAL_CNT_32K_SW_TRIG_PS                             GLB_XTAL_CNT_32K_SW_TRIG_PS
#define GLB_XTAL_CNT_32K_SW_TRIG_PS_POS                         (31U)
#define GLB_XTAL_CNT_32K_SW_TRIG_PS_LEN                         (1U)
#define GLB_XTAL_CNT_32K_SW_TRIG_PS_MSK                         (((1U<<GLB_XTAL_CNT_32K_SW_TRIG_PS_LEN)-1)<<GLB_XTAL_CNT_32K_SW_TRIG_PS_POS)
#define GLB_XTAL_CNT_32K_SW_TRIG_PS_UMSK                        (~(((1U<<GLB_XTAL_CNT_32K_SW_TRIG_PS_LEN)-1)<<GLB_XTAL_CNT_32K_SW_TRIG_PS_POS))

/* 0x50 : bmx_cfg1 */
#define GLB_BMX_CFG1_OFFSET                                     (0x50)
#define GLB_BMX_TIMEOUT_EN                                      GLB_BMX_TIMEOUT_EN
#define GLB_BMX_TIMEOUT_EN_POS                                  (0U)
#define GLB_BMX_TIMEOUT_EN_LEN                                  (4U)
#define GLB_BMX_TIMEOUT_EN_MSK                                  (((1U<<GLB_BMX_TIMEOUT_EN_LEN)-1)<<GLB_BMX_TIMEOUT_EN_POS)
#define GLB_BMX_TIMEOUT_EN_UMSK                                 (~(((1U<<GLB_BMX_TIMEOUT_EN_LEN)-1)<<GLB_BMX_TIMEOUT_EN_POS))
#define GLB_BMX_ARB_MODE                                        GLB_BMX_ARB_MODE
#define GLB_BMX_ARB_MODE_POS                                    (4U)
#define GLB_BMX_ARB_MODE_LEN                                    (2U)
#define GLB_BMX_ARB_MODE_MSK                                    (((1U<<GLB_BMX_ARB_MODE_LEN)-1)<<GLB_BMX_ARB_MODE_POS)
#define GLB_BMX_ARB_MODE_UMSK                                   (~(((1U<<GLB_BMX_ARB_MODE_LEN)-1)<<GLB_BMX_ARB_MODE_POS))
#define GLB_BMX_ERR_EN                                          GLB_BMX_ERR_EN
#define GLB_BMX_ERR_EN_POS                                      (8U)
#define GLB_BMX_ERR_EN_LEN                                      (1U)
#define GLB_BMX_ERR_EN_MSK                                      (((1U<<GLB_BMX_ERR_EN_LEN)-1)<<GLB_BMX_ERR_EN_POS)
#define GLB_BMX_ERR_EN_UMSK                                     (~(((1U<<GLB_BMX_ERR_EN_LEN)-1)<<GLB_BMX_ERR_EN_POS))
#define GLB_BMX_BUSY_OPTION_DIS                                 GLB_BMX_BUSY_OPTION_DIS
#define GLB_BMX_BUSY_OPTION_DIS_POS                             (9U)
#define GLB_BMX_BUSY_OPTION_DIS_LEN                             (1U)
#define GLB_BMX_BUSY_OPTION_DIS_MSK                             (((1U<<GLB_BMX_BUSY_OPTION_DIS_LEN)-1)<<GLB_BMX_BUSY_OPTION_DIS_POS)
#define GLB_BMX_BUSY_OPTION_DIS_UMSK                            (~(((1U<<GLB_BMX_BUSY_OPTION_DIS_LEN)-1)<<GLB_BMX_BUSY_OPTION_DIS_POS))
#define GLB_BMX_GATING_DIS                                      GLB_BMX_GATING_DIS
#define GLB_BMX_GATING_DIS_POS                                  (10U)
#define GLB_BMX_GATING_DIS_LEN                                  (1U)
#define GLB_BMX_GATING_DIS_MSK                                  (((1U<<GLB_BMX_GATING_DIS_LEN)-1)<<GLB_BMX_GATING_DIS_POS)
#define GLB_BMX_GATING_DIS_UMSK                                 (~(((1U<<GLB_BMX_GATING_DIS_LEN)-1)<<GLB_BMX_GATING_DIS_POS))
#define GLB_HSEL_OPTION                                         GLB_HSEL_OPTION
#define GLB_HSEL_OPTION_POS                                     (12U)
#define GLB_HSEL_OPTION_LEN                                     (4U)
#define GLB_HSEL_OPTION_MSK                                     (((1U<<GLB_HSEL_OPTION_LEN)-1)<<GLB_HSEL_OPTION_POS)
#define GLB_HSEL_OPTION_UMSK                                    (~(((1U<<GLB_HSEL_OPTION_LEN)-1)<<GLB_HSEL_OPTION_POS))
#define GLB_HBN_APB_CFG                                         GLB_HBN_APB_CFG
#define GLB_HBN_APB_CFG_POS                                     (24U)
#define GLB_HBN_APB_CFG_LEN                                     (8U)
#define GLB_HBN_APB_CFG_MSK                                     (((1U<<GLB_HBN_APB_CFG_LEN)-1)<<GLB_HBN_APB_CFG_POS)
#define GLB_HBN_APB_CFG_UMSK                                    (~(((1U<<GLB_HBN_APB_CFG_LEN)-1)<<GLB_HBN_APB_CFG_POS))

