bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x54 : bmx_cfg2 */
#define GLB_BMX_CFG2_OFFSET                                     (0x54)
#define GLB_BMX_ERR_ADDR_DIS                                    GLB_BMX_ERR_ADDR_DIS
#define GLB_BMX_ERR_ADDR_DIS_POS                                (0U)
#define GLB_BMX_ERR_ADDR_DIS_LEN                                (1U)
#define GLB_BMX_ERR_ADDR_DIS_MSK                                (((1U<<GLB_BMX_ERR_ADDR_DIS_LEN)-1)<<GLB_BMX_ERR_ADDR_DIS_POS)
#define GLB_BMX_ERR_ADDR_DIS_UMSK                               (~(((1U<<GLB_BMX_ERR_ADDR_DIS_LEN)-1)<<GLB_BMX_ERR_ADDR_DIS_POS))
#define GLB_BMX_ERR_CLR                                         GLB_BMX_ERR_CLR
#define GLB_BMX_ERR_CLR_POS                                     (1U)
#define GLB_BMX_ERR_CLR_LEN                                     (1U)
#define GLB_BMX_ERR_CLR_MSK                                     (((1U<<GLB_BMX_ERR_CLR_LEN)-1)<<GLB_BMX_ERR_CLR_POS)
#define GLB_BMX_ERR_CLR_UMSK                                    (~(((1U<<GLB_BMX_ERR_CLR_LEN)-1)<<GLB_BMX_ERR_CLR_POS))
#define GLB_BMX_ERR_DEC                                         GLB_BMX_ERR_DEC
#define GLB_BMX_ERR_DEC_POS                                     (4U)
#define GLB_BMX_ERR_DEC_LEN                                     (1U)
#define GLB_BMX_ERR_DEC_MSK                                     (((1U<<GLB_BMX_ERR_DEC_LEN)-1)<<GLB_BMX_ERR_DEC_POS)
#define GLB_BMX_ERR_DEC_UMSK                                    (~(((1U<<GLB_BMX_ERR_DEC_LEN)-1)<<GLB_BMX_ERR_DEC_POS))
#define GLB_BMX_ERR_TZ                                          GLB_BMX_ERR_TZ
#define GLB_BMX_ERR_TZ_POS                                      (5U)
#define GLB_BMX_ERR_TZ_LEN                                      (1U)
#define GLB_BMX_ERR_TZ_MSK                                      (((1U<<GLB_BMX_ERR_TZ_LEN)-1)<<GLB_BMX_ERR_TZ_POS)
#define GLB_BMX_ERR_TZ_UMSK                                     (~(((1U<<GLB_BMX_ERR_TZ_LEN)-1)<<GLB_BMX_ERR_TZ_POS))
#define GLB_REG_W_THRE_BMX                                      GLB_REG_W_THRE_BMX
#define GLB_REG_W_THRE_BMX_POS                                  (8U)
#define GLB_REG_W_THRE_BMX_LEN                                  (2U)
#define GLB_REG_W_THRE_BMX_MSK                                  (((1U<<GLB_REG_W_THRE_BMX_LEN)-1)<<GLB_REG_W_THRE_BMX_POS)
#define GLB_REG_W_THRE_BMX_UMSK                                 (~(((1U<<GLB_REG_W_THRE_BMX_LEN)-1)<<GLB_REG_W_THRE_BMX_POS))
#define GLB_REG_W_THRE_L1C                                      GLB_REG_W_THRE_L1C
#define GLB_REG_W_THRE_L1C_POS                                  (10U)
#define GLB_REG_W_THRE_L1C_LEN                                  (2U)
#define GLB_REG_W_THRE_L1C_MSK                                  (((1U<<GLB_REG_W_THRE_L1C_LEN)-1)<<GLB_REG_W_THRE_L1C_POS)
#define GLB_REG_W_THRE_L1C_UMSK                                 (~(((1U<<GLB_REG_W_THRE_L1C_LEN)-1)<<GLB_REG_W_THRE_L1C_POS))
#define GLB_BMX_DBG_SEL                                         GLB_BMX_DBG_SEL
#define GLB_BMX_DBG_SEL_POS                                     (28U)
#define GLB_BMX_DBG_SEL_LEN                                     (4U)
#define GLB_BMX_DBG_SEL_MSK                                     (((1U<<GLB_BMX_DBG_SEL_LEN)-1)<<GLB_BMX_DBG_SEL_POS)
#define GLB_BMX_DBG_SEL_UMSK                                    (~(((1U<<GLB_BMX_DBG_SEL_LEN)-1)<<GLB_BMX_DBG_SEL_POS))

/* 0x58 : bmx_err_addr */
#define GLB_BMX_ERR_ADDR_OFFSET                                 (0x58)
#define GLB_BMX_ERR_ADDR                                        GLB_BMX_ERR_ADDR
#define GLB_BMX_ERR_ADDR_POS                                    (0U)
#define GLB_BMX_ERR_ADDR_LEN                                    (32U)
#define GLB_BMX_ERR_ADDR_MSK                                    (((1U<<GLB_BMX_ERR_ADDR_LEN)-1)<<GLB_BMX_ERR_ADDR_POS)
#define GLB_BMX_ERR_ADDR_UMSK                                   (~(((1U<<GLB_BMX_ERR_ADDR_LEN)-1)<<GLB_BMX_ERR_ADDR_POS))

/* 0x5C : bmx_dbg_out */
#define GLB_BMX_DBG_OUT_OFFSET                                  (0x5C)
#define GLB_BMX_DBG_OUT                                         GLB_BMX_DBG_OUT
#define GLB_BMX_DBG_OUT_POS                                     (0U)
#define GLB_BMX_DBG_OUT_LEN                                     (32U)
#define GLB_BMX_DBG_OUT_MSK                                     (((1U<<GLB_BMX_DBG_OUT_LEN)-1)<<GLB_BMX_DBG_OUT_POS)
#define GLB_BMX_DBG_OUT_UMSK                                    (~(((1U<<GLB_BMX_DBG_OUT_LEN)-1)<<GLB_BMX_DBG_OUT_POS))

/* 0x60 : rsv0 */
#define GLB_RSV0_OFFSET                                         (0x60)

/* 0x64 : rsv1 */
#define GLB_RSV1_OFFSET                                         (0x64)

/* 0x68 : rsv2 */
#define GLB_RSV2_OFFSET                                         (0x68)

/* 0x6C : rsv3 */
#define GLB_RSV3_OFFSET                                         (0x6C)

/* 0x78 : sram_parm */
#define GLB_SRAM_PARM_OFFSET                                    (0x78)
#define GLB_REG_SRAM_PARM                                       GLB_REG_SRAM_PARM
#define GLB_REG_SRAM_PARM_POS                                   (0U)
#define GLB_REG_SRAM_PARM_LEN                                   (18U)
#define GLB_REG_SRAM_PARM_MSK                                   (((1U<<GLB_REG_SRAM_PARM_LEN)-1)<<GLB_REG_SRAM_PARM_POS)
#define GLB_REG_SRAM_PARM_UMSK                                  (~(((1U<<GLB_REG_SRAM_PARM_LEN)-1)<<GLB_REG_SRAM_PARM_POS))
#define GLB_REG_OCRAM_PARM                                      GLB_REG_OCRAM_PARM
#define GLB_REG_OCRAM_PARM_POS                                  (20U)
#define GLB_REG_OCRAM_PARM_LEN                                  (11U)
#define GLB_REG_OCRAM_PARM_MSK                                  (((1U<<GLB_REG_OCRAM_PARM_LEN)-1)<<GLB_REG_OCRAM_PARM_POS)
#define GLB_REG_OCRAM_PARM_UMSK                                 (~(((1U<<GLB_REG_OCRAM_PARM_LEN)-1)<<GLB_REG_OCRAM_PARM_POS))

/* 0x7C : seam_misc */
#define GLB_SEAM_MISC_OFFSET                                    (0x7C)
#define GLB_EM_SEL                                              GLB_EM_SEL
#define GLB_EM_SEL_POS                                          (0U)
#define GLB_EM_SEL_LEN                                          (4U)
#define GLB_EM_SEL_MSK                                          (((1U<<GLB_EM_SEL_LEN)-1)<<GLB_EM_SEL_POS)
#define GLB_EM_SEL_UMSK                                         (~(((1U<<GLB_EM_SEL_LEN)-1)<<GLB_EM_SEL_POS))

