bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x80 : glb_parm */
#define GLB_PARM_OFFSET                                         (0x80)
#define GLB_JTAG_SWAP_SET                                       GLB_JTAG_SWAP_SET
#define GLB_JTAG_SWAP_SET_POS                                   (0U)
#define GLB_JTAG_SWAP_SET_LEN                                   (8U)
#define GLB_JTAG_SWAP_SET_MSK                                   (((1U<<GLB_JTAG_SWAP_SET_LEN)-1)<<GLB_JTAG_SWAP_SET_POS)
#define GLB_JTAG_SWAP_SET_UMSK                                  (~(((1U<<GLB_JTAG_SWAP_SET_LEN)-1)<<GLB_JTAG_SWAP_SET_POS))
#define GLB_CFG_SFLASH_SWAP_IO0_IO3                             GLB_CFG_SFLASH_SWAP_IO0_IO3
#define GLB_CFG_SFLASH_SWAP_IO0_IO3_POS                         (8U)
#define GLB_CFG_SFLASH_SWAP_IO0_IO3_LEN                         (1U)
#define GLB_CFG_SFLASH_SWAP_IO0_IO3_MSK                         (((1U<<GLB_CFG_SFLASH_SWAP_IO0_IO3_LEN)-1)<<GLB_CFG_SFLASH_SWAP_IO0_IO3_POS)
#define GLB_CFG_SFLASH_SWAP_IO0_IO3_UMSK                        (~(((1U<<GLB_CFG_SFLASH_SWAP_IO0_IO3_LEN)-1)<<GLB_CFG_SFLASH_SWAP_IO0_IO3_POS))
#define GLB_CFG_SFLASH_SWAP_CS_IO2                              GLB_CFG_SFLASH_SWAP_CS_IO2
#define GLB_CFG_SFLASH_SWAP_CS_IO2_POS                          (9U)
#define GLB_CFG_SFLASH_SWAP_CS_IO2_LEN                          (1U)
#define GLB_CFG_SFLASH_SWAP_CS_IO2_MSK                          (((1U<<GLB_CFG_SFLASH_SWAP_CS_IO2_LEN)-1)<<GLB_CFG_SFLASH_SWAP_CS_IO2_POS)
#define GLB_CFG_SFLASH_SWAP_CS_IO2_UMSK                         (~(((1U<<GLB_CFG_SFLASH_SWAP_CS_IO2_LEN)-1)<<GLB_CFG_SFLASH_SWAP_CS_IO2_POS))
#define GLB_CFG_SFLASH_REVERSE                                  GLB_CFG_SFLASH_REVERSE
#define GLB_CFG_SFLASH_REVERSE_POS                              (10U)
#define GLB_CFG_SFLASH_REVERSE_LEN                              (1U)
#define GLB_CFG_SFLASH_REVERSE_MSK                              (((1U<<GLB_CFG_SFLASH_REVERSE_LEN)-1)<<GLB_CFG_SFLASH_REVERSE_POS)
#define GLB_CFG_SFLASH_REVERSE_UMSK                             (~(((1U<<GLB_CFG_SFLASH_REVERSE_LEN)-1)<<GLB_CFG_SFLASH_REVERSE_POS))
#define GLB_CFG_FLASH2_SCENARIO                                 GLB_CFG_FLASH2_SCENARIO
#define GLB_CFG_FLASH2_SCENARIO_POS                             (11U)
#define GLB_CFG_FLASH2_SCENARIO_LEN                             (1U)
#define GLB_CFG_FLASH2_SCENARIO_MSK                             (((1U<<GLB_CFG_FLASH2_SCENARIO_LEN)-1)<<GLB_CFG_FLASH2_SCENARIO_POS)
#define GLB_CFG_FLASH2_SCENARIO_UMSK                            (~(((1U<<GLB_CFG_FLASH2_SCENARIO_LEN)-1)<<GLB_CFG_FLASH2_SCENARIO_POS))
#define GLB_REG_SPI_0_MASTER_MODE                               GLB_REG_SPI_0_MASTER_MODE
#define GLB_REG_SPI_0_MASTER_MODE_POS                           (12U)
#define GLB_REG_SPI_0_MASTER_MODE_LEN                           (1U)
#define GLB_REG_SPI_0_MASTER_MODE_MSK                           (((1U<<GLB_REG_SPI_0_MASTER_MODE_LEN)-1)<<GLB_REG_SPI_0_MASTER_MODE_POS)
#define GLB_REG_SPI_0_MASTER_MODE_UMSK                          (~(((1U<<GLB_REG_SPI_0_MASTER_MODE_LEN)-1)<<GLB_REG_SPI_0_MASTER_MODE_POS))
#define GLB_REG_SPI_0_SWAP                                      GLB_REG_SPI_0_SWAP
#define GLB_REG_SPI_0_SWAP_POS                                  (13U)
#define GLB_REG_SPI_0_SWAP_LEN                                  (1U)
#define GLB_REG_SPI_0_SWAP_MSK                                  (((1U<<GLB_REG_SPI_0_SWAP_LEN)-1)<<GLB_REG_SPI_0_SWAP_POS)
#define GLB_REG_SPI_0_SWAP_UMSK                                 (~(((1U<<GLB_REG_SPI_0_SWAP_LEN)-1)<<GLB_REG_SPI_0_SWAP_POS))
#define GLB_REG_CCI_USE_JTAG_PIN                                GLB_REG_CCI_USE_JTAG_PIN
#define GLB_REG_CCI_USE_JTAG_PIN_POS                            (16U)
#define GLB_REG_CCI_USE_JTAG_PIN_LEN                            (1U)
#define GLB_REG_CCI_USE_JTAG_PIN_MSK                            (((1U<<GLB_REG_CCI_USE_JTAG_PIN_LEN)-1)<<GLB_REG_CCI_USE_JTAG_PIN_POS)
#define GLB_REG_CCI_USE_JTAG_PIN_UMSK                           (~(((1U<<GLB_REG_CCI_USE_JTAG_PIN_LEN)-1)<<GLB_REG_CCI_USE_JTAG_PIN_POS))
#define GLB_P1_ADC_TEST_WITH_CCI                                GLB_P1_ADC_TEST_WITH_CCI
#define GLB_P1_ADC_TEST_WITH_CCI_POS                            (17U)
#define GLB_P1_ADC_TEST_WITH_CCI_LEN                            (1U)
#define GLB_P1_ADC_TEST_WITH_CCI_MSK                            (((1U<<GLB_P1_ADC_TEST_WITH_CCI_LEN)-1)<<GLB_P1_ADC_TEST_WITH_CCI_POS)
#define GLB_P1_ADC_TEST_WITH_CCI_UMSK                           (~(((1U<<GLB_P1_ADC_TEST_WITH_CCI_LEN)-1)<<GLB_P1_ADC_TEST_WITH_CCI_POS))
#define GLB_P2_DAC_TEST_WITH_CCI                                GLB_P2_DAC_TEST_WITH_CCI
#define GLB_P2_DAC_TEST_WITH_CCI_POS                            (18U)
#define GLB_P2_DAC_TEST_WITH_CCI_LEN                            (1U)
#define GLB_P2_DAC_TEST_WITH_CCI_MSK                            (((1U<<GLB_P2_DAC_TEST_WITH_CCI_LEN)-1)<<GLB_P2_DAC_TEST_WITH_CCI_POS)
#define GLB_P2_DAC_TEST_WITH_CCI_UMSK                           (~(((1U<<GLB_P2_DAC_TEST_WITH_CCI_LEN)-1)<<GLB_P2_DAC_TEST_WITH_CCI_POS))
#define GLB_P3_CCI_USE_IO_0_2_7                                 GLB_P3_CCI_USE_IO_0_2_7
#define GLB_P3_CCI_USE_IO_0_2_7_POS                             (19U)
#define GLB_P3_CCI_USE_IO_0_2_7_LEN                             (1U)
#define GLB_P3_CCI_USE_IO_0_2_7_MSK                             (((1U<<GLB_P3_CCI_USE_IO_0_2_7_LEN)-1)<<GLB_P3_CCI_USE_IO_0_2_7_POS)
#define GLB_P3_CCI_USE_IO_0_2_7_UMSK                            (~(((1U<<GLB_P3_CCI_USE_IO_0_2_7_LEN)-1)<<GLB_P3_CCI_USE_IO_0_2_7_POS))
#define GLB_P4_ADC_TEST_WITH_JTAG                               GLB_P4_ADC_TEST_WITH_JTAG
#define GLB_P4_ADC_TEST_WITH_JTAG_POS                           (20U)
#define GLB_P4_ADC_TEST_WITH_JTAG_LEN                           (1U)
#define GLB_P4_ADC_TEST_WITH_JTAG_MSK                           (((1U<<GLB_P4_ADC_TEST_WITH_JTAG_LEN)-1)<<GLB_P4_ADC_TEST_WITH_JTAG_POS)
#define GLB_P4_ADC_TEST_WITH_JTAG_UMSK                          (~(((1U<<GLB_P4_ADC_TEST_WITH_JTAG_LEN)-1)<<GLB_P4_ADC_TEST_WITH_JTAG_POS))
#define GLB_P5_DAC_TEST_WITH_JTAG                               GLB_P5_DAC_TEST_WITH_JTAG
#define GLB_P5_DAC_TEST_WITH_JTAG_POS                           (21U)
#define GLB_P5_DAC_TEST_WITH_JTAG_LEN                           (1U)
#define GLB_P5_DAC_TEST_WITH_JTAG_MSK                           (((1U<<GLB_P5_DAC_TEST_WITH_JTAG_LEN)-1)<<GLB_P5_DAC_TEST_WITH_JTAG_POS)
#define GLB_P5_DAC_TEST_WITH_JTAG_UMSK                          (~(((1U<<GLB_P5_DAC_TEST_WITH_JTAG_LEN)-1)<<GLB_P5_DAC_TEST_WITH_JTAG_POS))
#define GLB_P6_JTAG_USE_IO_0_2_7                                GLB_P6_JTAG_USE_IO_0_2_7
#define GLB_P6_JTAG_USE_IO_0_2_7_POS                            (23U)
#define GLB_P6_JTAG_USE_IO_0_2_7_LEN                            (1U)
#define GLB_P6_JTAG_USE_IO_0_2_7_MSK                            (((1U<<GLB_P6_JTAG_USE_IO_0_2_7_LEN)-1)<<GLB_P6_JTAG_USE_IO_0_2_7_POS)
#define GLB_P6_JTAG_USE_IO_0_2_7_UMSK                           (~(((1U<<GLB_P6_JTAG_USE_IO_0_2_7_LEN)-1)<<GLB_P6_JTAG_USE_IO_0_2_7_POS))
#define GLB_REG_EN_GPIO_O_LATCH_MODE                            GLB_REG_EN_GPIO_O_LATCH_MODE
#define GLB_REG_EN_GPIO_O_LATCH_MODE_POS                        (28U)
#define GLB_REG_EN_GPIO_O_LATCH_MODE_LEN                        (1U)
#define GLB_REG_EN_GPIO_O_LATCH_MODE_MSK                        (((1U<<GLB_REG_EN_GPIO_O_LATCH_MODE_LEN)-1)<<GLB_REG_EN_GPIO_O_LATCH_MODE_POS)
#define GLB_REG_EN_GPIO_O_LATCH_MODE_UMSK                       (~(((1U<<GLB_REG_EN_GPIO_O_LATCH_MODE_LEN)-1)<<GLB_REG_EN_GPIO_O_LATCH_MODE_POS))
#define GLB_REG_KYS_DRV_VAL                                     GLB_REG_KYS_DRV_VAL
#define GLB_REG_KYS_DRV_VAL_POS                                 (29U)
#define GLB_REG_KYS_DRV_VAL_LEN                                 (1U)
#define GLB_REG_KYS_DRV_VAL_MSK                                 (((1U<<GLB_REG_KYS_DRV_VAL_LEN)-1)<<GLB_REG_KYS_DRV_VAL_POS)
#define GLB_REG_KYS_DRV_VAL_UMSK                                (~(((1U<<GLB_REG_KYS_DRV_VAL_LEN)-1)<<GLB_REG_KYS_DRV_VAL_POS))

/* 0x84 : PDM_CLK_CTRL */
#define GLB_PDM_CLK_CTRL_OFFSET                                 (0x84)

/* 0x88 : GPIO_USE_PSRAM__IO */
#define GLB_GPIO_USE_PSRAM__IO_OFFSET                           (0x88)

/* 0x90 : CPU_CLK_CFG */
#define GLB_CPU_CLK_CFG_OFFSET                                  (0x90)
#define GLB_CPU_RTC_DIV                                         GLB_CPU_RTC_DIV
#define GLB_CPU_RTC_DIV_POS                                     (0U)
#define GLB_CPU_RTC_DIV_LEN                                     (5U)
#define GLB_CPU_RTC_DIV_MSK                                     (((1U<<GLB_CPU_RTC_DIV_LEN)-1)<<GLB_CPU_RTC_DIV_POS)
#define GLB_CPU_RTC_DIV_UMSK                                    (~(((1U<<GLB_CPU_RTC_DIV_LEN)-1)<<GLB_CPU_RTC_DIV_POS))
#define GLB_CPU_RTC_EN                                          GLB_CPU_RTC_EN
#define GLB_CPU_RTC_EN_POS                                      (18U)
#define GLB_CPU_RTC_EN_LEN                                      (1U)
#define GLB_CPU_RTC_EN_MSK                                      (((1U<<GLB_CPU_RTC_EN_LEN)-1)<<GLB_CPU_RTC_EN_POS)
#define GLB_CPU_RTC_EN_UMSK                                     (~(((1U<<GLB_CPU_RTC_EN_LEN)-1)<<GLB_CPU_RTC_EN_POS))
#define GLB_CPU_RTC_SEL                                         GLB_CPU_RTC_SEL
#define GLB_CPU_RTC_SEL_POS                                     (19U)
#define GLB_CPU_RTC_SEL_LEN                                     (1U)
#define GLB_CPU_RTC_SEL_MSK                                     (((1U<<GLB_CPU_RTC_SEL_LEN)-1)<<GLB_CPU_RTC_SEL_POS)
#define GLB_CPU_RTC_SEL_UMSK                                    (~(((1U<<GLB_CPU_RTC_SEL_LEN)-1)<<GLB_CPU_RTC_SEL_POS))
#define GLB_DEBUG_NDRESET_GATE                                  GLB_DEBUG_NDRESET_GATE
#define GLB_DEBUG_NDRESET_GATE_POS                              (20U)
#define GLB_DEBUG_NDRESET_GATE_LEN                              (1U)
#define GLB_DEBUG_NDRESET_GATE_MSK                              (((1U<<GLB_DEBUG_NDRESET_GATE_LEN)-1)<<GLB_DEBUG_NDRESET_GATE_POS)
#define GLB_DEBUG_NDRESET_GATE_UMSK                             (~(((1U<<GLB_DEBUG_NDRESET_GATE_LEN)-1)<<GLB_DEBUG_NDRESET_GATE_POS))

