bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x94 : CLK_DESPUR_ROOT_CLK_CFG */
#define GLB_CLK_DESPUR_ROOT_CLK_CFG_OFFSET                      (0x94)
#define GLB_CFG_DESPUR_BMAP_ROOT_CLK                            GLB_CFG_DESPUR_BMAP_ROOT_CLK
#define GLB_CFG_DESPUR_BMAP_ROOT_CLK_POS                        (0U)
#define GLB_CFG_DESPUR_BMAP_ROOT_CLK_LEN                        (28U)
#define GLB_CFG_DESPUR_BMAP_ROOT_CLK_MSK                        (((1U<<GLB_CFG_DESPUR_BMAP_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_BMAP_ROOT_CLK_POS)
#define GLB_CFG_DESPUR_BMAP_ROOT_CLK_UMSK                       (~(((1U<<GLB_CFG_DESPUR_BMAP_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_BMAP_ROOT_CLK_POS))
#define GLB_CFG_DESPUR_CGEN_ROOT_CLK                            GLB_CFG_DESPUR_CGEN_ROOT_CLK
#define GLB_CFG_DESPUR_CGEN_ROOT_CLK_POS                        (28U)
#define GLB_CFG_DESPUR_CGEN_ROOT_CLK_LEN                        (1U)
#define GLB_CFG_DESPUR_CGEN_ROOT_CLK_MSK                        (((1U<<GLB_CFG_DESPUR_CGEN_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_CGEN_ROOT_CLK_POS)
#define GLB_CFG_DESPUR_CGEN_ROOT_CLK_UMSK                       (~(((1U<<GLB_CFG_DESPUR_CGEN_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_CGEN_ROOT_CLK_POS))
#define GLB_CFG_DESPUR_ENABLE_ROOT_CLK                          GLB_CFG_DESPUR_ENABLE_ROOT_CLK
#define GLB_CFG_DESPUR_ENABLE_ROOT_CLK_POS                      (29U)
#define GLB_CFG_DESPUR_ENABLE_ROOT_CLK_LEN                      (1U)
#define GLB_CFG_DESPUR_ENABLE_ROOT_CLK_MSK                      (((1U<<GLB_CFG_DESPUR_ENABLE_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_ENABLE_ROOT_CLK_POS)
#define GLB_CFG_DESPUR_ENABLE_ROOT_CLK_UMSK                     (~(((1U<<GLB_CFG_DESPUR_ENABLE_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_ENABLE_ROOT_CLK_POS))
#define GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK                         GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK
#define GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_POS                     (30U)
#define GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_LEN                     (1U)
#define GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_MSK                     (((1U<<GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_POS)
#define GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_UMSK                    (~(((1U<<GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_LEN)-1)<<GLB_CFG_DESPUR_CLK_SEL_ROOT_CLK_POS))

/* 0x98 : CLK_DESPUR_CLK_SF_CFG */
#define GLB_CLK_DESPUR_CLK_SF_CFG_OFFSET                        (0x98)
#define GLB_CFG_DESPUR_BMAP_CLK_SF                              GLB_CFG_DESPUR_BMAP_CLK_SF
#define GLB_CFG_DESPUR_BMAP_CLK_SF_POS                          (0U)
#define GLB_CFG_DESPUR_BMAP_CLK_SF_LEN                          (28U)
#define GLB_CFG_DESPUR_BMAP_CLK_SF_MSK                          (((1U<<GLB_CFG_DESPUR_BMAP_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_BMAP_CLK_SF_POS)
#define GLB_CFG_DESPUR_BMAP_CLK_SF_UMSK                         (~(((1U<<GLB_CFG_DESPUR_BMAP_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_BMAP_CLK_SF_POS))
#define GLB_CFG_DESPUR_CGEN_CLK_SF                              GLB_CFG_DESPUR_CGEN_CLK_SF
#define GLB_CFG_DESPUR_CGEN_CLK_SF_POS                          (28U)
#define GLB_CFG_DESPUR_CGEN_CLK_SF_LEN                          (1U)
#define GLB_CFG_DESPUR_CGEN_CLK_SF_MSK                          (((1U<<GLB_CFG_DESPUR_CGEN_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_CGEN_CLK_SF_POS)
#define GLB_CFG_DESPUR_CGEN_CLK_SF_UMSK                         (~(((1U<<GLB_CFG_DESPUR_CGEN_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_CGEN_CLK_SF_POS))
#define GLB_CFG_DESPUR_ENABLE_CLK_SF                            GLB_CFG_DESPUR_ENABLE_CLK_SF
#define GLB_CFG_DESPUR_ENABLE_CLK_SF_POS                        (29U)
#define GLB_CFG_DESPUR_ENABLE_CLK_SF_LEN                        (1U)
#define GLB_CFG_DESPUR_ENABLE_CLK_SF_MSK                        (((1U<<GLB_CFG_DESPUR_ENABLE_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_ENABLE_CLK_SF_POS)
#define GLB_CFG_DESPUR_ENABLE_CLK_SF_UMSK                       (~(((1U<<GLB_CFG_DESPUR_ENABLE_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_ENABLE_CLK_SF_POS))
#define GLB_CFG_DESPUR_CLK_SEL_CLK_SF                           GLB_CFG_DESPUR_CLK_SEL_CLK_SF
#define GLB_CFG_DESPUR_CLK_SEL_CLK_SF_POS                       (30U)
#define GLB_CFG_DESPUR_CLK_SEL_CLK_SF_LEN                       (1U)
#define GLB_CFG_DESPUR_CLK_SEL_CLK_SF_MSK                       (((1U<<GLB_CFG_DESPUR_CLK_SEL_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_CLK_SEL_CLK_SF_POS)
#define GLB_CFG_DESPUR_CLK_SEL_CLK_SF_UMSK                      (~(((1U<<GLB_CFG_DESPUR_CLK_SEL_CLK_SF_LEN)-1)<<GLB_CFG_DESPUR_CLK_SEL_CLK_SF_POS))

/* 0xA4 : GPADC_32M_SRC_CTRL */
#define GLB_GPADC_32M_SRC_CTRL_OFFSET                           (0xA4)
#define GLB_GPADC_32M_CLK_DIV                                   GLB_GPADC_32M_CLK_DIV
#define GLB_GPADC_32M_CLK_DIV_POS                               (0U)
#define GLB_GPADC_32M_CLK_DIV_LEN                               (6U)
#define GLB_GPADC_32M_CLK_DIV_MSK                               (((1U<<GLB_GPADC_32M_CLK_DIV_LEN)-1)<<GLB_GPADC_32M_CLK_DIV_POS)
#define GLB_GPADC_32M_CLK_DIV_UMSK                              (~(((1U<<GLB_GPADC_32M_CLK_DIV_LEN)-1)<<GLB_GPADC_32M_CLK_DIV_POS))
#define GLB_GPADC_32M_CLK_SEL                                   GLB_GPADC_32M_CLK_SEL
#define GLB_GPADC_32M_CLK_SEL_POS                               (7U)
#define GLB_GPADC_32M_CLK_SEL_LEN                               (1U)
#define GLB_GPADC_32M_CLK_SEL_MSK                               (((1U<<GLB_GPADC_32M_CLK_SEL_LEN)-1)<<GLB_GPADC_32M_CLK_SEL_POS)
#define GLB_GPADC_32M_CLK_SEL_UMSK                              (~(((1U<<GLB_GPADC_32M_CLK_SEL_LEN)-1)<<GLB_GPADC_32M_CLK_SEL_POS))
#define GLB_GPADC_32M_DIV_EN                                    GLB_GPADC_32M_DIV_EN
#define GLB_GPADC_32M_DIV_EN_POS                                (8U)
#define GLB_GPADC_32M_DIV_EN_LEN                                (1U)
#define GLB_GPADC_32M_DIV_EN_MSK                                (((1U<<GLB_GPADC_32M_DIV_EN_LEN)-1)<<GLB_GPADC_32M_DIV_EN_POS)
#define GLB_GPADC_32M_DIV_EN_UMSK                               (~(((1U<<GLB_GPADC_32M_DIV_EN_LEN)-1)<<GLB_GPADC_32M_DIV_EN_POS))

/* 0xA8 : DIG32K_WAKEUP_CTRL */
#define GLB_DIG32K_WAKEUP_CTRL_OFFSET                           (0xA8)
#define GLB_DIG_32K_DIV                                         GLB_DIG_32K_DIV
#define GLB_DIG_32K_DIV_POS                                     (0U)
#define GLB_DIG_32K_DIV_LEN                                     (11U)
#define GLB_DIG_32K_DIV_MSK                                     (((1U<<GLB_DIG_32K_DIV_LEN)-1)<<GLB_DIG_32K_DIV_POS)
#define GLB_DIG_32K_DIV_UMSK                                    (~(((1U<<GLB_DIG_32K_DIV_LEN)-1)<<GLB_DIG_32K_DIV_POS))
#define GLB_DIG_32K_EN                                          GLB_DIG_32K_EN
#define GLB_DIG_32K_EN_POS                                      (12U)
#define GLB_DIG_32K_EN_LEN                                      (1U)
#define GLB_DIG_32K_EN_MSK                                      (((1U<<GLB_DIG_32K_EN_LEN)-1)<<GLB_DIG_32K_EN_POS)
#define GLB_DIG_32K_EN_UMSK                                     (~(((1U<<GLB_DIG_32K_EN_LEN)-1)<<GLB_DIG_32K_EN_POS))
#define GLB_DIG_32K_COMP                                        GLB_DIG_32K_COMP
#define GLB_DIG_32K_COMP_POS                                    (13U)
#define GLB_DIG_32K_COMP_LEN                                    (1U)
#define GLB_DIG_32K_COMP_MSK                                    (((1U<<GLB_DIG_32K_COMP_LEN)-1)<<GLB_DIG_32K_COMP_POS)
#define GLB_DIG_32K_COMP_UMSK                                   (~(((1U<<GLB_DIG_32K_COMP_LEN)-1)<<GLB_DIG_32K_COMP_POS))
#define GLB_DIG_CLK_SRC_SEL                                     GLB_DIG_CLK_SRC_SEL
#define GLB_DIG_CLK_SRC_SEL_POS                                 (28U)
#define GLB_DIG_CLK_SRC_SEL_LEN                                 (1U)
#define GLB_DIG_CLK_SRC_SEL_MSK                                 (((1U<<GLB_DIG_CLK_SRC_SEL_LEN)-1)<<GLB_DIG_CLK_SRC_SEL_POS)
#define GLB_DIG_CLK_SRC_SEL_UMSK                                (~(((1U<<GLB_DIG_CLK_SRC_SEL_LEN)-1)<<GLB_DIG_CLK_SRC_SEL_POS))
#define GLB_SW_BLE_WAKEUP_REQ                                   GLB_SW_BLE_WAKEUP_REQ
#define GLB_SW_BLE_WAKEUP_REQ_POS                               (31U)
#define GLB_SW_BLE_WAKEUP_REQ_LEN                               (1U)
#define GLB_SW_BLE_WAKEUP_REQ_MSK                               (((1U<<GLB_SW_BLE_WAKEUP_REQ_LEN)-1)<<GLB_SW_BLE_WAKEUP_REQ_POS)
#define GLB_SW_BLE_WAKEUP_REQ_UMSK                              (~(((1U<<GLB_SW_BLE_WAKEUP_REQ_LEN)-1)<<GLB_SW_BLE_WAKEUP_REQ_POS))

/* 0xAC : WIFI_BT_COEX_CTRL */
#define GLB_WIFI_BT_COEX_CTRL_OFFSET                            (0xAC)

