bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0xB0 : BZ_COEX_CTRL */
#define GLB_BZ_COEX_CTRL_OFFSET                                 (0xB0)
#define GLB_COEX_EN                                             GLB_COEX_EN
#define GLB_COEX_EN_POS                                         (0U)
#define GLB_COEX_EN_LEN                                         (1U)
#define GLB_COEX_EN_MSK                                         (((1U<<GLB_COEX_EN_LEN)-1)<<GLB_COEX_EN_POS)
#define GLB_COEX_EN_UMSK                                        (~(((1U<<GLB_COEX_EN_LEN)-1)<<GLB_COEX_EN_POS))
#define GLB_WLAN_EN                                             GLB_WLAN_EN
#define GLB_WLAN_EN_POS                                         (1U)
#define GLB_WLAN_EN_LEN                                         (1U)
#define GLB_WLAN_EN_MSK                                         (((1U<<GLB_WLAN_EN_LEN)-1)<<GLB_WLAN_EN_POS)
#define GLB_WLAN_EN_UMSK                                        (~(((1U<<GLB_WLAN_EN_LEN)-1)<<GLB_WLAN_EN_POS))
#define GLB_BLE_RX_IGNORE                                       GLB_BLE_RX_IGNORE
#define GLB_BLE_RX_IGNORE_POS                                   (2U)
#define GLB_BLE_RX_IGNORE_LEN                                   (1U)
#define GLB_BLE_RX_IGNORE_MSK                                   (((1U<<GLB_BLE_RX_IGNORE_LEN)-1)<<GLB_BLE_RX_IGNORE_POS)
#define GLB_BLE_RX_IGNORE_UMSK                                  (~(((1U<<GLB_BLE_RX_IGNORE_LEN)-1)<<GLB_BLE_RX_IGNORE_POS))
#define GLB_M154_RX_IGNORE                                      GLB_M154_RX_IGNORE
#define GLB_M154_RX_IGNORE_POS                                  (3U)
#define GLB_M154_RX_IGNORE_LEN                                  (1U)
#define GLB_M154_RX_IGNORE_MSK                                  (((1U<<GLB_M154_RX_IGNORE_LEN)-1)<<GLB_M154_RX_IGNORE_POS)
#define GLB_M154_RX_IGNORE_UMSK                                 (~(((1U<<GLB_M154_RX_IGNORE_LEN)-1)<<GLB_M154_RX_IGNORE_POS))
#define GLB_BZ_PRI_THR                                          GLB_BZ_PRI_THR
#define GLB_BZ_PRI_THR_POS                                      (4U)
#define GLB_BZ_PRI_THR_LEN                                      (4U)
#define GLB_BZ_PRI_THR_MSK                                      (((1U<<GLB_BZ_PRI_THR_LEN)-1)<<GLB_BZ_PRI_THR_POS)
#define GLB_BZ_PRI_THR_UMSK                                     (~(((1U<<GLB_BZ_PRI_THR_LEN)-1)<<GLB_BZ_PRI_THR_POS))
#define GLB_BZ_PRI_EN                                           GLB_BZ_PRI_EN
#define GLB_BZ_PRI_EN_POS                                       (8U)
#define GLB_BZ_PRI_EN_LEN                                       (1U)
#define GLB_BZ_PRI_EN_MSK                                       (((1U<<GLB_BZ_PRI_EN_LEN)-1)<<GLB_BZ_PRI_EN_POS)
#define GLB_BZ_PRI_EN_UMSK                                      (~(((1U<<GLB_BZ_PRI_EN_LEN)-1)<<GLB_BZ_PRI_EN_POS))
#define GLB_BZ_PRI_POL                                          GLB_BZ_PRI_POL
#define GLB_BZ_PRI_POL_POS                                      (9U)
#define GLB_BZ_PRI_POL_LEN                                      (1U)
#define GLB_BZ_PRI_POL_MSK                                      (((1U<<GLB_BZ_PRI_POL_LEN)-1)<<GLB_BZ_PRI_POL_POS)
#define GLB_BZ_PRI_POL_UMSK                                     (~(((1U<<GLB_BZ_PRI_POL_LEN)-1)<<GLB_BZ_PRI_POL_POS))
#define GLB_BZ_ACTIVE_POL                                       GLB_BZ_ACTIVE_POL
#define GLB_BZ_ACTIVE_POL_POS                                   (10U)
#define GLB_BZ_ACTIVE_POL_LEN                                   (1U)
#define GLB_BZ_ACTIVE_POL_MSK                                   (((1U<<GLB_BZ_ACTIVE_POL_LEN)-1)<<GLB_BZ_ACTIVE_POL_POS)
#define GLB_BZ_ACTIVE_POL_UMSK                                  (~(((1U<<GLB_BZ_ACTIVE_POL_LEN)-1)<<GLB_BZ_ACTIVE_POL_POS))
#define GLB_BZ_ABORT_POL                                        GLB_BZ_ABORT_POL
#define GLB_BZ_ABORT_POL_POS                                    (11U)
#define GLB_BZ_ABORT_POL_LEN                                    (1U)
#define GLB_BZ_ABORT_POL_MSK                                    (((1U<<GLB_BZ_ABORT_POL_LEN)-1)<<GLB_BZ_ABORT_POL_POS)
#define GLB_BZ_ABORT_POL_UMSK                                   (~(((1U<<GLB_BZ_ABORT_POL_LEN)-1)<<GLB_BZ_ABORT_POL_POS))
#define GLB_COEX_PRI                                            GLB_COEX_PRI
#define GLB_COEX_PRI_POS                                        (12U)
#define GLB_COEX_PRI_LEN                                        (1U)
#define GLB_COEX_PRI_MSK                                        (((1U<<GLB_COEX_PRI_LEN)-1)<<GLB_COEX_PRI_POS)
#define GLB_COEX_PRI_UMSK                                       (~(((1U<<GLB_COEX_PRI_LEN)-1)<<GLB_COEX_PRI_POS))
#define GLB_FORCE_M154_WIN                                      GLB_FORCE_M154_WIN
#define GLB_FORCE_M154_WIN_POS                                  (13U)
#define GLB_FORCE_M154_WIN_LEN                                  (1U)
#define GLB_FORCE_M154_WIN_MSK                                  (((1U<<GLB_FORCE_M154_WIN_LEN)-1)<<GLB_FORCE_M154_WIN_POS)
#define GLB_FORCE_M154_WIN_UMSK                                 (~(((1U<<GLB_FORCE_M154_WIN_LEN)-1)<<GLB_FORCE_M154_WIN_POS))
#define GLB_FORCE_BLE_WIN                                       GLB_FORCE_BLE_WIN
#define GLB_FORCE_BLE_WIN_POS                                   (14U)
#define GLB_FORCE_BLE_WIN_LEN                                   (1U)
#define GLB_FORCE_BLE_WIN_MSK                                   (((1U<<GLB_FORCE_BLE_WIN_LEN)-1)<<GLB_FORCE_BLE_WIN_POS)
#define GLB_FORCE_BLE_WIN_UMSK                                  (~(((1U<<GLB_FORCE_BLE_WIN_LEN)-1)<<GLB_FORCE_BLE_WIN_POS))
#define GLB_COEX_OPTION                                         GLB_COEX_OPTION
#define GLB_COEX_OPTION_POS                                     (15U)
#define GLB_COEX_OPTION_LEN                                     (1U)
#define GLB_COEX_OPTION_MSK                                     (((1U<<GLB_COEX_OPTION_LEN)-1)<<GLB_COEX_OPTION_POS)
#define GLB_COEX_OPTION_UMSK                                    (~(((1U<<GLB_COEX_OPTION_LEN)-1)<<GLB_COEX_OPTION_POS))
#define GLB_COEX_FORCE_CH                                       GLB_COEX_FORCE_CH
#define GLB_COEX_FORCE_CH_POS                                   (16U)
#define GLB_COEX_FORCE_CH_LEN                                   (7U)
#define GLB_COEX_FORCE_CH_MSK                                   (((1U<<GLB_COEX_FORCE_CH_LEN)-1)<<GLB_COEX_FORCE_CH_POS)
#define GLB_COEX_FORCE_CH_UMSK                                  (~(((1U<<GLB_COEX_FORCE_CH_LEN)-1)<<GLB_COEX_FORCE_CH_POS))
#define GLB_M154_RX_ABORT_DIS                                   GLB_M154_RX_ABORT_DIS
#define GLB_M154_RX_ABORT_DIS_POS                               (24U)
#define GLB_M154_RX_ABORT_DIS_LEN                               (1U)
#define GLB_M154_RX_ABORT_DIS_MSK                               (((1U<<GLB_M154_RX_ABORT_DIS_LEN)-1)<<GLB_M154_RX_ABORT_DIS_POS)
#define GLB_M154_RX_ABORT_DIS_UMSK                              (~(((1U<<GLB_M154_RX_ABORT_DIS_LEN)-1)<<GLB_M154_RX_ABORT_DIS_POS))
#define GLB_M154_TX_ABORT_DIS                                   GLB_M154_TX_ABORT_DIS
#define GLB_M154_TX_ABORT_DIS_POS                               (25U)
#define GLB_M154_TX_ABORT_DIS_LEN                               (1U)
#define GLB_M154_TX_ABORT_DIS_MSK                               (((1U<<GLB_M154_TX_ABORT_DIS_LEN)-1)<<GLB_M154_TX_ABORT_DIS_POS)
#define GLB_M154_TX_ABORT_DIS_UMSK                              (~(((1U<<GLB_M154_TX_ABORT_DIS_LEN)-1)<<GLB_M154_TX_ABORT_DIS_POS))
#define GLB_BLE_RX_ABORT_DIS                                    GLB_BLE_RX_ABORT_DIS
#define GLB_BLE_RX_ABORT_DIS_POS                                (26U)
#define GLB_BLE_RX_ABORT_DIS_LEN                                (1U)
#define GLB_BLE_RX_ABORT_DIS_MSK                                (((1U<<GLB_BLE_RX_ABORT_DIS_LEN)-1)<<GLB_BLE_RX_ABORT_DIS_POS)
#define GLB_BLE_RX_ABORT_DIS_UMSK                               (~(((1U<<GLB_BLE_RX_ABORT_DIS_LEN)-1)<<GLB_BLE_RX_ABORT_DIS_POS))
#define GLB_BLE_TX_ABORT_DIS                                    GLB_BLE_TX_ABORT_DIS
#define GLB_BLE_TX_ABORT_DIS_POS                                (27U)
#define GLB_BLE_TX_ABORT_DIS_LEN                                (1U)
#define GLB_BLE_TX_ABORT_DIS_MSK                                (((1U<<GLB_BLE_TX_ABORT_DIS_LEN)-1)<<GLB_BLE_TX_ABORT_DIS_POS)
#define GLB_BLE_TX_ABORT_DIS_UMSK                               (~(((1U<<GLB_BLE_TX_ABORT_DIS_LEN)-1)<<GLB_BLE_TX_ABORT_DIS_POS))
#define GLB_COEX_ARB                                            GLB_COEX_ARB
#define GLB_COEX_ARB_POS                                        (28U)
#define GLB_COEX_ARB_LEN                                        (4U)
#define GLB_COEX_ARB_MSK                                        (((1U<<GLB_COEX_ARB_LEN)-1)<<GLB_COEX_ARB_POS)
#define GLB_COEX_ARB_UMSK                                       (~(((1U<<GLB_COEX_ARB_LEN)-1)<<GLB_COEX_ARB_POS))

/* 0xC0 : UART_SIG_SEL_0 */
#define GLB_UART_SIG_SEL_0_OFFSET                               (0xC0)
#define GLB_UART_SIG_0_SEL                                      GLB_UART_SIG_0_SEL
#define GLB_UART_SIG_0_SEL_POS                                  (0U)
#define GLB_UART_SIG_0_SEL_LEN                                  (4U)
#define GLB_UART_SIG_0_SEL_MSK                                  (((1U<<GLB_UART_SIG_0_SEL_LEN)-1)<<GLB_UART_SIG_0_SEL_POS)
#define GLB_UART_SIG_0_SEL_UMSK                                 (~(((1U<<GLB_UART_SIG_0_SEL_LEN)-1)<<GLB_UART_SIG_0_SEL_POS))
#define GLB_UART_SIG_1_SEL                                      GLB_UART_SIG_1_SEL
#define GLB_UART_SIG_1_SEL_POS                                  (4U)
#define GLB_UART_SIG_1_SEL_LEN                                  (4U)
#define GLB_UART_SIG_1_SEL_MSK                                  (((1U<<GLB_UART_SIG_1_SEL_LEN)-1)<<GLB_UART_SIG_1_SEL_POS)
#define GLB_UART_SIG_1_SEL_UMSK                                 (~(((1U<<GLB_UART_SIG_1_SEL_LEN)-1)<<GLB_UART_SIG_1_SEL_POS))
#define GLB_UART_SIG_2_SEL                                      GLB_UART_SIG_2_SEL
#define GLB_UART_SIG_2_SEL_POS                                  (8U)
#define GLB_UART_SIG_2_SEL_LEN                                  (4U)
#define GLB_UART_SIG_2_SEL_MSK                                  (((1U<<GLB_UART_SIG_2_SEL_LEN)-1)<<GLB_UART_SIG_2_SEL_POS)
#define GLB_UART_SIG_2_SEL_UMSK                                 (~(((1U<<GLB_UART_SIG_2_SEL_LEN)-1)<<GLB_UART_SIG_2_SEL_POS))
#define GLB_UART_SIG_3_SEL                                      GLB_UART_SIG_3_SEL
#define GLB_UART_SIG_3_SEL_POS                                  (12U)
#define GLB_UART_SIG_3_SEL_LEN                                  (4U)
#define GLB_UART_SIG_3_SEL_MSK                                  (((1U<<GLB_UART_SIG_3_SEL_LEN)-1)<<GLB_UART_SIG_3_SEL_POS)
#define GLB_UART_SIG_3_SEL_UMSK                                 (~(((1U<<GLB_UART_SIG_3_SEL_LEN)-1)<<GLB_UART_SIG_3_SEL_POS))

/* 0xD0 : DBG_SEL_LL */
#define GLB_DBG_SEL_LL_OFFSET                                   (0xD0)
#define GLB_REG_DBG_LL_CTRL                                     GLB_REG_DBG_LL_CTRL
#define GLB_REG_DBG_LL_CTRL_POS                                 (0U)
#define GLB_REG_DBG_LL_CTRL_LEN                                 (32U)
#define GLB_REG_DBG_LL_CTRL_MSK                                 (((1U<<GLB_REG_DBG_LL_CTRL_LEN)-1)<<GLB_REG_DBG_LL_CTRL_POS)
#define GLB_REG_DBG_LL_CTRL_UMSK                                (~(((1U<<GLB_REG_DBG_LL_CTRL_LEN)-1)<<GLB_REG_DBG_LL_CTRL_POS))

/* 0xD4 : DBG_SEL_LH */
#define GLB_DBG_SEL_LH_OFFSET                                   (0xD4)
#define GLB_REG_DBG_LH_CTRL                                     GLB_REG_DBG_LH_CTRL
#define GLB_REG_DBG_LH_CTRL_POS                                 (0U)
#define GLB_REG_DBG_LH_CTRL_LEN                                 (32U)
#define GLB_REG_DBG_LH_CTRL_MSK                                 (((1U<<GLB_REG_DBG_LH_CTRL_LEN)-1)<<GLB_REG_DBG_LH_CTRL_POS)
#define GLB_REG_DBG_LH_CTRL_UMSK                                (~(((1U<<GLB_REG_DBG_LH_CTRL_LEN)-1)<<GLB_REG_DBG_LH_CTRL_POS))

/* 0xD8 : DBG_SEL_HL */
#define GLB_DBG_SEL_HL_OFFSET                                   (0xD8)
#define GLB_REG_DBG_HL_CTRL                                     GLB_REG_DBG_HL_CTRL
#define GLB_REG_DBG_HL_CTRL_POS                                 (0U)
#define GLB_REG_DBG_HL_CTRL_LEN                                 (32U)
#define GLB_REG_DBG_HL_CTRL_MSK                                 (((1U<<GLB_REG_DBG_HL_CTRL_LEN)-1)<<GLB_REG_DBG_HL_CTRL_POS)
#define GLB_REG_DBG_HL_CTRL_UMSK                                (~(((1U<<GLB_REG_DBG_HL_CTRL_LEN)-1)<<GLB_REG_DBG_HL_CTRL_POS))

/* 0xDC : DBG_SEL_HH */
#define GLB_DBG_SEL_HH_OFFSET                                   (0xDC)
#define GLB_REG_DBG_HH_CTRL                                     GLB_REG_DBG_HH_CTRL
#define GLB_REG_DBG_HH_CTRL_POS                                 (0U)
#define GLB_REG_DBG_HH_CTRL_LEN                                 (32U)
#define GLB_REG_DBG_HH_CTRL_MSK                                 (((1U<<GLB_REG_DBG_HH_CTRL_LEN)-1)<<GLB_REG_DBG_HH_CTRL_POS)
#define GLB_REG_DBG_HH_CTRL_UMSK                                (~(((1U<<GLB_REG_DBG_HH_CTRL_LEN)-1)<<GLB_REG_DBG_HH_CTRL_POS))

/* 0xE0 : debug */
#define GLB_DEBUG_OFFSET                                        (0xE0)
#define GLB_DEBUG_OE                                            GLB_DEBUG_OE
#define GLB_DEBUG_OE_POS                                        (0U)
#define GLB_DEBUG_OE_LEN                                        (1U)
#define GLB_DEBUG_OE_MSK                                        (((1U<<GLB_DEBUG_OE_LEN)-1)<<GLB_DEBUG_OE_POS)
#define GLB_DEBUG_OE_UMSK                                       (~(((1U<<GLB_DEBUG_OE_LEN)-1)<<GLB_DEBUG_OE_POS))
#define GLB_DEBUG_I                                             GLB_DEBUG_I
#define GLB_DEBUG_I_POS                                         (1U)
#define GLB_DEBUG_I_LEN                                         (31U)
#define GLB_DEBUG_I_MSK                                         (((1U<<GLB_DEBUG_I_LEN)-1)<<GLB_DEBUG_I_POS)
#define GLB_DEBUG_I_UMSK                                        (~(((1U<<GLB_DEBUG_I_LEN)-1)<<GLB_DEBUG_I_POS))

