bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x100 : GPIO_CFGCTL0 */
#define GLB_GPIO_CFGCTL0_OFFSET                                 (0x100)
#define GLB_REG_GPIO_0_IE                                       GLB_REG_GPIO_0_IE
#define GLB_REG_GPIO_0_IE_POS                                   (0U)
#define GLB_REG_GPIO_0_IE_LEN                                   (1U)
#define GLB_REG_GPIO_0_IE_MSK                                   (((1U<<GLB_REG_GPIO_0_IE_LEN)-1)<<GLB_REG_GPIO_0_IE_POS)
#define GLB_REG_GPIO_0_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_0_IE_LEN)-1)<<GLB_REG_GPIO_0_IE_POS))
#define GLB_REG_GPIO_0_SMT                                      GLB_REG_GPIO_0_SMT
#define GLB_REG_GPIO_0_SMT_POS                                  (1U)
#define GLB_REG_GPIO_0_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_0_SMT_MSK                                  (((1U<<GLB_REG_GPIO_0_SMT_LEN)-1)<<GLB_REG_GPIO_0_SMT_POS)
#define GLB_REG_GPIO_0_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_0_SMT_LEN)-1)<<GLB_REG_GPIO_0_SMT_POS))
#define GLB_REG_GPIO_0_DRV                                      GLB_REG_GPIO_0_DRV
#define GLB_REG_GPIO_0_DRV_POS                                  (2U)
#define GLB_REG_GPIO_0_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_0_DRV_MSK                                  (((1U<<GLB_REG_GPIO_0_DRV_LEN)-1)<<GLB_REG_GPIO_0_DRV_POS)
#define GLB_REG_GPIO_0_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_0_DRV_LEN)-1)<<GLB_REG_GPIO_0_DRV_POS))
#define GLB_REG_GPIO_0_PU                                       GLB_REG_GPIO_0_PU
#define GLB_REG_GPIO_0_PU_POS                                   (4U)
#define GLB_REG_GPIO_0_PU_LEN                                   (1U)
#define GLB_REG_GPIO_0_PU_MSK                                   (((1U<<GLB_REG_GPIO_0_PU_LEN)-1)<<GLB_REG_GPIO_0_PU_POS)
#define GLB_REG_GPIO_0_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_0_PU_LEN)-1)<<GLB_REG_GPIO_0_PU_POS))
#define GLB_REG_GPIO_0_PD                                       GLB_REG_GPIO_0_PD
#define GLB_REG_GPIO_0_PD_POS                                   (5U)
#define GLB_REG_GPIO_0_PD_LEN                                   (1U)
#define GLB_REG_GPIO_0_PD_MSK                                   (((1U<<GLB_REG_GPIO_0_PD_LEN)-1)<<GLB_REG_GPIO_0_PD_POS)
#define GLB_REG_GPIO_0_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_0_PD_LEN)-1)<<GLB_REG_GPIO_0_PD_POS))
#define GLB_REG_GPIO_0_FUNC_SEL                                 GLB_REG_GPIO_0_FUNC_SEL
#define GLB_REG_GPIO_0_FUNC_SEL_POS                             (8U)
#define GLB_REG_GPIO_0_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_0_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_0_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_0_FUNC_SEL_POS)
#define GLB_REG_GPIO_0_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_0_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_0_FUNC_SEL_POS))
#define GLB_REG_GPIO_0_MODE                                     GLB_REG_GPIO_0_MODE
#define GLB_REG_GPIO_0_MODE_POS                                 (15U)
#define GLB_REG_GPIO_0_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_0_MODE_MSK                                 (((1U<<GLB_REG_GPIO_0_MODE_LEN)-1)<<GLB_REG_GPIO_0_MODE_POS)
#define GLB_REG_GPIO_0_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_0_MODE_LEN)-1)<<GLB_REG_GPIO_0_MODE_POS))
#define GLB_REG_GPIO_1_IE                                       GLB_REG_GPIO_1_IE
#define GLB_REG_GPIO_1_IE_POS                                   (16U)
#define GLB_REG_GPIO_1_IE_LEN                                   (1U)
#define GLB_REG_GPIO_1_IE_MSK                                   (((1U<<GLB_REG_GPIO_1_IE_LEN)-1)<<GLB_REG_GPIO_1_IE_POS)
#define GLB_REG_GPIO_1_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_1_IE_LEN)-1)<<GLB_REG_GPIO_1_IE_POS))
#define GLB_REG_GPIO_1_SMT                                      GLB_REG_GPIO_1_SMT
#define GLB_REG_GPIO_1_SMT_POS                                  (17U)
#define GLB_REG_GPIO_1_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_1_SMT_MSK                                  (((1U<<GLB_REG_GPIO_1_SMT_LEN)-1)<<GLB_REG_GPIO_1_SMT_POS)
#define GLB_REG_GPIO_1_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_1_SMT_LEN)-1)<<GLB_REG_GPIO_1_SMT_POS))
#define GLB_REG_GPIO_1_DRV                                      GLB_REG_GPIO_1_DRV
#define GLB_REG_GPIO_1_DRV_POS                                  (18U)
#define GLB_REG_GPIO_1_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_1_DRV_MSK                                  (((1U<<GLB_REG_GPIO_1_DRV_LEN)-1)<<GLB_REG_GPIO_1_DRV_POS)
#define GLB_REG_GPIO_1_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_1_DRV_LEN)-1)<<GLB_REG_GPIO_1_DRV_POS))
#define GLB_REG_GPIO_1_PU                                       GLB_REG_GPIO_1_PU
#define GLB_REG_GPIO_1_PU_POS                                   (20U)
#define GLB_REG_GPIO_1_PU_LEN                                   (1U)
#define GLB_REG_GPIO_1_PU_MSK                                   (((1U<<GLB_REG_GPIO_1_PU_LEN)-1)<<GLB_REG_GPIO_1_PU_POS)
#define GLB_REG_GPIO_1_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_1_PU_LEN)-1)<<GLB_REG_GPIO_1_PU_POS))
#define GLB_REG_GPIO_1_PD                                       GLB_REG_GPIO_1_PD
#define GLB_REG_GPIO_1_PD_POS                                   (21U)
#define GLB_REG_GPIO_1_PD_LEN                                   (1U)
#define GLB_REG_GPIO_1_PD_MSK                                   (((1U<<GLB_REG_GPIO_1_PD_LEN)-1)<<GLB_REG_GPIO_1_PD_POS)
#define GLB_REG_GPIO_1_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_1_PD_LEN)-1)<<GLB_REG_GPIO_1_PD_POS))
#define GLB_REG_GPIO_1_FUNC_SEL                                 GLB_REG_GPIO_1_FUNC_SEL
#define GLB_REG_GPIO_1_FUNC_SEL_POS                             (24U)
#define GLB_REG_GPIO_1_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_1_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_1_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_1_FUNC_SEL_POS)
#define GLB_REG_GPIO_1_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_1_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_1_FUNC_SEL_POS))
#define GLB_REG_GPIO_1_MODE                                     GLB_REG_GPIO_1_MODE
#define GLB_REG_GPIO_1_MODE_POS                                 (31U)
#define GLB_REG_GPIO_1_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_1_MODE_MSK                                 (((1U<<GLB_REG_GPIO_1_MODE_LEN)-1)<<GLB_REG_GPIO_1_MODE_POS)
#define GLB_REG_GPIO_1_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_1_MODE_LEN)-1)<<GLB_REG_GPIO_1_MODE_POS))

/* 0x104 : GPIO_CFGCTL1 */
#define GLB_GPIO_CFGCTL1_OFFSET                                 (0x104)
#define GLB_REG_GPIO_2_IE                                       GLB_REG_GPIO_2_IE
#define GLB_REG_GPIO_2_IE_POS                                   (0U)
#define GLB_REG_GPIO_2_IE_LEN                                   (1U)
#define GLB_REG_GPIO_2_IE_MSK                                   (((1U<<GLB_REG_GPIO_2_IE_LEN)-1)<<GLB_REG_GPIO_2_IE_POS)
#define GLB_REG_GPIO_2_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_2_IE_LEN)-1)<<GLB_REG_GPIO_2_IE_POS))
#define GLB_REG_GPIO_2_SMT                                      GLB_REG_GPIO_2_SMT
#define GLB_REG_GPIO_2_SMT_POS                                  (1U)
#define GLB_REG_GPIO_2_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_2_SMT_MSK                                  (((1U<<GLB_REG_GPIO_2_SMT_LEN)-1)<<GLB_REG_GPIO_2_SMT_POS)
#define GLB_REG_GPIO_2_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_2_SMT_LEN)-1)<<GLB_REG_GPIO_2_SMT_POS))
#define GLB_REG_GPIO_2_DRV                                      GLB_REG_GPIO_2_DRV
#define GLB_REG_GPIO_2_DRV_POS                                  (2U)
#define GLB_REG_GPIO_2_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_2_DRV_MSK                                  (((1U<<GLB_REG_GPIO_2_DRV_LEN)-1)<<GLB_REG_GPIO_2_DRV_POS)
#define GLB_REG_GPIO_2_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_2_DRV_LEN)-1)<<GLB_REG_GPIO_2_DRV_POS))
#define GLB_REG_GPIO_2_PU                                       GLB_REG_GPIO_2_PU
#define GLB_REG_GPIO_2_PU_POS                                   (4U)
#define GLB_REG_GPIO_2_PU_LEN                                   (1U)
#define GLB_REG_GPIO_2_PU_MSK                                   (((1U<<GLB_REG_GPIO_2_PU_LEN)-1)<<GLB_REG_GPIO_2_PU_POS)
#define GLB_REG_GPIO_2_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_2_PU_LEN)-1)<<GLB_REG_GPIO_2_PU_POS))
#define GLB_REG_GPIO_2_PD                                       GLB_REG_GPIO_2_PD
#define GLB_REG_GPIO_2_PD_POS                                   (5U)
#define GLB_REG_GPIO_2_PD_LEN                                   (1U)
#define GLB_REG_GPIO_2_PD_MSK                                   (((1U<<GLB_REG_GPIO_2_PD_LEN)-1)<<GLB_REG_GPIO_2_PD_POS)
#define GLB_REG_GPIO_2_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_2_PD_LEN)-1)<<GLB_REG_GPIO_2_PD_POS))
#define GLB_REG_GPIO_2_FUNC_SEL                                 GLB_REG_GPIO_2_FUNC_SEL
#define GLB_REG_GPIO_2_FUNC_SEL_POS                             (8U)
#define GLB_REG_GPIO_2_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_2_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_2_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_2_FUNC_SEL_POS)
#define GLB_REG_GPIO_2_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_2_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_2_FUNC_SEL_POS))
#define GLB_REG_GPIO_2_MODE                                     GLB_REG_GPIO_2_MODE
#define GLB_REG_GPIO_2_MODE_POS                                 (15U)
#define GLB_REG_GPIO_2_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_2_MODE_MSK                                 (((1U<<GLB_REG_GPIO_2_MODE_LEN)-1)<<GLB_REG_GPIO_2_MODE_POS)
#define GLB_REG_GPIO_2_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_2_MODE_LEN)-1)<<GLB_REG_GPIO_2_MODE_POS))
#define GLB_REG_GPIO_3_IE                                       GLB_REG_GPIO_3_IE
#define GLB_REG_GPIO_3_IE_POS                                   (16U)
#define GLB_REG_GPIO_3_IE_LEN                                   (1U)
#define GLB_REG_GPIO_3_IE_MSK                                   (((1U<<GLB_REG_GPIO_3_IE_LEN)-1)<<GLB_REG_GPIO_3_IE_POS)
#define GLB_REG_GPIO_3_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_3_IE_LEN)-1)<<GLB_REG_GPIO_3_IE_POS))
#define GLB_REG_GPIO_3_SMT                                      GLB_REG_GPIO_3_SMT
#define GLB_REG_GPIO_3_SMT_POS                                  (17U)
#define GLB_REG_GPIO_3_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_3_SMT_MSK                                  (((1U<<GLB_REG_GPIO_3_SMT_LEN)-1)<<GLB_REG_GPIO_3_SMT_POS)
#define GLB_REG_GPIO_3_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_3_SMT_LEN)-1)<<GLB_REG_GPIO_3_SMT_POS))
#define GLB_REG_GPIO_3_DRV                                      GLB_REG_GPIO_3_DRV
#define GLB_REG_GPIO_3_DRV_POS                                  (18U)
#define GLB_REG_GPIO_3_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_3_DRV_MSK                                  (((1U<<GLB_REG_GPIO_3_DRV_LEN)-1)<<GLB_REG_GPIO_3_DRV_POS)
#define GLB_REG_GPIO_3_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_3_DRV_LEN)-1)<<GLB_REG_GPIO_3_DRV_POS))
#define GLB_REG_GPIO_3_PU                                       GLB_REG_GPIO_3_PU
#define GLB_REG_GPIO_3_PU_POS                                   (20U)
#define GLB_REG_GPIO_3_PU_LEN                                   (1U)
#define GLB_REG_GPIO_3_PU_MSK                                   (((1U<<GLB_REG_GPIO_3_PU_LEN)-1)<<GLB_REG_GPIO_3_PU_POS)
#define GLB_REG_GPIO_3_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_3_PU_LEN)-1)<<GLB_REG_GPIO_3_PU_POS))
#define GLB_REG_GPIO_3_PD                                       GLB_REG_GPIO_3_PD
#define GLB_REG_GPIO_3_PD_POS                                   (21U)
#define GLB_REG_GPIO_3_PD_LEN                                   (1U)
#define GLB_REG_GPIO_3_PD_MSK                                   (((1U<<GLB_REG_GPIO_3_PD_LEN)-1)<<GLB_REG_GPIO_3_PD_POS)
#define GLB_REG_GPIO_3_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_3_PD_LEN)-1)<<GLB_REG_GPIO_3_PD_POS))
#define GLB_REG_GPIO_3_FUNC_SEL                                 GLB_REG_GPIO_3_FUNC_SEL
#define GLB_REG_GPIO_3_FUNC_SEL_POS                             (24U)
#define GLB_REG_GPIO_3_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_3_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_3_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_3_FUNC_SEL_POS)
#define GLB_REG_GPIO_3_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_3_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_3_FUNC_SEL_POS))
#define GLB_REG_GPIO_3_MODE                                     GLB_REG_GPIO_3_MODE
#define GLB_REG_GPIO_3_MODE_POS                                 (31U)
#define GLB_REG_GPIO_3_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_3_MODE_MSK                                 (((1U<<GLB_REG_GPIO_3_MODE_LEN)-1)<<GLB_REG_GPIO_3_MODE_POS)
#define GLB_REG_GPIO_3_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_3_MODE_LEN)-1)<<GLB_REG_GPIO_3_MODE_POS))

/* 0x108 : GPIO_CFGCTL2 */
#define GLB_GPIO_CFGCTL2_OFFSET                                 (0x108)

/* 0x10C : GPIO_CFGCTL3 */
#define GLB_GPIO_CFGCTL3_OFFSET                                 (0x10C)
#define GLB_REG_GPIO_7_IE                                       GLB_REG_GPIO_7_IE
#define GLB_REG_GPIO_7_IE_POS                                   (16U)
#define GLB_REG_GPIO_7_IE_LEN                                   (1U)
#define GLB_REG_GPIO_7_IE_MSK                                   (((1U<<GLB_REG_GPIO_7_IE_LEN)-1)<<GLB_REG_GPIO_7_IE_POS)
#define GLB_REG_GPIO_7_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_7_IE_LEN)-1)<<GLB_REG_GPIO_7_IE_POS))
#define GLB_REG_GPIO_7_SMT                                      GLB_REG_GPIO_7_SMT
#define GLB_REG_GPIO_7_SMT_POS                                  (17U)
#define GLB_REG_GPIO_7_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_7_SMT_MSK                                  (((1U<<GLB_REG_GPIO_7_SMT_LEN)-1)<<GLB_REG_GPIO_7_SMT_POS)
#define GLB_REG_GPIO_7_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_7_SMT_LEN)-1)<<GLB_REG_GPIO_7_SMT_POS))
#define GLB_REG_GPIO_7_DRV                                      GLB_REG_GPIO_7_DRV
#define GLB_REG_GPIO_7_DRV_POS                                  (18U)
#define GLB_REG_GPIO_7_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_7_DRV_MSK                                  (((1U<<GLB_REG_GPIO_7_DRV_LEN)-1)<<GLB_REG_GPIO_7_DRV_POS)
#define GLB_REG_GPIO_7_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_7_DRV_LEN)-1)<<GLB_REG_GPIO_7_DRV_POS))
#define GLB_REG_GPIO_7_PU                                       GLB_REG_GPIO_7_PU
#define GLB_REG_GPIO_7_PU_POS                                   (20U)
#define GLB_REG_GPIO_7_PU_LEN                                   (1U)
#define GLB_REG_GPIO_7_PU_MSK                                   (((1U<<GLB_REG_GPIO_7_PU_LEN)-1)<<GLB_REG_GPIO_7_PU_POS)
#define GLB_REG_GPIO_7_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_7_PU_LEN)-1)<<GLB_REG_GPIO_7_PU_POS))
#define GLB_REG_GPIO_7_PD                                       GLB_REG_GPIO_7_PD
#define GLB_REG_GPIO_7_PD_POS                                   (21U)
#define GLB_REG_GPIO_7_PD_LEN                                   (1U)
#define GLB_REG_GPIO_7_PD_MSK                                   (((1U<<GLB_REG_GPIO_7_PD_LEN)-1)<<GLB_REG_GPIO_7_PD_POS)
#define GLB_REG_GPIO_7_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_7_PD_LEN)-1)<<GLB_REG_GPIO_7_PD_POS))
#define GLB_REG_GPIO_7_FUNC_SEL                                 GLB_REG_GPIO_7_FUNC_SEL
#define GLB_REG_GPIO_7_FUNC_SEL_POS                             (24U)
#define GLB_REG_GPIO_7_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_7_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_7_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_7_FUNC_SEL_POS)
#define GLB_REG_GPIO_7_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_7_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_7_FUNC_SEL_POS))
#define GLB_REG_GPIO_7_MODE                                     GLB_REG_GPIO_7_MODE
#define GLB_REG_GPIO_7_MODE_POS                                 (31U)
#define GLB_REG_GPIO_7_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_7_MODE_MSK                                 (((1U<<GLB_REG_GPIO_7_MODE_LEN)-1)<<GLB_REG_GPIO_7_MODE_POS)
#define GLB_REG_GPIO_7_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_7_MODE_LEN)-1)<<GLB_REG_GPIO_7_MODE_POS))

/* 0x110 : GPIO_CFGCTL4 */
#define GLB_GPIO_CFGCTL4_OFFSET                                 (0x110)
#define GLB_REG_GPIO_8_IE                                       GLB_REG_GPIO_8_IE
#define GLB_REG_GPIO_8_IE_POS                                   (0U)
#define GLB_REG_GPIO_8_IE_LEN                                   (1U)
#define GLB_REG_GPIO_8_IE_MSK                                   (((1U<<GLB_REG_GPIO_8_IE_LEN)-1)<<GLB_REG_GPIO_8_IE_POS)
#define GLB_REG_GPIO_8_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_8_IE_LEN)-1)<<GLB_REG_GPIO_8_IE_POS))
#define GLB_REG_GPIO_8_SMT                                      GLB_REG_GPIO_8_SMT
#define GLB_REG_GPIO_8_SMT_POS                                  (1U)
#define GLB_REG_GPIO_8_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_8_SMT_MSK                                  (((1U<<GLB_REG_GPIO_8_SMT_LEN)-1)<<GLB_REG_GPIO_8_SMT_POS)
#define GLB_REG_GPIO_8_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_8_SMT_LEN)-1)<<GLB_REG_GPIO_8_SMT_POS))
#define GLB_REG_GPIO_8_DRV                                      GLB_REG_GPIO_8_DRV
#define GLB_REG_GPIO_8_DRV_POS                                  (2U)
#define GLB_REG_GPIO_8_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_8_DRV_MSK                                  (((1U<<GLB_REG_GPIO_8_DRV_LEN)-1)<<GLB_REG_GPIO_8_DRV_POS)
#define GLB_REG_GPIO_8_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_8_DRV_LEN)-1)<<GLB_REG_GPIO_8_DRV_POS))
#define GLB_REG_GPIO_8_PU                                       GLB_REG_GPIO_8_PU
#define GLB_REG_GPIO_8_PU_POS                                   (4U)
#define GLB_REG_GPIO_8_PU_LEN                                   (1U)
#define GLB_REG_GPIO_8_PU_MSK                                   (((1U<<GLB_REG_GPIO_8_PU_LEN)-1)<<GLB_REG_GPIO_8_PU_POS)
#define GLB_REG_GPIO_8_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_8_PU_LEN)-1)<<GLB_REG_GPIO_8_PU_POS))
#define GLB_REG_GPIO_8_PD                                       GLB_REG_GPIO_8_PD
#define GLB_REG_GPIO_8_PD_POS                                   (5U)
#define GLB_REG_GPIO_8_PD_LEN                                   (1U)
#define GLB_REG_GPIO_8_PD_MSK                                   (((1U<<GLB_REG_GPIO_8_PD_LEN)-1)<<GLB_REG_GPIO_8_PD_POS)
#define GLB_REG_GPIO_8_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_8_PD_LEN)-1)<<GLB_REG_GPIO_8_PD_POS))
#define GLB_REG_GPIO_8_FUNC_SEL                                 GLB_REG_GPIO_8_FUNC_SEL
#define GLB_REG_GPIO_8_FUNC_SEL_POS                             (8U)
#define GLB_REG_GPIO_8_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_8_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_8_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_8_FUNC_SEL_POS)
#define GLB_REG_GPIO_8_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_8_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_8_FUNC_SEL_POS))
#define GLB_REG_GPIO_8_MODE                                     GLB_REG_GPIO_8_MODE
#define GLB_REG_GPIO_8_MODE_POS                                 (15U)
#define GLB_REG_GPIO_8_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_8_MODE_MSK                                 (((1U<<GLB_REG_GPIO_8_MODE_LEN)-1)<<GLB_REG_GPIO_8_MODE_POS)
#define GLB_REG_GPIO_8_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_8_MODE_LEN)-1)<<GLB_REG_GPIO_8_MODE_POS))
#define GLB_REG_GPIO_9_IE                                       GLB_REG_GPIO_9_IE
#define GLB_REG_GPIO_9_IE_POS                                   (16U)
#define GLB_REG_GPIO_9_IE_LEN                                   (1U)
#define GLB_REG_GPIO_9_IE_MSK                                   (((1U<<GLB_REG_GPIO_9_IE_LEN)-1)<<GLB_REG_GPIO_9_IE_POS)
#define GLB_REG_GPIO_9_IE_UMSK                                  (~(((1U<<GLB_REG_GPIO_9_IE_LEN)-1)<<GLB_REG_GPIO_9_IE_POS))
#define GLB_REG_GPIO_9_SMT                                      GLB_REG_GPIO_9_SMT
#define GLB_REG_GPIO_9_SMT_POS                                  (17U)
#define GLB_REG_GPIO_9_SMT_LEN                                  (1U)
#define GLB_REG_GPIO_9_SMT_MSK                                  (((1U<<GLB_REG_GPIO_9_SMT_LEN)-1)<<GLB_REG_GPIO_9_SMT_POS)
#define GLB_REG_GPIO_9_SMT_UMSK                                 (~(((1U<<GLB_REG_GPIO_9_SMT_LEN)-1)<<GLB_REG_GPIO_9_SMT_POS))
#define GLB_REG_GPIO_9_DRV                                      GLB_REG_GPIO_9_DRV
#define GLB_REG_GPIO_9_DRV_POS                                  (18U)
#define GLB_REG_GPIO_9_DRV_LEN                                  (2U)
#define GLB_REG_GPIO_9_DRV_MSK                                  (((1U<<GLB_REG_GPIO_9_DRV_LEN)-1)<<GLB_REG_GPIO_9_DRV_POS)
#define GLB_REG_GPIO_9_DRV_UMSK                                 (~(((1U<<GLB_REG_GPIO_9_DRV_LEN)-1)<<GLB_REG_GPIO_9_DRV_POS))
#define GLB_REG_GPIO_9_PU                                       GLB_REG_GPIO_9_PU
#define GLB_REG_GPIO_9_PU_POS                                   (20U)
#define GLB_REG_GPIO_9_PU_LEN                                   (1U)
#define GLB_REG_GPIO_9_PU_MSK                                   (((1U<<GLB_REG_GPIO_9_PU_LEN)-1)<<GLB_REG_GPIO_9_PU_POS)
#define GLB_REG_GPIO_9_PU_UMSK                                  (~(((1U<<GLB_REG_GPIO_9_PU_LEN)-1)<<GLB_REG_GPIO_9_PU_POS))
#define GLB_REG_GPIO_9_PD                                       GLB_REG_GPIO_9_PD
#define GLB_REG_GPIO_9_PD_POS                                   (21U)
#define GLB_REG_GPIO_9_PD_LEN                                   (1U)
#define GLB_REG_GPIO_9_PD_MSK                                   (((1U<<GLB_REG_GPIO_9_PD_LEN)-1)<<GLB_REG_GPIO_9_PD_POS)
#define GLB_REG_GPIO_9_PD_UMSK                                  (~(((1U<<GLB_REG_GPIO_9_PD_LEN)-1)<<GLB_REG_GPIO_9_PD_POS))
#define GLB_REG_GPIO_9_FUNC_SEL                                 GLB_REG_GPIO_9_FUNC_SEL
#define GLB_REG_GPIO_9_FUNC_SEL_POS                             (24U)
#define GLB_REG_GPIO_9_FUNC_SEL_LEN                             (5U)
#define GLB_REG_GPIO_9_FUNC_SEL_MSK                             (((1U<<GLB_REG_GPIO_9_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_9_FUNC_SEL_POS)
#define GLB_REG_GPIO_9_FUNC_SEL_UMSK                            (~(((1U<<GLB_REG_GPIO_9_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_9_FUNC_SEL_POS))
#define GLB_REG_GPIO_9_MODE                                     GLB_REG_GPIO_9_MODE
#define GLB_REG_GPIO_9_MODE_POS                                 (31U)
#define GLB_REG_GPIO_9_MODE_LEN                                 (1U)
#define GLB_REG_GPIO_9_MODE_MSK                                 (((1U<<GLB_REG_GPIO_9_MODE_LEN)-1)<<GLB_REG_GPIO_9_MODE_POS)
#define GLB_REG_GPIO_9_MODE_UMSK                                (~(((1U<<GLB_REG_GPIO_9_MODE_LEN)-1)<<GLB_REG_GPIO_9_MODE_POS))

