bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x114 : GPIO_CFGCTL5 */
#define GLB_GPIO_CFGCTL5_OFFSET                                 (0x114)
#define GLB_REG_GPIO_10_IE                                      GLB_REG_GPIO_10_IE
#define GLB_REG_GPIO_10_IE_POS                                  (0U)
#define GLB_REG_GPIO_10_IE_LEN                                  (1U)
#define GLB_REG_GPIO_10_IE_MSK                                  (((1U<<GLB_REG_GPIO_10_IE_LEN)-1)<<GLB_REG_GPIO_10_IE_POS)
#define GLB_REG_GPIO_10_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_10_IE_LEN)-1)<<GLB_REG_GPIO_10_IE_POS))
#define GLB_REG_GPIO_10_SMT                                     GLB_REG_GPIO_10_SMT
#define GLB_REG_GPIO_10_SMT_POS                                 (1U)
#define GLB_REG_GPIO_10_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_10_SMT_MSK                                 (((1U<<GLB_REG_GPIO_10_SMT_LEN)-1)<<GLB_REG_GPIO_10_SMT_POS)
#define GLB_REG_GPIO_10_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_10_SMT_LEN)-1)<<GLB_REG_GPIO_10_SMT_POS))
#define GLB_REG_GPIO_10_DRV                                     GLB_REG_GPIO_10_DRV
#define GLB_REG_GPIO_10_DRV_POS                                 (2U)
#define GLB_REG_GPIO_10_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_10_DRV_MSK                                 (((1U<<GLB_REG_GPIO_10_DRV_LEN)-1)<<GLB_REG_GPIO_10_DRV_POS)
#define GLB_REG_GPIO_10_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_10_DRV_LEN)-1)<<GLB_REG_GPIO_10_DRV_POS))
#define GLB_REG_GPIO_10_PU                                      GLB_REG_GPIO_10_PU
#define GLB_REG_GPIO_10_PU_POS                                  (4U)
#define GLB_REG_GPIO_10_PU_LEN                                  (1U)
#define GLB_REG_GPIO_10_PU_MSK                                  (((1U<<GLB_REG_GPIO_10_PU_LEN)-1)<<GLB_REG_GPIO_10_PU_POS)
#define GLB_REG_GPIO_10_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_10_PU_LEN)-1)<<GLB_REG_GPIO_10_PU_POS))
#define GLB_REG_GPIO_10_PD                                      GLB_REG_GPIO_10_PD
#define GLB_REG_GPIO_10_PD_POS                                  (5U)
#define GLB_REG_GPIO_10_PD_LEN                                  (1U)
#define GLB_REG_GPIO_10_PD_MSK                                  (((1U<<GLB_REG_GPIO_10_PD_LEN)-1)<<GLB_REG_GPIO_10_PD_POS)
#define GLB_REG_GPIO_10_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_10_PD_LEN)-1)<<GLB_REG_GPIO_10_PD_POS))
#define GLB_REG_GPIO_10_FUNC_SEL                                GLB_REG_GPIO_10_FUNC_SEL
#define GLB_REG_GPIO_10_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_10_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_10_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_10_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_10_FUNC_SEL_POS)
#define GLB_REG_GPIO_10_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_10_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_10_FUNC_SEL_POS))
#define GLB_REG_GPIO_10_MODE                                    GLB_REG_GPIO_10_MODE
#define GLB_REG_GPIO_10_MODE_POS                                (15U)
#define GLB_REG_GPIO_10_MODE_LEN                                (1U)
#define GLB_REG_GPIO_10_MODE_MSK                                (((1U<<GLB_REG_GPIO_10_MODE_LEN)-1)<<GLB_REG_GPIO_10_MODE_POS)
#define GLB_REG_GPIO_10_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_10_MODE_LEN)-1)<<GLB_REG_GPIO_10_MODE_POS))
#define GLB_REG_GPIO_11_IE                                      GLB_REG_GPIO_11_IE
#define GLB_REG_GPIO_11_IE_POS                                  (16U)
#define GLB_REG_GPIO_11_IE_LEN                                  (1U)
#define GLB_REG_GPIO_11_IE_MSK                                  (((1U<<GLB_REG_GPIO_11_IE_LEN)-1)<<GLB_REG_GPIO_11_IE_POS)
#define GLB_REG_GPIO_11_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_11_IE_LEN)-1)<<GLB_REG_GPIO_11_IE_POS))
#define GLB_REG_GPIO_11_SMT                                     GLB_REG_GPIO_11_SMT
#define GLB_REG_GPIO_11_SMT_POS                                 (17U)
#define GLB_REG_GPIO_11_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_11_SMT_MSK                                 (((1U<<GLB_REG_GPIO_11_SMT_LEN)-1)<<GLB_REG_GPIO_11_SMT_POS)
#define GLB_REG_GPIO_11_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_11_SMT_LEN)-1)<<GLB_REG_GPIO_11_SMT_POS))
#define GLB_REG_GPIO_11_DRV                                     GLB_REG_GPIO_11_DRV
#define GLB_REG_GPIO_11_DRV_POS                                 (18U)
#define GLB_REG_GPIO_11_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_11_DRV_MSK                                 (((1U<<GLB_REG_GPIO_11_DRV_LEN)-1)<<GLB_REG_GPIO_11_DRV_POS)
#define GLB_REG_GPIO_11_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_11_DRV_LEN)-1)<<GLB_REG_GPIO_11_DRV_POS))
#define GLB_REG_GPIO_11_PU                                      GLB_REG_GPIO_11_PU
#define GLB_REG_GPIO_11_PU_POS                                  (20U)
#define GLB_REG_GPIO_11_PU_LEN                                  (1U)
#define GLB_REG_GPIO_11_PU_MSK                                  (((1U<<GLB_REG_GPIO_11_PU_LEN)-1)<<GLB_REG_GPIO_11_PU_POS)
#define GLB_REG_GPIO_11_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_11_PU_LEN)-1)<<GLB_REG_GPIO_11_PU_POS))
#define GLB_REG_GPIO_11_PD                                      GLB_REG_GPIO_11_PD
#define GLB_REG_GPIO_11_PD_POS                                  (21U)
#define GLB_REG_GPIO_11_PD_LEN                                  (1U)
#define GLB_REG_GPIO_11_PD_MSK                                  (((1U<<GLB_REG_GPIO_11_PD_LEN)-1)<<GLB_REG_GPIO_11_PD_POS)
#define GLB_REG_GPIO_11_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_11_PD_LEN)-1)<<GLB_REG_GPIO_11_PD_POS))
#define GLB_REG_GPIO_11_FUNC_SEL                                GLB_REG_GPIO_11_FUNC_SEL
#define GLB_REG_GPIO_11_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_11_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_11_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_11_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_11_FUNC_SEL_POS)
#define GLB_REG_GPIO_11_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_11_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_11_FUNC_SEL_POS))
#define GLB_REG_GPIO_11_MODE                                    GLB_REG_GPIO_11_MODE
#define GLB_REG_GPIO_11_MODE_POS                                (31U)
#define GLB_REG_GPIO_11_MODE_LEN                                (1U)
#define GLB_REG_GPIO_11_MODE_MSK                                (((1U<<GLB_REG_GPIO_11_MODE_LEN)-1)<<GLB_REG_GPIO_11_MODE_POS)
#define GLB_REG_GPIO_11_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_11_MODE_LEN)-1)<<GLB_REG_GPIO_11_MODE_POS))

/* 0x118 : GPIO_CFGCTL6 */
#define GLB_GPIO_CFGCTL6_OFFSET                                 (0x118)
#define GLB_REG_GPIO_12_IE                                      GLB_REG_GPIO_12_IE
#define GLB_REG_GPIO_12_IE_POS                                  (0U)
#define GLB_REG_GPIO_12_IE_LEN                                  (1U)
#define GLB_REG_GPIO_12_IE_MSK                                  (((1U<<GLB_REG_GPIO_12_IE_LEN)-1)<<GLB_REG_GPIO_12_IE_POS)
#define GLB_REG_GPIO_12_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_12_IE_LEN)-1)<<GLB_REG_GPIO_12_IE_POS))
#define GLB_REG_GPIO_12_SMT                                     GLB_REG_GPIO_12_SMT
#define GLB_REG_GPIO_12_SMT_POS                                 (1U)
#define GLB_REG_GPIO_12_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_12_SMT_MSK                                 (((1U<<GLB_REG_GPIO_12_SMT_LEN)-1)<<GLB_REG_GPIO_12_SMT_POS)
#define GLB_REG_GPIO_12_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_12_SMT_LEN)-1)<<GLB_REG_GPIO_12_SMT_POS))
#define GLB_REG_GPIO_12_DRV                                     GLB_REG_GPIO_12_DRV
#define GLB_REG_GPIO_12_DRV_POS                                 (2U)
#define GLB_REG_GPIO_12_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_12_DRV_MSK                                 (((1U<<GLB_REG_GPIO_12_DRV_LEN)-1)<<GLB_REG_GPIO_12_DRV_POS)
#define GLB_REG_GPIO_12_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_12_DRV_LEN)-1)<<GLB_REG_GPIO_12_DRV_POS))
#define GLB_REG_GPIO_12_PU                                      GLB_REG_GPIO_12_PU
#define GLB_REG_GPIO_12_PU_POS                                  (4U)
#define GLB_REG_GPIO_12_PU_LEN                                  (1U)
#define GLB_REG_GPIO_12_PU_MSK                                  (((1U<<GLB_REG_GPIO_12_PU_LEN)-1)<<GLB_REG_GPIO_12_PU_POS)
#define GLB_REG_GPIO_12_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_12_PU_LEN)-1)<<GLB_REG_GPIO_12_PU_POS))
#define GLB_REG_GPIO_12_PD                                      GLB_REG_GPIO_12_PD
#define GLB_REG_GPIO_12_PD_POS                                  (5U)
#define GLB_REG_GPIO_12_PD_LEN                                  (1U)
#define GLB_REG_GPIO_12_PD_MSK                                  (((1U<<GLB_REG_GPIO_12_PD_LEN)-1)<<GLB_REG_GPIO_12_PD_POS)
#define GLB_REG_GPIO_12_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_12_PD_LEN)-1)<<GLB_REG_GPIO_12_PD_POS))
#define GLB_REG_GPIO_12_FUNC_SEL                                GLB_REG_GPIO_12_FUNC_SEL
#define GLB_REG_GPIO_12_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_12_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_12_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_12_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_12_FUNC_SEL_POS)
#define GLB_REG_GPIO_12_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_12_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_12_FUNC_SEL_POS))
#define GLB_REG_GPIO_12_MODE                                    GLB_REG_GPIO_12_MODE
#define GLB_REG_GPIO_12_MODE_POS                                (15U)
#define GLB_REG_GPIO_12_MODE_LEN                                (1U)
#define GLB_REG_GPIO_12_MODE_MSK                                (((1U<<GLB_REG_GPIO_12_MODE_LEN)-1)<<GLB_REG_GPIO_12_MODE_POS)
#define GLB_REG_GPIO_12_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_12_MODE_LEN)-1)<<GLB_REG_GPIO_12_MODE_POS))
#define GLB_REG_GPIO_13_IE                                      GLB_REG_GPIO_13_IE
#define GLB_REG_GPIO_13_IE_POS                                  (16U)
#define GLB_REG_GPIO_13_IE_LEN                                  (1U)
#define GLB_REG_GPIO_13_IE_MSK                                  (((1U<<GLB_REG_GPIO_13_IE_LEN)-1)<<GLB_REG_GPIO_13_IE_POS)
#define GLB_REG_GPIO_13_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_13_IE_LEN)-1)<<GLB_REG_GPIO_13_IE_POS))
#define GLB_REG_GPIO_13_SMT                                     GLB_REG_GPIO_13_SMT
#define GLB_REG_GPIO_13_SMT_POS                                 (17U)
#define GLB_REG_GPIO_13_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_13_SMT_MSK                                 (((1U<<GLB_REG_GPIO_13_SMT_LEN)-1)<<GLB_REG_GPIO_13_SMT_POS)
#define GLB_REG_GPIO_13_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_13_SMT_LEN)-1)<<GLB_REG_GPIO_13_SMT_POS))
#define GLB_REG_GPIO_13_DRV                                     GLB_REG_GPIO_13_DRV
#define GLB_REG_GPIO_13_DRV_POS                                 (18U)
#define GLB_REG_GPIO_13_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_13_DRV_MSK                                 (((1U<<GLB_REG_GPIO_13_DRV_LEN)-1)<<GLB_REG_GPIO_13_DRV_POS)
#define GLB_REG_GPIO_13_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_13_DRV_LEN)-1)<<GLB_REG_GPIO_13_DRV_POS))
#define GLB_REG_GPIO_13_PU                                      GLB_REG_GPIO_13_PU
#define GLB_REG_GPIO_13_PU_POS                                  (20U)
#define GLB_REG_GPIO_13_PU_LEN                                  (1U)
#define GLB_REG_GPIO_13_PU_MSK                                  (((1U<<GLB_REG_GPIO_13_PU_LEN)-1)<<GLB_REG_GPIO_13_PU_POS)
#define GLB_REG_GPIO_13_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_13_PU_LEN)-1)<<GLB_REG_GPIO_13_PU_POS))
#define GLB_REG_GPIO_13_PD                                      GLB_REG_GPIO_13_PD
#define GLB_REG_GPIO_13_PD_POS                                  (21U)
#define GLB_REG_GPIO_13_PD_LEN                                  (1U)
#define GLB_REG_GPIO_13_PD_MSK                                  (((1U<<GLB_REG_GPIO_13_PD_LEN)-1)<<GLB_REG_GPIO_13_PD_POS)
#define GLB_REG_GPIO_13_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_13_PD_LEN)-1)<<GLB_REG_GPIO_13_PD_POS))
#define GLB_REG_GPIO_13_FUNC_SEL                                GLB_REG_GPIO_13_FUNC_SEL
#define GLB_REG_GPIO_13_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_13_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_13_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_13_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_13_FUNC_SEL_POS)
#define GLB_REG_GPIO_13_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_13_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_13_FUNC_SEL_POS))
#define GLB_REG_GPIO_13_MODE                                    GLB_REG_GPIO_13_MODE
#define GLB_REG_GPIO_13_MODE_POS                                (31U)
#define GLB_REG_GPIO_13_MODE_LEN                                (1U)
#define GLB_REG_GPIO_13_MODE_MSK                                (((1U<<GLB_REG_GPIO_13_MODE_LEN)-1)<<GLB_REG_GPIO_13_MODE_POS)
#define GLB_REG_GPIO_13_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_13_MODE_LEN)-1)<<GLB_REG_GPIO_13_MODE_POS))

