bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x11C : GPIO_CFGCTL7 */
#define GLB_GPIO_CFGCTL7_OFFSET                                 (0x11C)
#define GLB_REG_GPIO_14_IE                                      GLB_REG_GPIO_14_IE
#define GLB_REG_GPIO_14_IE_POS                                  (0U)
#define GLB_REG_GPIO_14_IE_LEN                                  (1U)
#define GLB_REG_GPIO_14_IE_MSK                                  (((1U<<GLB_REG_GPIO_14_IE_LEN)-1)<<GLB_REG_GPIO_14_IE_POS)
#define GLB_REG_GPIO_14_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_14_IE_LEN)-1)<<GLB_REG_GPIO_14_IE_POS))
#define GLB_REG_GPIO_14_SMT                                     GLB_REG_GPIO_14_SMT
#define GLB_REG_GPIO_14_SMT_POS                                 (1U)
#define GLB_REG_GPIO_14_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_14_SMT_MSK                                 (((1U<<GLB_REG_GPIO_14_SMT_LEN)-1)<<GLB_REG_GPIO_14_SMT_POS)
#define GLB_REG_GPIO_14_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_14_SMT_LEN)-1)<<GLB_REG_GPIO_14_SMT_POS))
#define GLB_REG_GPIO_14_DRV                                     GLB_REG_GPIO_14_DRV
#define GLB_REG_GPIO_14_DRV_POS                                 (2U)
#define GLB_REG_GPIO_14_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_14_DRV_MSK                                 (((1U<<GLB_REG_GPIO_14_DRV_LEN)-1)<<GLB_REG_GPIO_14_DRV_POS)
#define GLB_REG_GPIO_14_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_14_DRV_LEN)-1)<<GLB_REG_GPIO_14_DRV_POS))
#define GLB_REG_GPIO_14_PU                                      GLB_REG_GPIO_14_PU
#define GLB_REG_GPIO_14_PU_POS                                  (4U)
#define GLB_REG_GPIO_14_PU_LEN                                  (1U)
#define GLB_REG_GPIO_14_PU_MSK                                  (((1U<<GLB_REG_GPIO_14_PU_LEN)-1)<<GLB_REG_GPIO_14_PU_POS)
#define GLB_REG_GPIO_14_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_14_PU_LEN)-1)<<GLB_REG_GPIO_14_PU_POS))
#define GLB_REG_GPIO_14_PD                                      GLB_REG_GPIO_14_PD
#define GLB_REG_GPIO_14_PD_POS                                  (5U)
#define GLB_REG_GPIO_14_PD_LEN                                  (1U)
#define GLB_REG_GPIO_14_PD_MSK                                  (((1U<<GLB_REG_GPIO_14_PD_LEN)-1)<<GLB_REG_GPIO_14_PD_POS)
#define GLB_REG_GPIO_14_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_14_PD_LEN)-1)<<GLB_REG_GPIO_14_PD_POS))
#define GLB_REG_GPIO_14_FUNC_SEL                                GLB_REG_GPIO_14_FUNC_SEL
#define GLB_REG_GPIO_14_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_14_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_14_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_14_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_14_FUNC_SEL_POS)
#define GLB_REG_GPIO_14_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_14_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_14_FUNC_SEL_POS))
#define GLB_REG_GPIO_14_MODE                                    GLB_REG_GPIO_14_MODE
#define GLB_REG_GPIO_14_MODE_POS                                (15U)
#define GLB_REG_GPIO_14_MODE_LEN                                (1U)
#define GLB_REG_GPIO_14_MODE_MSK                                (((1U<<GLB_REG_GPIO_14_MODE_LEN)-1)<<GLB_REG_GPIO_14_MODE_POS)
#define GLB_REG_GPIO_14_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_14_MODE_LEN)-1)<<GLB_REG_GPIO_14_MODE_POS))
#define GLB_REG_GPIO_15_IE                                      GLB_REG_GPIO_15_IE
#define GLB_REG_GPIO_15_IE_POS                                  (16U)
#define GLB_REG_GPIO_15_IE_LEN                                  (1U)
#define GLB_REG_GPIO_15_IE_MSK                                  (((1U<<GLB_REG_GPIO_15_IE_LEN)-1)<<GLB_REG_GPIO_15_IE_POS)
#define GLB_REG_GPIO_15_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_15_IE_LEN)-1)<<GLB_REG_GPIO_15_IE_POS))
#define GLB_REG_GPIO_15_SMT                                     GLB_REG_GPIO_15_SMT
#define GLB_REG_GPIO_15_SMT_POS                                 (17U)
#define GLB_REG_GPIO_15_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_15_SMT_MSK                                 (((1U<<GLB_REG_GPIO_15_SMT_LEN)-1)<<GLB_REG_GPIO_15_SMT_POS)
#define GLB_REG_GPIO_15_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_15_SMT_LEN)-1)<<GLB_REG_GPIO_15_SMT_POS))
#define GLB_REG_GPIO_15_DRV                                     GLB_REG_GPIO_15_DRV
#define GLB_REG_GPIO_15_DRV_POS                                 (18U)
#define GLB_REG_GPIO_15_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_15_DRV_MSK                                 (((1U<<GLB_REG_GPIO_15_DRV_LEN)-1)<<GLB_REG_GPIO_15_DRV_POS)
#define GLB_REG_GPIO_15_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_15_DRV_LEN)-1)<<GLB_REG_GPIO_15_DRV_POS))
#define GLB_REG_GPIO_15_PU                                      GLB_REG_GPIO_15_PU
#define GLB_REG_GPIO_15_PU_POS                                  (20U)
#define GLB_REG_GPIO_15_PU_LEN                                  (1U)
#define GLB_REG_GPIO_15_PU_MSK                                  (((1U<<GLB_REG_GPIO_15_PU_LEN)-1)<<GLB_REG_GPIO_15_PU_POS)
#define GLB_REG_GPIO_15_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_15_PU_LEN)-1)<<GLB_REG_GPIO_15_PU_POS))
#define GLB_REG_GPIO_15_PD                                      GLB_REG_GPIO_15_PD
#define GLB_REG_GPIO_15_PD_POS                                  (21U)
#define GLB_REG_GPIO_15_PD_LEN                                  (1U)
#define GLB_REG_GPIO_15_PD_MSK                                  (((1U<<GLB_REG_GPIO_15_PD_LEN)-1)<<GLB_REG_GPIO_15_PD_POS)
#define GLB_REG_GPIO_15_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_15_PD_LEN)-1)<<GLB_REG_GPIO_15_PD_POS))
#define GLB_REG_GPIO_15_FUNC_SEL                                GLB_REG_GPIO_15_FUNC_SEL
#define GLB_REG_GPIO_15_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_15_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_15_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_15_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_15_FUNC_SEL_POS)
#define GLB_REG_GPIO_15_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_15_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_15_FUNC_SEL_POS))
#define GLB_REG_GPIO_15_MODE                                    GLB_REG_GPIO_15_MODE
#define GLB_REG_GPIO_15_MODE_POS                                (31U)
#define GLB_REG_GPIO_15_MODE_LEN                                (1U)
#define GLB_REG_GPIO_15_MODE_MSK                                (((1U<<GLB_REG_GPIO_15_MODE_LEN)-1)<<GLB_REG_GPIO_15_MODE_POS)
#define GLB_REG_GPIO_15_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_15_MODE_LEN)-1)<<GLB_REG_GPIO_15_MODE_POS))

/* 0x120 : GPIO_CFGCTL8 */
#define GLB_GPIO_CFGCTL8_OFFSET                                 (0x120)
#define GLB_REG_GPIO_16_IE                                      GLB_REG_GPIO_16_IE
#define GLB_REG_GPIO_16_IE_POS                                  (0U)
#define GLB_REG_GPIO_16_IE_LEN                                  (1U)
#define GLB_REG_GPIO_16_IE_MSK                                  (((1U<<GLB_REG_GPIO_16_IE_LEN)-1)<<GLB_REG_GPIO_16_IE_POS)
#define GLB_REG_GPIO_16_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_16_IE_LEN)-1)<<GLB_REG_GPIO_16_IE_POS))
#define GLB_REG_GPIO_16_SMT                                     GLB_REG_GPIO_16_SMT
#define GLB_REG_GPIO_16_SMT_POS                                 (1U)
#define GLB_REG_GPIO_16_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_16_SMT_MSK                                 (((1U<<GLB_REG_GPIO_16_SMT_LEN)-1)<<GLB_REG_GPIO_16_SMT_POS)
#define GLB_REG_GPIO_16_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_16_SMT_LEN)-1)<<GLB_REG_GPIO_16_SMT_POS))
#define GLB_REG_GPIO_16_DRV                                     GLB_REG_GPIO_16_DRV
#define GLB_REG_GPIO_16_DRV_POS                                 (2U)
#define GLB_REG_GPIO_16_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_16_DRV_MSK                                 (((1U<<GLB_REG_GPIO_16_DRV_LEN)-1)<<GLB_REG_GPIO_16_DRV_POS)
#define GLB_REG_GPIO_16_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_16_DRV_LEN)-1)<<GLB_REG_GPIO_16_DRV_POS))
#define GLB_REG_GPIO_16_PU                                      GLB_REG_GPIO_16_PU
#define GLB_REG_GPIO_16_PU_POS                                  (4U)
#define GLB_REG_GPIO_16_PU_LEN                                  (1U)
#define GLB_REG_GPIO_16_PU_MSK                                  (((1U<<GLB_REG_GPIO_16_PU_LEN)-1)<<GLB_REG_GPIO_16_PU_POS)
#define GLB_REG_GPIO_16_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_16_PU_LEN)-1)<<GLB_REG_GPIO_16_PU_POS))
#define GLB_REG_GPIO_16_PD                                      GLB_REG_GPIO_16_PD
#define GLB_REG_GPIO_16_PD_POS                                  (5U)
#define GLB_REG_GPIO_16_PD_LEN                                  (1U)
#define GLB_REG_GPIO_16_PD_MSK                                  (((1U<<GLB_REG_GPIO_16_PD_LEN)-1)<<GLB_REG_GPIO_16_PD_POS)
#define GLB_REG_GPIO_16_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_16_PD_LEN)-1)<<GLB_REG_GPIO_16_PD_POS))
#define GLB_REG_GPIO_16_FUNC_SEL                                GLB_REG_GPIO_16_FUNC_SEL
#define GLB_REG_GPIO_16_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_16_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_16_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_16_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_16_FUNC_SEL_POS)
#define GLB_REG_GPIO_16_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_16_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_16_FUNC_SEL_POS))
#define GLB_REG_GPIO_16_MODE                                    GLB_REG_GPIO_16_MODE
#define GLB_REG_GPIO_16_MODE_POS                                (15U)
#define GLB_REG_GPIO_16_MODE_LEN                                (1U)
#define GLB_REG_GPIO_16_MODE_MSK                                (((1U<<GLB_REG_GPIO_16_MODE_LEN)-1)<<GLB_REG_GPIO_16_MODE_POS)
#define GLB_REG_GPIO_16_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_16_MODE_LEN)-1)<<GLB_REG_GPIO_16_MODE_POS))
#define GLB_REG_GPIO_17_IE                                      GLB_REG_GPIO_17_IE
#define GLB_REG_GPIO_17_IE_POS                                  (16U)
#define GLB_REG_GPIO_17_IE_LEN                                  (1U)
#define GLB_REG_GPIO_17_IE_MSK                                  (((1U<<GLB_REG_GPIO_17_IE_LEN)-1)<<GLB_REG_GPIO_17_IE_POS)
#define GLB_REG_GPIO_17_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_17_IE_LEN)-1)<<GLB_REG_GPIO_17_IE_POS))
#define GLB_REG_GPIO_17_SMT                                     GLB_REG_GPIO_17_SMT
#define GLB_REG_GPIO_17_SMT_POS                                 (17U)
#define GLB_REG_GPIO_17_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_17_SMT_MSK                                 (((1U<<GLB_REG_GPIO_17_SMT_LEN)-1)<<GLB_REG_GPIO_17_SMT_POS)
#define GLB_REG_GPIO_17_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_17_SMT_LEN)-1)<<GLB_REG_GPIO_17_SMT_POS))
#define GLB_REG_GPIO_17_DRV                                     GLB_REG_GPIO_17_DRV
#define GLB_REG_GPIO_17_DRV_POS                                 (18U)
#define GLB_REG_GPIO_17_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_17_DRV_MSK                                 (((1U<<GLB_REG_GPIO_17_DRV_LEN)-1)<<GLB_REG_GPIO_17_DRV_POS)
#define GLB_REG_GPIO_17_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_17_DRV_LEN)-1)<<GLB_REG_GPIO_17_DRV_POS))
#define GLB_REG_GPIO_17_PU                                      GLB_REG_GPIO_17_PU
#define GLB_REG_GPIO_17_PU_POS                                  (20U)
#define GLB_REG_GPIO_17_PU_LEN                                  (1U)
#define GLB_REG_GPIO_17_PU_MSK                                  (((1U<<GLB_REG_GPIO_17_PU_LEN)-1)<<GLB_REG_GPIO_17_PU_POS)
#define GLB_REG_GPIO_17_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_17_PU_LEN)-1)<<GLB_REG_GPIO_17_PU_POS))
#define GLB_REG_GPIO_17_PD                                      GLB_REG_GPIO_17_PD
#define GLB_REG_GPIO_17_PD_POS                                  (21U)
#define GLB_REG_GPIO_17_PD_LEN                                  (1U)
#define GLB_REG_GPIO_17_PD_MSK                                  (((1U<<GLB_REG_GPIO_17_PD_LEN)-1)<<GLB_REG_GPIO_17_PD_POS)
#define GLB_REG_GPIO_17_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_17_PD_LEN)-1)<<GLB_REG_GPIO_17_PD_POS))
#define GLB_REG_GPIO_17_FUNC_SEL                                GLB_REG_GPIO_17_FUNC_SEL
#define GLB_REG_GPIO_17_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_17_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_17_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_17_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_17_FUNC_SEL_POS)
#define GLB_REG_GPIO_17_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_17_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_17_FUNC_SEL_POS))
#define GLB_REG_GPIO_17_MODE                                    GLB_REG_GPIO_17_MODE
#define GLB_REG_GPIO_17_MODE_POS                                (31U)
#define GLB_REG_GPIO_17_MODE_LEN                                (1U)
#define GLB_REG_GPIO_17_MODE_MSK                                (((1U<<GLB_REG_GPIO_17_MODE_LEN)-1)<<GLB_REG_GPIO_17_MODE_POS)
#define GLB_REG_GPIO_17_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_17_MODE_LEN)-1)<<GLB_REG_GPIO_17_MODE_POS))

