bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x124 : GPIO_CFGCTL9 */
#define GLB_GPIO_CFGCTL9_OFFSET                                 (0x124)
#define GLB_REG_GPIO_18_IE                                      GLB_REG_GPIO_18_IE
#define GLB_REG_GPIO_18_IE_POS                                  (0U)
#define GLB_REG_GPIO_18_IE_LEN                                  (1U)
#define GLB_REG_GPIO_18_IE_MSK                                  (((1U<<GLB_REG_GPIO_18_IE_LEN)-1)<<GLB_REG_GPIO_18_IE_POS)
#define GLB_REG_GPIO_18_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_18_IE_LEN)-1)<<GLB_REG_GPIO_18_IE_POS))
#define GLB_REG_GPIO_18_SMT                                     GLB_REG_GPIO_18_SMT
#define GLB_REG_GPIO_18_SMT_POS                                 (1U)
#define GLB_REG_GPIO_18_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_18_SMT_MSK                                 (((1U<<GLB_REG_GPIO_18_SMT_LEN)-1)<<GLB_REG_GPIO_18_SMT_POS)
#define GLB_REG_GPIO_18_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_18_SMT_LEN)-1)<<GLB_REG_GPIO_18_SMT_POS))
#define GLB_REG_GPIO_18_DRV                                     GLB_REG_GPIO_18_DRV
#define GLB_REG_GPIO_18_DRV_POS                                 (2U)
#define GLB_REG_GPIO_18_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_18_DRV_MSK                                 (((1U<<GLB_REG_GPIO_18_DRV_LEN)-1)<<GLB_REG_GPIO_18_DRV_POS)
#define GLB_REG_GPIO_18_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_18_DRV_LEN)-1)<<GLB_REG_GPIO_18_DRV_POS))
#define GLB_REG_GPIO_18_PU                                      GLB_REG_GPIO_18_PU
#define GLB_REG_GPIO_18_PU_POS                                  (4U)
#define GLB_REG_GPIO_18_PU_LEN                                  (1U)
#define GLB_REG_GPIO_18_PU_MSK                                  (((1U<<GLB_REG_GPIO_18_PU_LEN)-1)<<GLB_REG_GPIO_18_PU_POS)
#define GLB_REG_GPIO_18_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_18_PU_LEN)-1)<<GLB_REG_GPIO_18_PU_POS))
#define GLB_REG_GPIO_18_PD                                      GLB_REG_GPIO_18_PD
#define GLB_REG_GPIO_18_PD_POS                                  (5U)
#define GLB_REG_GPIO_18_PD_LEN                                  (1U)
#define GLB_REG_GPIO_18_PD_MSK                                  (((1U<<GLB_REG_GPIO_18_PD_LEN)-1)<<GLB_REG_GPIO_18_PD_POS)
#define GLB_REG_GPIO_18_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_18_PD_LEN)-1)<<GLB_REG_GPIO_18_PD_POS))
#define GLB_REG_GPIO_18_FUNC_SEL                                GLB_REG_GPIO_18_FUNC_SEL
#define GLB_REG_GPIO_18_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_18_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_18_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_18_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_18_FUNC_SEL_POS)
#define GLB_REG_GPIO_18_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_18_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_18_FUNC_SEL_POS))
#define GLB_REG_GPIO_18_MODE                                    GLB_REG_GPIO_18_MODE
#define GLB_REG_GPIO_18_MODE_POS                                (15U)
#define GLB_REG_GPIO_18_MODE_LEN                                (1U)
#define GLB_REG_GPIO_18_MODE_MSK                                (((1U<<GLB_REG_GPIO_18_MODE_LEN)-1)<<GLB_REG_GPIO_18_MODE_POS)
#define GLB_REG_GPIO_18_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_18_MODE_LEN)-1)<<GLB_REG_GPIO_18_MODE_POS))
#define GLB_REG_GPIO_19_IE                                      GLB_REG_GPIO_19_IE
#define GLB_REG_GPIO_19_IE_POS                                  (16U)
#define GLB_REG_GPIO_19_IE_LEN                                  (1U)
#define GLB_REG_GPIO_19_IE_MSK                                  (((1U<<GLB_REG_GPIO_19_IE_LEN)-1)<<GLB_REG_GPIO_19_IE_POS)
#define GLB_REG_GPIO_19_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_19_IE_LEN)-1)<<GLB_REG_GPIO_19_IE_POS))
#define GLB_REG_GPIO_19_SMT                                     GLB_REG_GPIO_19_SMT
#define GLB_REG_GPIO_19_SMT_POS                                 (17U)
#define GLB_REG_GPIO_19_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_19_SMT_MSK                                 (((1U<<GLB_REG_GPIO_19_SMT_LEN)-1)<<GLB_REG_GPIO_19_SMT_POS)
#define GLB_REG_GPIO_19_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_19_SMT_LEN)-1)<<GLB_REG_GPIO_19_SMT_POS))
#define GLB_REG_GPIO_19_DRV                                     GLB_REG_GPIO_19_DRV
#define GLB_REG_GPIO_19_DRV_POS                                 (18U)
#define GLB_REG_GPIO_19_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_19_DRV_MSK                                 (((1U<<GLB_REG_GPIO_19_DRV_LEN)-1)<<GLB_REG_GPIO_19_DRV_POS)
#define GLB_REG_GPIO_19_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_19_DRV_LEN)-1)<<GLB_REG_GPIO_19_DRV_POS))
#define GLB_REG_GPIO_19_PU                                      GLB_REG_GPIO_19_PU
#define GLB_REG_GPIO_19_PU_POS                                  (20U)
#define GLB_REG_GPIO_19_PU_LEN                                  (1U)
#define GLB_REG_GPIO_19_PU_MSK                                  (((1U<<GLB_REG_GPIO_19_PU_LEN)-1)<<GLB_REG_GPIO_19_PU_POS)
#define GLB_REG_GPIO_19_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_19_PU_LEN)-1)<<GLB_REG_GPIO_19_PU_POS))
#define GLB_REG_GPIO_19_PD                                      GLB_REG_GPIO_19_PD
#define GLB_REG_GPIO_19_PD_POS                                  (21U)
#define GLB_REG_GPIO_19_PD_LEN                                  (1U)
#define GLB_REG_GPIO_19_PD_MSK                                  (((1U<<GLB_REG_GPIO_19_PD_LEN)-1)<<GLB_REG_GPIO_19_PD_POS)
#define GLB_REG_GPIO_19_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_19_PD_LEN)-1)<<GLB_REG_GPIO_19_PD_POS))
#define GLB_REG_GPIO_19_FUNC_SEL                                GLB_REG_GPIO_19_FUNC_SEL
#define GLB_REG_GPIO_19_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_19_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_19_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_19_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_19_FUNC_SEL_POS)
#define GLB_REG_GPIO_19_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_19_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_19_FUNC_SEL_POS))
#define GLB_REG_GPIO_19_MODE                                    GLB_REG_GPIO_19_MODE
#define GLB_REG_GPIO_19_MODE_POS                                (31U)
#define GLB_REG_GPIO_19_MODE_LEN                                (1U)
#define GLB_REG_GPIO_19_MODE_MSK                                (((1U<<GLB_REG_GPIO_19_MODE_LEN)-1)<<GLB_REG_GPIO_19_MODE_POS)
#define GLB_REG_GPIO_19_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_19_MODE_LEN)-1)<<GLB_REG_GPIO_19_MODE_POS))

/* 0x128 : GPIO_CFGCTL10 */
#define GLB_GPIO_CFGCTL10_OFFSET                                (0x128)
#define GLB_REG_GPIO_20_IE                                      GLB_REG_GPIO_20_IE
#define GLB_REG_GPIO_20_IE_POS                                  (0U)
#define GLB_REG_GPIO_20_IE_LEN                                  (1U)
#define GLB_REG_GPIO_20_IE_MSK                                  (((1U<<GLB_REG_GPIO_20_IE_LEN)-1)<<GLB_REG_GPIO_20_IE_POS)
#define GLB_REG_GPIO_20_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_20_IE_LEN)-1)<<GLB_REG_GPIO_20_IE_POS))
#define GLB_REG_GPIO_20_SMT                                     GLB_REG_GPIO_20_SMT
#define GLB_REG_GPIO_20_SMT_POS                                 (1U)
#define GLB_REG_GPIO_20_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_20_SMT_MSK                                 (((1U<<GLB_REG_GPIO_20_SMT_LEN)-1)<<GLB_REG_GPIO_20_SMT_POS)
#define GLB_REG_GPIO_20_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_20_SMT_LEN)-1)<<GLB_REG_GPIO_20_SMT_POS))
#define GLB_REG_GPIO_20_DRV                                     GLB_REG_GPIO_20_DRV
#define GLB_REG_GPIO_20_DRV_POS                                 (2U)
#define GLB_REG_GPIO_20_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_20_DRV_MSK                                 (((1U<<GLB_REG_GPIO_20_DRV_LEN)-1)<<GLB_REG_GPIO_20_DRV_POS)
#define GLB_REG_GPIO_20_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_20_DRV_LEN)-1)<<GLB_REG_GPIO_20_DRV_POS))
#define GLB_REG_GPIO_20_PU                                      GLB_REG_GPIO_20_PU
#define GLB_REG_GPIO_20_PU_POS                                  (4U)
#define GLB_REG_GPIO_20_PU_LEN                                  (1U)
#define GLB_REG_GPIO_20_PU_MSK                                  (((1U<<GLB_REG_GPIO_20_PU_LEN)-1)<<GLB_REG_GPIO_20_PU_POS)
#define GLB_REG_GPIO_20_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_20_PU_LEN)-1)<<GLB_REG_GPIO_20_PU_POS))
#define GLB_REG_GPIO_20_PD                                      GLB_REG_GPIO_20_PD
#define GLB_REG_GPIO_20_PD_POS                                  (5U)
#define GLB_REG_GPIO_20_PD_LEN                                  (1U)
#define GLB_REG_GPIO_20_PD_MSK                                  (((1U<<GLB_REG_GPIO_20_PD_LEN)-1)<<GLB_REG_GPIO_20_PD_POS)
#define GLB_REG_GPIO_20_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_20_PD_LEN)-1)<<GLB_REG_GPIO_20_PD_POS))
#define GLB_REG_GPIO_20_FUNC_SEL                                GLB_REG_GPIO_20_FUNC_SEL
#define GLB_REG_GPIO_20_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_20_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_20_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_20_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_20_FUNC_SEL_POS)
#define GLB_REG_GPIO_20_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_20_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_20_FUNC_SEL_POS))
#define GLB_REG_GPIO_20_MODE                                    GLB_REG_GPIO_20_MODE
#define GLB_REG_GPIO_20_MODE_POS                                (15U)
#define GLB_REG_GPIO_20_MODE_LEN                                (1U)
#define GLB_REG_GPIO_20_MODE_MSK                                (((1U<<GLB_REG_GPIO_20_MODE_LEN)-1)<<GLB_REG_GPIO_20_MODE_POS)
#define GLB_REG_GPIO_20_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_20_MODE_LEN)-1)<<GLB_REG_GPIO_20_MODE_POS))
#define GLB_REG_GPIO_21_IE                                      GLB_REG_GPIO_21_IE
#define GLB_REG_GPIO_21_IE_POS                                  (16U)
#define GLB_REG_GPIO_21_IE_LEN                                  (1U)
#define GLB_REG_GPIO_21_IE_MSK                                  (((1U<<GLB_REG_GPIO_21_IE_LEN)-1)<<GLB_REG_GPIO_21_IE_POS)
#define GLB_REG_GPIO_21_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_21_IE_LEN)-1)<<GLB_REG_GPIO_21_IE_POS))
#define GLB_REG_GPIO_21_SMT                                     GLB_REG_GPIO_21_SMT
#define GLB_REG_GPIO_21_SMT_POS                                 (17U)
#define GLB_REG_GPIO_21_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_21_SMT_MSK                                 (((1U<<GLB_REG_GPIO_21_SMT_LEN)-1)<<GLB_REG_GPIO_21_SMT_POS)
#define GLB_REG_GPIO_21_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_21_SMT_LEN)-1)<<GLB_REG_GPIO_21_SMT_POS))
#define GLB_REG_GPIO_21_DRV                                     GLB_REG_GPIO_21_DRV
#define GLB_REG_GPIO_21_DRV_POS                                 (18U)
#define GLB_REG_GPIO_21_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_21_DRV_MSK                                 (((1U<<GLB_REG_GPIO_21_DRV_LEN)-1)<<GLB_REG_GPIO_21_DRV_POS)
#define GLB_REG_GPIO_21_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_21_DRV_LEN)-1)<<GLB_REG_GPIO_21_DRV_POS))
#define GLB_REG_GPIO_21_PU                                      GLB_REG_GPIO_21_PU
#define GLB_REG_GPIO_21_PU_POS                                  (20U)
#define GLB_REG_GPIO_21_PU_LEN                                  (1U)
#define GLB_REG_GPIO_21_PU_MSK                                  (((1U<<GLB_REG_GPIO_21_PU_LEN)-1)<<GLB_REG_GPIO_21_PU_POS)
#define GLB_REG_GPIO_21_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_21_PU_LEN)-1)<<GLB_REG_GPIO_21_PU_POS))
#define GLB_REG_GPIO_21_PD                                      GLB_REG_GPIO_21_PD
#define GLB_REG_GPIO_21_PD_POS                                  (21U)
#define GLB_REG_GPIO_21_PD_LEN                                  (1U)
#define GLB_REG_GPIO_21_PD_MSK                                  (((1U<<GLB_REG_GPIO_21_PD_LEN)-1)<<GLB_REG_GPIO_21_PD_POS)
#define GLB_REG_GPIO_21_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_21_PD_LEN)-1)<<GLB_REG_GPIO_21_PD_POS))
#define GLB_REG_GPIO_21_FUNC_SEL                                GLB_REG_GPIO_21_FUNC_SEL
#define GLB_REG_GPIO_21_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_21_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_21_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_21_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_21_FUNC_SEL_POS)
#define GLB_REG_GPIO_21_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_21_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_21_FUNC_SEL_POS))
#define GLB_REG_GPIO_21_MODE                                    GLB_REG_GPIO_21_MODE
#define GLB_REG_GPIO_21_MODE_POS                                (31U)
#define GLB_REG_GPIO_21_MODE_LEN                                (1U)
#define GLB_REG_GPIO_21_MODE_MSK                                (((1U<<GLB_REG_GPIO_21_MODE_LEN)-1)<<GLB_REG_GPIO_21_MODE_POS)
#define GLB_REG_GPIO_21_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_21_MODE_LEN)-1)<<GLB_REG_GPIO_21_MODE_POS))

/* 0x12C : GPIO_CFGCTL11 */
#define GLB_GPIO_CFGCTL11_OFFSET                                (0x12C)
#define GLB_REG_GPIO_22_IE                                      GLB_REG_GPIO_22_IE
#define GLB_REG_GPIO_22_IE_POS                                  (0U)
#define GLB_REG_GPIO_22_IE_LEN                                  (1U)
#define GLB_REG_GPIO_22_IE_MSK                                  (((1U<<GLB_REG_GPIO_22_IE_LEN)-1)<<GLB_REG_GPIO_22_IE_POS)
#define GLB_REG_GPIO_22_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_22_IE_LEN)-1)<<GLB_REG_GPIO_22_IE_POS))
#define GLB_REG_GPIO_22_SMT                                     GLB_REG_GPIO_22_SMT
#define GLB_REG_GPIO_22_SMT_POS                                 (1U)
#define GLB_REG_GPIO_22_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_22_SMT_MSK                                 (((1U<<GLB_REG_GPIO_22_SMT_LEN)-1)<<GLB_REG_GPIO_22_SMT_POS)
#define GLB_REG_GPIO_22_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_22_SMT_LEN)-1)<<GLB_REG_GPIO_22_SMT_POS))
#define GLB_REG_GPIO_22_DRV                                     GLB_REG_GPIO_22_DRV
#define GLB_REG_GPIO_22_DRV_POS                                 (2U)
#define GLB_REG_GPIO_22_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_22_DRV_MSK                                 (((1U<<GLB_REG_GPIO_22_DRV_LEN)-1)<<GLB_REG_GPIO_22_DRV_POS)
#define GLB_REG_GPIO_22_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_22_DRV_LEN)-1)<<GLB_REG_GPIO_22_DRV_POS))
#define GLB_REG_GPIO_22_PU                                      GLB_REG_GPIO_22_PU
#define GLB_REG_GPIO_22_PU_POS                                  (4U)
#define GLB_REG_GPIO_22_PU_LEN                                  (1U)
#define GLB_REG_GPIO_22_PU_MSK                                  (((1U<<GLB_REG_GPIO_22_PU_LEN)-1)<<GLB_REG_GPIO_22_PU_POS)
#define GLB_REG_GPIO_22_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_22_PU_LEN)-1)<<GLB_REG_GPIO_22_PU_POS))
#define GLB_REG_GPIO_22_PD                                      GLB_REG_GPIO_22_PD
#define GLB_REG_GPIO_22_PD_POS                                  (5U)
#define GLB_REG_GPIO_22_PD_LEN                                  (1U)
#define GLB_REG_GPIO_22_PD_MSK                                  (((1U<<GLB_REG_GPIO_22_PD_LEN)-1)<<GLB_REG_GPIO_22_PD_POS)
#define GLB_REG_GPIO_22_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_22_PD_LEN)-1)<<GLB_REG_GPIO_22_PD_POS))
#define GLB_REG_GPIO_22_FUNC_SEL                                GLB_REG_GPIO_22_FUNC_SEL
#define GLB_REG_GPIO_22_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_22_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_22_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_22_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_22_FUNC_SEL_POS)
#define GLB_REG_GPIO_22_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_22_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_22_FUNC_SEL_POS))
#define GLB_REG_GPIO_22_MODE                                    GLB_REG_GPIO_22_MODE
#define GLB_REG_GPIO_22_MODE_POS                                (15U)
#define GLB_REG_GPIO_22_MODE_LEN                                (1U)
#define GLB_REG_GPIO_22_MODE_MSK                                (((1U<<GLB_REG_GPIO_22_MODE_LEN)-1)<<GLB_REG_GPIO_22_MODE_POS)
#define GLB_REG_GPIO_22_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_22_MODE_LEN)-1)<<GLB_REG_GPIO_22_MODE_POS))
#define GLB_REG_GPIO_23_IE                                      GLB_REG_GPIO_23_IE
#define GLB_REG_GPIO_23_IE_POS                                  (16U)
#define GLB_REG_GPIO_23_IE_LEN                                  (1U)
#define GLB_REG_GPIO_23_IE_MSK                                  (((1U<<GLB_REG_GPIO_23_IE_LEN)-1)<<GLB_REG_GPIO_23_IE_POS)
#define GLB_REG_GPIO_23_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_23_IE_LEN)-1)<<GLB_REG_GPIO_23_IE_POS))
#define GLB_REG_GPIO_23_SMT                                     GLB_REG_GPIO_23_SMT
#define GLB_REG_GPIO_23_SMT_POS                                 (17U)
#define GLB_REG_GPIO_23_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_23_SMT_MSK                                 (((1U<<GLB_REG_GPIO_23_SMT_LEN)-1)<<GLB_REG_GPIO_23_SMT_POS)
#define GLB_REG_GPIO_23_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_23_SMT_LEN)-1)<<GLB_REG_GPIO_23_SMT_POS))
#define GLB_REG_GPIO_23_DRV                                     GLB_REG_GPIO_23_DRV
#define GLB_REG_GPIO_23_DRV_POS                                 (18U)
#define GLB_REG_GPIO_23_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_23_DRV_MSK                                 (((1U<<GLB_REG_GPIO_23_DRV_LEN)-1)<<GLB_REG_GPIO_23_DRV_POS)
#define GLB_REG_GPIO_23_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_23_DRV_LEN)-1)<<GLB_REG_GPIO_23_DRV_POS))
#define GLB_REG_GPIO_23_PU                                      GLB_REG_GPIO_23_PU
#define GLB_REG_GPIO_23_PU_POS                                  (20U)
#define GLB_REG_GPIO_23_PU_LEN                                  (1U)
#define GLB_REG_GPIO_23_PU_MSK                                  (((1U<<GLB_REG_GPIO_23_PU_LEN)-1)<<GLB_REG_GPIO_23_PU_POS)
#define GLB_REG_GPIO_23_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_23_PU_LEN)-1)<<GLB_REG_GPIO_23_PU_POS))
#define GLB_REG_GPIO_23_PD                                      GLB_REG_GPIO_23_PD
#define GLB_REG_GPIO_23_PD_POS                                  (21U)
#define GLB_REG_GPIO_23_PD_LEN                                  (1U)
#define GLB_REG_GPIO_23_PD_MSK                                  (((1U<<GLB_REG_GPIO_23_PD_LEN)-1)<<GLB_REG_GPIO_23_PD_POS)
#define GLB_REG_GPIO_23_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_23_PD_LEN)-1)<<GLB_REG_GPIO_23_PD_POS))
#define GLB_REG_GPIO_23_FUNC_SEL                                GLB_REG_GPIO_23_FUNC_SEL
#define GLB_REG_GPIO_23_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_23_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_23_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_23_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_23_FUNC_SEL_POS)
#define GLB_REG_GPIO_23_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_23_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_23_FUNC_SEL_POS))
#define GLB_REG_GPIO_23_MODE                                    GLB_REG_GPIO_23_MODE
#define GLB_REG_GPIO_23_MODE_POS                                (31U)
#define GLB_REG_GPIO_23_MODE_LEN                                (1U)
#define GLB_REG_GPIO_23_MODE_MSK                                (((1U<<GLB_REG_GPIO_23_MODE_LEN)-1)<<GLB_REG_GPIO_23_MODE_POS)
#define GLB_REG_GPIO_23_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_23_MODE_LEN)-1)<<GLB_REG_GPIO_23_MODE_POS))

