bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x130 : GPIO_CFGCTL12 */
#define GLB_GPIO_CFGCTL12_OFFSET                                (0x130)
#define GLB_REG_GPIO_24_IE                                      GLB_REG_GPIO_24_IE
#define GLB_REG_GPIO_24_IE_POS                                  (0U)
#define GLB_REG_GPIO_24_IE_LEN                                  (1U)
#define GLB_REG_GPIO_24_IE_MSK                                  (((1U<<GLB_REG_GPIO_24_IE_LEN)-1)<<GLB_REG_GPIO_24_IE_POS)
#define GLB_REG_GPIO_24_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_24_IE_LEN)-1)<<GLB_REG_GPIO_24_IE_POS))
#define GLB_REG_GPIO_24_SMT                                     GLB_REG_GPIO_24_SMT
#define GLB_REG_GPIO_24_SMT_POS                                 (1U)
#define GLB_REG_GPIO_24_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_24_SMT_MSK                                 (((1U<<GLB_REG_GPIO_24_SMT_LEN)-1)<<GLB_REG_GPIO_24_SMT_POS)
#define GLB_REG_GPIO_24_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_24_SMT_LEN)-1)<<GLB_REG_GPIO_24_SMT_POS))
#define GLB_REG_GPIO_24_DRV                                     GLB_REG_GPIO_24_DRV
#define GLB_REG_GPIO_24_DRV_POS                                 (2U)
#define GLB_REG_GPIO_24_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_24_DRV_MSK                                 (((1U<<GLB_REG_GPIO_24_DRV_LEN)-1)<<GLB_REG_GPIO_24_DRV_POS)
#define GLB_REG_GPIO_24_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_24_DRV_LEN)-1)<<GLB_REG_GPIO_24_DRV_POS))
#define GLB_REG_GPIO_24_PU                                      GLB_REG_GPIO_24_PU
#define GLB_REG_GPIO_24_PU_POS                                  (4U)
#define GLB_REG_GPIO_24_PU_LEN                                  (1U)
#define GLB_REG_GPIO_24_PU_MSK                                  (((1U<<GLB_REG_GPIO_24_PU_LEN)-1)<<GLB_REG_GPIO_24_PU_POS)
#define GLB_REG_GPIO_24_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_24_PU_LEN)-1)<<GLB_REG_GPIO_24_PU_POS))
#define GLB_REG_GPIO_24_PD                                      GLB_REG_GPIO_24_PD
#define GLB_REG_GPIO_24_PD_POS                                  (5U)
#define GLB_REG_GPIO_24_PD_LEN                                  (1U)
#define GLB_REG_GPIO_24_PD_MSK                                  (((1U<<GLB_REG_GPIO_24_PD_LEN)-1)<<GLB_REG_GPIO_24_PD_POS)
#define GLB_REG_GPIO_24_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_24_PD_LEN)-1)<<GLB_REG_GPIO_24_PD_POS))
#define GLB_REG_GPIO_24_FUNC_SEL                                GLB_REG_GPIO_24_FUNC_SEL
#define GLB_REG_GPIO_24_FUNC_SEL_POS                            (8U)
#define GLB_REG_GPIO_24_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_24_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_24_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_24_FUNC_SEL_POS)
#define GLB_REG_GPIO_24_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_24_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_24_FUNC_SEL_POS))
#define GLB_REG_GPIO_24_MODE                                    GLB_REG_GPIO_24_MODE
#define GLB_REG_GPIO_24_MODE_POS                                (15U)
#define GLB_REG_GPIO_24_MODE_LEN                                (1U)
#define GLB_REG_GPIO_24_MODE_MSK                                (((1U<<GLB_REG_GPIO_24_MODE_LEN)-1)<<GLB_REG_GPIO_24_MODE_POS)
#define GLB_REG_GPIO_24_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_24_MODE_LEN)-1)<<GLB_REG_GPIO_24_MODE_POS))
#define GLB_REG_GPIO_25_IE                                      GLB_REG_GPIO_25_IE
#define GLB_REG_GPIO_25_IE_POS                                  (16U)
#define GLB_REG_GPIO_25_IE_LEN                                  (1U)
#define GLB_REG_GPIO_25_IE_MSK                                  (((1U<<GLB_REG_GPIO_25_IE_LEN)-1)<<GLB_REG_GPIO_25_IE_POS)
#define GLB_REG_GPIO_25_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_25_IE_LEN)-1)<<GLB_REG_GPIO_25_IE_POS))
#define GLB_REG_GPIO_25_SMT                                     GLB_REG_GPIO_25_SMT
#define GLB_REG_GPIO_25_SMT_POS                                 (17U)
#define GLB_REG_GPIO_25_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_25_SMT_MSK                                 (((1U<<GLB_REG_GPIO_25_SMT_LEN)-1)<<GLB_REG_GPIO_25_SMT_POS)
#define GLB_REG_GPIO_25_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_25_SMT_LEN)-1)<<GLB_REG_GPIO_25_SMT_POS))
#define GLB_REG_GPIO_25_DRV                                     GLB_REG_GPIO_25_DRV
#define GLB_REG_GPIO_25_DRV_POS                                 (18U)
#define GLB_REG_GPIO_25_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_25_DRV_MSK                                 (((1U<<GLB_REG_GPIO_25_DRV_LEN)-1)<<GLB_REG_GPIO_25_DRV_POS)
#define GLB_REG_GPIO_25_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_25_DRV_LEN)-1)<<GLB_REG_GPIO_25_DRV_POS))
#define GLB_REG_GPIO_25_PU                                      GLB_REG_GPIO_25_PU
#define GLB_REG_GPIO_25_PU_POS                                  (20U)
#define GLB_REG_GPIO_25_PU_LEN                                  (1U)
#define GLB_REG_GPIO_25_PU_MSK                                  (((1U<<GLB_REG_GPIO_25_PU_LEN)-1)<<GLB_REG_GPIO_25_PU_POS)
#define GLB_REG_GPIO_25_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_25_PU_LEN)-1)<<GLB_REG_GPIO_25_PU_POS))
#define GLB_REG_GPIO_25_PD                                      GLB_REG_GPIO_25_PD
#define GLB_REG_GPIO_25_PD_POS                                  (21U)
#define GLB_REG_GPIO_25_PD_LEN                                  (1U)
#define GLB_REG_GPIO_25_PD_MSK                                  (((1U<<GLB_REG_GPIO_25_PD_LEN)-1)<<GLB_REG_GPIO_25_PD_POS)
#define GLB_REG_GPIO_25_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_25_PD_LEN)-1)<<GLB_REG_GPIO_25_PD_POS))
#define GLB_REG_GPIO_25_FUNC_SEL                                GLB_REG_GPIO_25_FUNC_SEL
#define GLB_REG_GPIO_25_FUNC_SEL_POS                            (24U)
#define GLB_REG_GPIO_25_FUNC_SEL_LEN                            (5U)
#define GLB_REG_GPIO_25_FUNC_SEL_MSK                            (((1U<<GLB_REG_GPIO_25_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_25_FUNC_SEL_POS)
#define GLB_REG_GPIO_25_FUNC_SEL_UMSK                           (~(((1U<<GLB_REG_GPIO_25_FUNC_SEL_LEN)-1)<<GLB_REG_GPIO_25_FUNC_SEL_POS))
#define GLB_REG_GPIO_25_MODE                                    GLB_REG_GPIO_25_MODE
#define GLB_REG_GPIO_25_MODE_POS                                (31U)
#define GLB_REG_GPIO_25_MODE_LEN                                (1U)
#define GLB_REG_GPIO_25_MODE_MSK                                (((1U<<GLB_REG_GPIO_25_MODE_LEN)-1)<<GLB_REG_GPIO_25_MODE_POS)
#define GLB_REG_GPIO_25_MODE_UMSK                               (~(((1U<<GLB_REG_GPIO_25_MODE_LEN)-1)<<GLB_REG_GPIO_25_MODE_POS))

