bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x140 : GPIO_CFGCTL16 */
#define GLB_GPIO_CFGCTL16_OFFSET                                (0x140)
#define GLB_REG_GPIO_32_IE                                      GLB_REG_GPIO_32_IE
#define GLB_REG_GPIO_32_IE_POS                                  (0U)
#define GLB_REG_GPIO_32_IE_LEN                                  (1U)
#define GLB_REG_GPIO_32_IE_MSK                                  (((1U<<GLB_REG_GPIO_32_IE_LEN)-1)<<GLB_REG_GPIO_32_IE_POS)
#define GLB_REG_GPIO_32_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_32_IE_LEN)-1)<<GLB_REG_GPIO_32_IE_POS))
#define GLB_REG_GPIO_32_SMT                                     GLB_REG_GPIO_32_SMT
#define GLB_REG_GPIO_32_SMT_POS                                 (1U)
#define GLB_REG_GPIO_32_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_32_SMT_MSK                                 (((1U<<GLB_REG_GPIO_32_SMT_LEN)-1)<<GLB_REG_GPIO_32_SMT_POS)
#define GLB_REG_GPIO_32_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_32_SMT_LEN)-1)<<GLB_REG_GPIO_32_SMT_POS))
#define GLB_REG_GPIO_32_DRV                                     GLB_REG_GPIO_32_DRV
#define GLB_REG_GPIO_32_DRV_POS                                 (2U)
#define GLB_REG_GPIO_32_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_32_DRV_MSK                                 (((1U<<GLB_REG_GPIO_32_DRV_LEN)-1)<<GLB_REG_GPIO_32_DRV_POS)
#define GLB_REG_GPIO_32_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_32_DRV_LEN)-1)<<GLB_REG_GPIO_32_DRV_POS))
#define GLB_REG_GPIO_32_PU                                      GLB_REG_GPIO_32_PU
#define GLB_REG_GPIO_32_PU_POS                                  (4U)
#define GLB_REG_GPIO_32_PU_LEN                                  (1U)
#define GLB_REG_GPIO_32_PU_MSK                                  (((1U<<GLB_REG_GPIO_32_PU_LEN)-1)<<GLB_REG_GPIO_32_PU_POS)
#define GLB_REG_GPIO_32_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_32_PU_LEN)-1)<<GLB_REG_GPIO_32_PU_POS))
#define GLB_REG_GPIO_32_PD                                      GLB_REG_GPIO_32_PD
#define GLB_REG_GPIO_32_PD_POS                                  (5U)
#define GLB_REG_GPIO_32_PD_LEN                                  (1U)
#define GLB_REG_GPIO_32_PD_MSK                                  (((1U<<GLB_REG_GPIO_32_PD_LEN)-1)<<GLB_REG_GPIO_32_PD_POS)
#define GLB_REG_GPIO_32_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_32_PD_LEN)-1)<<GLB_REG_GPIO_32_PD_POS))
#define GLB_REG_GPIO_33_IE                                      GLB_REG_GPIO_33_IE
#define GLB_REG_GPIO_33_IE_POS                                  (16U)
#define GLB_REG_GPIO_33_IE_LEN                                  (1U)
#define GLB_REG_GPIO_33_IE_MSK                                  (((1U<<GLB_REG_GPIO_33_IE_LEN)-1)<<GLB_REG_GPIO_33_IE_POS)
#define GLB_REG_GPIO_33_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_33_IE_LEN)-1)<<GLB_REG_GPIO_33_IE_POS))
#define GLB_REG_GPIO_33_SMT                                     GLB_REG_GPIO_33_SMT
#define GLB_REG_GPIO_33_SMT_POS                                 (17U)
#define GLB_REG_GPIO_33_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_33_SMT_MSK                                 (((1U<<GLB_REG_GPIO_33_SMT_LEN)-1)<<GLB_REG_GPIO_33_SMT_POS)
#define GLB_REG_GPIO_33_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_33_SMT_LEN)-1)<<GLB_REG_GPIO_33_SMT_POS))
#define GLB_REG_GPIO_33_DRV                                     GLB_REG_GPIO_33_DRV
#define GLB_REG_GPIO_33_DRV_POS                                 (18U)
#define GLB_REG_GPIO_33_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_33_DRV_MSK                                 (((1U<<GLB_REG_GPIO_33_DRV_LEN)-1)<<GLB_REG_GPIO_33_DRV_POS)
#define GLB_REG_GPIO_33_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_33_DRV_LEN)-1)<<GLB_REG_GPIO_33_DRV_POS))
#define GLB_REG_GPIO_33_PU                                      GLB_REG_GPIO_33_PU
#define GLB_REG_GPIO_33_PU_POS                                  (20U)
#define GLB_REG_GPIO_33_PU_LEN                                  (1U)
#define GLB_REG_GPIO_33_PU_MSK                                  (((1U<<GLB_REG_GPIO_33_PU_LEN)-1)<<GLB_REG_GPIO_33_PU_POS)
#define GLB_REG_GPIO_33_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_33_PU_LEN)-1)<<GLB_REG_GPIO_33_PU_POS))
#define GLB_REG_GPIO_33_PD                                      GLB_REG_GPIO_33_PD
#define GLB_REG_GPIO_33_PD_POS                                  (21U)
#define GLB_REG_GPIO_33_PD_LEN                                  (1U)
#define GLB_REG_GPIO_33_PD_MSK                                  (((1U<<GLB_REG_GPIO_33_PD_LEN)-1)<<GLB_REG_GPIO_33_PD_POS)
#define GLB_REG_GPIO_33_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_33_PD_LEN)-1)<<GLB_REG_GPIO_33_PD_POS))

/* 0x144 : GPIO_CFGCTL17 */
#define GLB_GPIO_CFGCTL17_OFFSET                                (0x144)
#define GLB_REG_GPIO_34_IE                                      GLB_REG_GPIO_34_IE
#define GLB_REG_GPIO_34_IE_POS                                  (0U)
#define GLB_REG_GPIO_34_IE_LEN                                  (1U)
#define GLB_REG_GPIO_34_IE_MSK                                  (((1U<<GLB_REG_GPIO_34_IE_LEN)-1)<<GLB_REG_GPIO_34_IE_POS)
#define GLB_REG_GPIO_34_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_34_IE_LEN)-1)<<GLB_REG_GPIO_34_IE_POS))
#define GLB_REG_GPIO_34_SMT                                     GLB_REG_GPIO_34_SMT
#define GLB_REG_GPIO_34_SMT_POS                                 (1U)
#define GLB_REG_GPIO_34_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_34_SMT_MSK                                 (((1U<<GLB_REG_GPIO_34_SMT_LEN)-1)<<GLB_REG_GPIO_34_SMT_POS)
#define GLB_REG_GPIO_34_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_34_SMT_LEN)-1)<<GLB_REG_GPIO_34_SMT_POS))
#define GLB_REG_GPIO_34_DRV                                     GLB_REG_GPIO_34_DRV
#define GLB_REG_GPIO_34_DRV_POS                                 (2U)
#define GLB_REG_GPIO_34_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_34_DRV_MSK                                 (((1U<<GLB_REG_GPIO_34_DRV_LEN)-1)<<GLB_REG_GPIO_34_DRV_POS)
#define GLB_REG_GPIO_34_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_34_DRV_LEN)-1)<<GLB_REG_GPIO_34_DRV_POS))
#define GLB_REG_GPIO_34_PU                                      GLB_REG_GPIO_34_PU
#define GLB_REG_GPIO_34_PU_POS                                  (4U)
#define GLB_REG_GPIO_34_PU_LEN                                  (1U)
#define GLB_REG_GPIO_34_PU_MSK                                  (((1U<<GLB_REG_GPIO_34_PU_LEN)-1)<<GLB_REG_GPIO_34_PU_POS)
#define GLB_REG_GPIO_34_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_34_PU_LEN)-1)<<GLB_REG_GPIO_34_PU_POS))
#define GLB_REG_GPIO_34_PD                                      GLB_REG_GPIO_34_PD
#define GLB_REG_GPIO_34_PD_POS                                  (5U)
#define GLB_REG_GPIO_34_PD_LEN                                  (1U)
#define GLB_REG_GPIO_34_PD_MSK                                  (((1U<<GLB_REG_GPIO_34_PD_LEN)-1)<<GLB_REG_GPIO_34_PD_POS)
#define GLB_REG_GPIO_34_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_34_PD_LEN)-1)<<GLB_REG_GPIO_34_PD_POS))
#define GLB_REG_GPIO_35_IE                                      GLB_REG_GPIO_35_IE
#define GLB_REG_GPIO_35_IE_POS                                  (16U)
#define GLB_REG_GPIO_35_IE_LEN                                  (1U)
#define GLB_REG_GPIO_35_IE_MSK                                  (((1U<<GLB_REG_GPIO_35_IE_LEN)-1)<<GLB_REG_GPIO_35_IE_POS)
#define GLB_REG_GPIO_35_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_35_IE_LEN)-1)<<GLB_REG_GPIO_35_IE_POS))
#define GLB_REG_GPIO_35_SMT                                     GLB_REG_GPIO_35_SMT
#define GLB_REG_GPIO_35_SMT_POS                                 (17U)
#define GLB_REG_GPIO_35_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_35_SMT_MSK                                 (((1U<<GLB_REG_GPIO_35_SMT_LEN)-1)<<GLB_REG_GPIO_35_SMT_POS)
#define GLB_REG_GPIO_35_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_35_SMT_LEN)-1)<<GLB_REG_GPIO_35_SMT_POS))
#define GLB_REG_GPIO_35_DRV                                     GLB_REG_GPIO_35_DRV
#define GLB_REG_GPIO_35_DRV_POS                                 (18U)
#define GLB_REG_GPIO_35_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_35_DRV_MSK                                 (((1U<<GLB_REG_GPIO_35_DRV_LEN)-1)<<GLB_REG_GPIO_35_DRV_POS)
#define GLB_REG_GPIO_35_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_35_DRV_LEN)-1)<<GLB_REG_GPIO_35_DRV_POS))
#define GLB_REG_GPIO_35_PU                                      GLB_REG_GPIO_35_PU
#define GLB_REG_GPIO_35_PU_POS                                  (20U)
#define GLB_REG_GPIO_35_PU_LEN                                  (1U)
#define GLB_REG_GPIO_35_PU_MSK                                  (((1U<<GLB_REG_GPIO_35_PU_LEN)-1)<<GLB_REG_GPIO_35_PU_POS)
#define GLB_REG_GPIO_35_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_35_PU_LEN)-1)<<GLB_REG_GPIO_35_PU_POS))
#define GLB_REG_GPIO_35_PD                                      GLB_REG_GPIO_35_PD
#define GLB_REG_GPIO_35_PD_POS                                  (21U)
#define GLB_REG_GPIO_35_PD_LEN                                  (1U)
#define GLB_REG_GPIO_35_PD_MSK                                  (((1U<<GLB_REG_GPIO_35_PD_LEN)-1)<<GLB_REG_GPIO_35_PD_POS)
#define GLB_REG_GPIO_35_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_35_PD_LEN)-1)<<GLB_REG_GPIO_35_PD_POS))

/* 0x148 : GPIO_CFGCTL18 */
#define GLB_GPIO_CFGCTL18_OFFSET                                (0x148)
#define GLB_REG_GPIO_36_IE                                      GLB_REG_GPIO_36_IE
#define GLB_REG_GPIO_36_IE_POS                                  (0U)
#define GLB_REG_GPIO_36_IE_LEN                                  (1U)
#define GLB_REG_GPIO_36_IE_MSK                                  (((1U<<GLB_REG_GPIO_36_IE_LEN)-1)<<GLB_REG_GPIO_36_IE_POS)
#define GLB_REG_GPIO_36_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_36_IE_LEN)-1)<<GLB_REG_GPIO_36_IE_POS))
#define GLB_REG_GPIO_36_SMT                                     GLB_REG_GPIO_36_SMT
#define GLB_REG_GPIO_36_SMT_POS                                 (1U)
#define GLB_REG_GPIO_36_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_36_SMT_MSK                                 (((1U<<GLB_REG_GPIO_36_SMT_LEN)-1)<<GLB_REG_GPIO_36_SMT_POS)
#define GLB_REG_GPIO_36_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_36_SMT_LEN)-1)<<GLB_REG_GPIO_36_SMT_POS))
#define GLB_REG_GPIO_36_DRV                                     GLB_REG_GPIO_36_DRV
#define GLB_REG_GPIO_36_DRV_POS                                 (2U)
#define GLB_REG_GPIO_36_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_36_DRV_MSK                                 (((1U<<GLB_REG_GPIO_36_DRV_LEN)-1)<<GLB_REG_GPIO_36_DRV_POS)
#define GLB_REG_GPIO_36_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_36_DRV_LEN)-1)<<GLB_REG_GPIO_36_DRV_POS))
#define GLB_REG_GPIO_36_PU                                      GLB_REG_GPIO_36_PU
#define GLB_REG_GPIO_36_PU_POS                                  (4U)
#define GLB_REG_GPIO_36_PU_LEN                                  (1U)
#define GLB_REG_GPIO_36_PU_MSK                                  (((1U<<GLB_REG_GPIO_36_PU_LEN)-1)<<GLB_REG_GPIO_36_PU_POS)
#define GLB_REG_GPIO_36_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_36_PU_LEN)-1)<<GLB_REG_GPIO_36_PU_POS))
#define GLB_REG_GPIO_36_PD                                      GLB_REG_GPIO_36_PD
#define GLB_REG_GPIO_36_PD_POS                                  (5U)
#define GLB_REG_GPIO_36_PD_LEN                                  (1U)
#define GLB_REG_GPIO_36_PD_MSK                                  (((1U<<GLB_REG_GPIO_36_PD_LEN)-1)<<GLB_REG_GPIO_36_PD_POS)
#define GLB_REG_GPIO_36_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_36_PD_LEN)-1)<<GLB_REG_GPIO_36_PD_POS))
#define GLB_REG_GPIO_37_IE                                      GLB_REG_GPIO_37_IE
#define GLB_REG_GPIO_37_IE_POS                                  (16U)
#define GLB_REG_GPIO_37_IE_LEN                                  (1U)
#define GLB_REG_GPIO_37_IE_MSK                                  (((1U<<GLB_REG_GPIO_37_IE_LEN)-1)<<GLB_REG_GPIO_37_IE_POS)
#define GLB_REG_GPIO_37_IE_UMSK                                 (~(((1U<<GLB_REG_GPIO_37_IE_LEN)-1)<<GLB_REG_GPIO_37_IE_POS))
#define GLB_REG_GPIO_37_SMT                                     GLB_REG_GPIO_37_SMT
#define GLB_REG_GPIO_37_SMT_POS                                 (17U)
#define GLB_REG_GPIO_37_SMT_LEN                                 (1U)
#define GLB_REG_GPIO_37_SMT_MSK                                 (((1U<<GLB_REG_GPIO_37_SMT_LEN)-1)<<GLB_REG_GPIO_37_SMT_POS)
#define GLB_REG_GPIO_37_SMT_UMSK                                (~(((1U<<GLB_REG_GPIO_37_SMT_LEN)-1)<<GLB_REG_GPIO_37_SMT_POS))
#define GLB_REG_GPIO_37_DRV                                     GLB_REG_GPIO_37_DRV
#define GLB_REG_GPIO_37_DRV_POS                                 (18U)
#define GLB_REG_GPIO_37_DRV_LEN                                 (2U)
#define GLB_REG_GPIO_37_DRV_MSK                                 (((1U<<GLB_REG_GPIO_37_DRV_LEN)-1)<<GLB_REG_GPIO_37_DRV_POS)
#define GLB_REG_GPIO_37_DRV_UMSK                                (~(((1U<<GLB_REG_GPIO_37_DRV_LEN)-1)<<GLB_REG_GPIO_37_DRV_POS))
#define GLB_REG_GPIO_37_PU                                      GLB_REG_GPIO_37_PU
#define GLB_REG_GPIO_37_PU_POS                                  (20U)
#define GLB_REG_GPIO_37_PU_LEN                                  (1U)
#define GLB_REG_GPIO_37_PU_MSK                                  (((1U<<GLB_REG_GPIO_37_PU_LEN)-1)<<GLB_REG_GPIO_37_PU_POS)
#define GLB_REG_GPIO_37_PU_UMSK                                 (~(((1U<<GLB_REG_GPIO_37_PU_LEN)-1)<<GLB_REG_GPIO_37_PU_POS))
#define GLB_REG_GPIO_37_PD                                      GLB_REG_GPIO_37_PD
#define GLB_REG_GPIO_37_PD_POS                                  (21U)
#define GLB_REG_GPIO_37_PD_LEN                                  (1U)
#define GLB_REG_GPIO_37_PD_MSK                                  (((1U<<GLB_REG_GPIO_37_PD_LEN)-1)<<GLB_REG_GPIO_37_PD_POS)
#define GLB_REG_GPIO_37_PD_UMSK                                 (~(((1U<<GLB_REG_GPIO_37_PD_LEN)-1)<<GLB_REG_GPIO_37_PD_POS))

