bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x180 : GPIO_CFGCTL30 */
#define GLB_GPIO_CFGCTL30_OFFSET                                (0x180)
#define GLB_REG_GPIO_0_I                                        GLB_REG_GPIO_0_I
#define GLB_REG_GPIO_0_I_POS                                    (0U)
#define GLB_REG_GPIO_0_I_LEN                                    (1U)
#define GLB_REG_GPIO_0_I_MSK                                    (((1U<<GLB_REG_GPIO_0_I_LEN)-1)<<GLB_REG_GPIO_0_I_POS)
#define GLB_REG_GPIO_0_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_0_I_LEN)-1)<<GLB_REG_GPIO_0_I_POS))
#define GLB_REG_GPIO_1_I                                        GLB_REG_GPIO_1_I
#define GLB_REG_GPIO_1_I_POS                                    (1U)
#define GLB_REG_GPIO_1_I_LEN                                    (1U)
#define GLB_REG_GPIO_1_I_MSK                                    (((1U<<GLB_REG_GPIO_1_I_LEN)-1)<<GLB_REG_GPIO_1_I_POS)
#define GLB_REG_GPIO_1_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_1_I_LEN)-1)<<GLB_REG_GPIO_1_I_POS))
#define GLB_REG_GPIO_2_I                                        GLB_REG_GPIO_2_I
#define GLB_REG_GPIO_2_I_POS                                    (2U)
#define GLB_REG_GPIO_2_I_LEN                                    (1U)
#define GLB_REG_GPIO_2_I_MSK                                    (((1U<<GLB_REG_GPIO_2_I_LEN)-1)<<GLB_REG_GPIO_2_I_POS)
#define GLB_REG_GPIO_2_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_2_I_LEN)-1)<<GLB_REG_GPIO_2_I_POS))
#define GLB_REG_GPIO_3_I                                        GLB_REG_GPIO_3_I
#define GLB_REG_GPIO_3_I_POS                                    (3U)
#define GLB_REG_GPIO_3_I_LEN                                    (1U)
#define GLB_REG_GPIO_3_I_MSK                                    (((1U<<GLB_REG_GPIO_3_I_LEN)-1)<<GLB_REG_GPIO_3_I_POS)
#define GLB_REG_GPIO_3_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_3_I_LEN)-1)<<GLB_REG_GPIO_3_I_POS))
#define GLB_REG_GPIO_7_I                                        GLB_REG_GPIO_7_I
#define GLB_REG_GPIO_7_I_POS                                    (7U)
#define GLB_REG_GPIO_7_I_LEN                                    (1U)
#define GLB_REG_GPIO_7_I_MSK                                    (((1U<<GLB_REG_GPIO_7_I_LEN)-1)<<GLB_REG_GPIO_7_I_POS)
#define GLB_REG_GPIO_7_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_7_I_LEN)-1)<<GLB_REG_GPIO_7_I_POS))
#define GLB_REG_GPIO_8_I                                        GLB_REG_GPIO_8_I
#define GLB_REG_GPIO_8_I_POS                                    (8U)
#define GLB_REG_GPIO_8_I_LEN                                    (1U)
#define GLB_REG_GPIO_8_I_MSK                                    (((1U<<GLB_REG_GPIO_8_I_LEN)-1)<<GLB_REG_GPIO_8_I_POS)
#define GLB_REG_GPIO_8_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_8_I_LEN)-1)<<GLB_REG_GPIO_8_I_POS))
#define GLB_REG_GPIO_9_I                                        GLB_REG_GPIO_9_I
#define GLB_REG_GPIO_9_I_POS                                    (9U)
#define GLB_REG_GPIO_9_I_LEN                                    (1U)
#define GLB_REG_GPIO_9_I_MSK                                    (((1U<<GLB_REG_GPIO_9_I_LEN)-1)<<GLB_REG_GPIO_9_I_POS)
#define GLB_REG_GPIO_9_I_UMSK                                   (~(((1U<<GLB_REG_GPIO_9_I_LEN)-1)<<GLB_REG_GPIO_9_I_POS))
#define GLB_REG_GPIO_10_I                                       GLB_REG_GPIO_10_I
#define GLB_REG_GPIO_10_I_POS                                   (10U)
#define GLB_REG_GPIO_10_I_LEN                                   (1U)
#define GLB_REG_GPIO_10_I_MSK                                   (((1U<<GLB_REG_GPIO_10_I_LEN)-1)<<GLB_REG_GPIO_10_I_POS)
#define GLB_REG_GPIO_10_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_10_I_LEN)-1)<<GLB_REG_GPIO_10_I_POS))
#define GLB_REG_GPIO_11_I                                       GLB_REG_GPIO_11_I
#define GLB_REG_GPIO_11_I_POS                                   (11U)
#define GLB_REG_GPIO_11_I_LEN                                   (1U)
#define GLB_REG_GPIO_11_I_MSK                                   (((1U<<GLB_REG_GPIO_11_I_LEN)-1)<<GLB_REG_GPIO_11_I_POS)
#define GLB_REG_GPIO_11_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_11_I_LEN)-1)<<GLB_REG_GPIO_11_I_POS))
#define GLB_REG_GPIO_12_I                                       GLB_REG_GPIO_12_I
#define GLB_REG_GPIO_12_I_POS                                   (12U)
#define GLB_REG_GPIO_12_I_LEN                                   (1U)
#define GLB_REG_GPIO_12_I_MSK                                   (((1U<<GLB_REG_GPIO_12_I_LEN)-1)<<GLB_REG_GPIO_12_I_POS)
#define GLB_REG_GPIO_12_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_12_I_LEN)-1)<<GLB_REG_GPIO_12_I_POS))
#define GLB_REG_GPIO_13_I                                       GLB_REG_GPIO_13_I
#define GLB_REG_GPIO_13_I_POS                                   (13U)
#define GLB_REG_GPIO_13_I_LEN                                   (1U)
#define GLB_REG_GPIO_13_I_MSK                                   (((1U<<GLB_REG_GPIO_13_I_LEN)-1)<<GLB_REG_GPIO_13_I_POS)
#define GLB_REG_GPIO_13_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_13_I_LEN)-1)<<GLB_REG_GPIO_13_I_POS))
#define GLB_REG_GPIO_14_I                                       GLB_REG_GPIO_14_I
#define GLB_REG_GPIO_14_I_POS                                   (14U)
#define GLB_REG_GPIO_14_I_LEN                                   (1U)
#define GLB_REG_GPIO_14_I_MSK                                   (((1U<<GLB_REG_GPIO_14_I_LEN)-1)<<GLB_REG_GPIO_14_I_POS)
#define GLB_REG_GPIO_14_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_14_I_LEN)-1)<<GLB_REG_GPIO_14_I_POS))
#define GLB_REG_GPIO_15_I                                       GLB_REG_GPIO_15_I
#define GLB_REG_GPIO_15_I_POS                                   (15U)
#define GLB_REG_GPIO_15_I_LEN                                   (1U)
#define GLB_REG_GPIO_15_I_MSK                                   (((1U<<GLB_REG_GPIO_15_I_LEN)-1)<<GLB_REG_GPIO_15_I_POS)
#define GLB_REG_GPIO_15_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_15_I_LEN)-1)<<GLB_REG_GPIO_15_I_POS))
#define GLB_REG_GPIO_16_I                                       GLB_REG_GPIO_16_I
#define GLB_REG_GPIO_16_I_POS                                   (16U)
#define GLB_REG_GPIO_16_I_LEN                                   (1U)
#define GLB_REG_GPIO_16_I_MSK                                   (((1U<<GLB_REG_GPIO_16_I_LEN)-1)<<GLB_REG_GPIO_16_I_POS)
#define GLB_REG_GPIO_16_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_16_I_LEN)-1)<<GLB_REG_GPIO_16_I_POS))
#define GLB_REG_GPIO_17_I                                       GLB_REG_GPIO_17_I
#define GLB_REG_GPIO_17_I_POS                                   (17U)
#define GLB_REG_GPIO_17_I_LEN                                   (1U)
#define GLB_REG_GPIO_17_I_MSK                                   (((1U<<GLB_REG_GPIO_17_I_LEN)-1)<<GLB_REG_GPIO_17_I_POS)
#define GLB_REG_GPIO_17_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_17_I_LEN)-1)<<GLB_REG_GPIO_17_I_POS))
#define GLB_REG_GPIO_18_I                                       GLB_REG_GPIO_18_I
#define GLB_REG_GPIO_18_I_POS                                   (18U)
#define GLB_REG_GPIO_18_I_LEN                                   (1U)
#define GLB_REG_GPIO_18_I_MSK                                   (((1U<<GLB_REG_GPIO_18_I_LEN)-1)<<GLB_REG_GPIO_18_I_POS)
#define GLB_REG_GPIO_18_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_18_I_LEN)-1)<<GLB_REG_GPIO_18_I_POS))
#define GLB_REG_GPIO_19_I                                       GLB_REG_GPIO_19_I
#define GLB_REG_GPIO_19_I_POS                                   (19U)
#define GLB_REG_GPIO_19_I_LEN                                   (1U)
#define GLB_REG_GPIO_19_I_MSK                                   (((1U<<GLB_REG_GPIO_19_I_LEN)-1)<<GLB_REG_GPIO_19_I_POS)
#define GLB_REG_GPIO_19_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_19_I_LEN)-1)<<GLB_REG_GPIO_19_I_POS))
#define GLB_REG_GPIO_20_I                                       GLB_REG_GPIO_20_I
#define GLB_REG_GPIO_20_I_POS                                   (20U)
#define GLB_REG_GPIO_20_I_LEN                                   (1U)
#define GLB_REG_GPIO_20_I_MSK                                   (((1U<<GLB_REG_GPIO_20_I_LEN)-1)<<GLB_REG_GPIO_20_I_POS)
#define GLB_REG_GPIO_20_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_20_I_LEN)-1)<<GLB_REG_GPIO_20_I_POS))
#define GLB_REG_GPIO_21_I                                       GLB_REG_GPIO_21_I
#define GLB_REG_GPIO_21_I_POS                                   (21U)
#define GLB_REG_GPIO_21_I_LEN                                   (1U)
#define GLB_REG_GPIO_21_I_MSK                                   (((1U<<GLB_REG_GPIO_21_I_LEN)-1)<<GLB_REG_GPIO_21_I_POS)
#define GLB_REG_GPIO_21_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_21_I_LEN)-1)<<GLB_REG_GPIO_21_I_POS))
#define GLB_REG_GPIO_22_I                                       GLB_REG_GPIO_22_I
#define GLB_REG_GPIO_22_I_POS                                   (22U)
#define GLB_REG_GPIO_22_I_LEN                                   (1U)
#define GLB_REG_GPIO_22_I_MSK                                   (((1U<<GLB_REG_GPIO_22_I_LEN)-1)<<GLB_REG_GPIO_22_I_POS)
#define GLB_REG_GPIO_22_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_22_I_LEN)-1)<<GLB_REG_GPIO_22_I_POS))
#define GLB_REG_GPIO_23_I                                       GLB_REG_GPIO_23_I
#define GLB_REG_GPIO_23_I_POS                                   (23U)
#define GLB_REG_GPIO_23_I_LEN                                   (1U)
#define GLB_REG_GPIO_23_I_MSK                                   (((1U<<GLB_REG_GPIO_23_I_LEN)-1)<<GLB_REG_GPIO_23_I_POS)
#define GLB_REG_GPIO_23_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_23_I_LEN)-1)<<GLB_REG_GPIO_23_I_POS))
#define GLB_REG_GPIO_24_I                                       GLB_REG_GPIO_24_I
#define GLB_REG_GPIO_24_I_POS                                   (24U)
#define GLB_REG_GPIO_24_I_LEN                                   (1U)
#define GLB_REG_GPIO_24_I_MSK                                   (((1U<<GLB_REG_GPIO_24_I_LEN)-1)<<GLB_REG_GPIO_24_I_POS)
#define GLB_REG_GPIO_24_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_24_I_LEN)-1)<<GLB_REG_GPIO_24_I_POS))
#define GLB_REG_GPIO_25_I                                       GLB_REG_GPIO_25_I
#define GLB_REG_GPIO_25_I_POS                                   (25U)
#define GLB_REG_GPIO_25_I_LEN                                   (1U)
#define GLB_REG_GPIO_25_I_MSK                                   (((1U<<GLB_REG_GPIO_25_I_LEN)-1)<<GLB_REG_GPIO_25_I_POS)
#define GLB_REG_GPIO_25_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_25_I_LEN)-1)<<GLB_REG_GPIO_25_I_POS))
#define GLB_REG_GPIO_26_I                                       GLB_REG_GPIO_26_I
#define GLB_REG_GPIO_26_I_POS                                   (26U)
#define GLB_REG_GPIO_26_I_LEN                                   (1U)
#define GLB_REG_GPIO_26_I_MSK                                   (((1U<<GLB_REG_GPIO_26_I_LEN)-1)<<GLB_REG_GPIO_26_I_POS)
#define GLB_REG_GPIO_26_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_26_I_LEN)-1)<<GLB_REG_GPIO_26_I_POS))
#define GLB_REG_GPIO_27_I                                       GLB_REG_GPIO_27_I
#define GLB_REG_GPIO_27_I_POS                                   (27U)
#define GLB_REG_GPIO_27_I_LEN                                   (1U)
#define GLB_REG_GPIO_27_I_MSK                                   (((1U<<GLB_REG_GPIO_27_I_LEN)-1)<<GLB_REG_GPIO_27_I_POS)
#define GLB_REG_GPIO_27_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_27_I_LEN)-1)<<GLB_REG_GPIO_27_I_POS))
#define GLB_REG_GPIO_28_I                                       GLB_REG_GPIO_28_I
#define GLB_REG_GPIO_28_I_POS                                   (28U)
#define GLB_REG_GPIO_28_I_LEN                                   (1U)
#define GLB_REG_GPIO_28_I_MSK                                   (((1U<<GLB_REG_GPIO_28_I_LEN)-1)<<GLB_REG_GPIO_28_I_POS)
#define GLB_REG_GPIO_28_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_28_I_LEN)-1)<<GLB_REG_GPIO_28_I_POS))
#define GLB_REG_GPIO_29_I                                       GLB_REG_GPIO_29_I
#define GLB_REG_GPIO_29_I_POS                                   (29U)
#define GLB_REG_GPIO_29_I_LEN                                   (1U)
#define GLB_REG_GPIO_29_I_MSK                                   (((1U<<GLB_REG_GPIO_29_I_LEN)-1)<<GLB_REG_GPIO_29_I_POS)
#define GLB_REG_GPIO_29_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_29_I_LEN)-1)<<GLB_REG_GPIO_29_I_POS))
#define GLB_REG_GPIO_30_I                                       GLB_REG_GPIO_30_I
#define GLB_REG_GPIO_30_I_POS                                   (30U)
#define GLB_REG_GPIO_30_I_LEN                                   (1U)
#define GLB_REG_GPIO_30_I_MSK                                   (((1U<<GLB_REG_GPIO_30_I_LEN)-1)<<GLB_REG_GPIO_30_I_POS)
#define GLB_REG_GPIO_30_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_30_I_LEN)-1)<<GLB_REG_GPIO_30_I_POS))
#define GLB_REG_GPIO_31_I                                       GLB_REG_GPIO_31_I
#define GLB_REG_GPIO_31_I_POS                                   (31U)
#define GLB_REG_GPIO_31_I_LEN                                   (1U)
#define GLB_REG_GPIO_31_I_MSK                                   (((1U<<GLB_REG_GPIO_31_I_LEN)-1)<<GLB_REG_GPIO_31_I_POS)
#define GLB_REG_GPIO_31_I_UMSK                                  (~(((1U<<GLB_REG_GPIO_31_I_LEN)-1)<<GLB_REG_GPIO_31_I_POS))

/* 0x184 : GPIO_CFGCTL31 */
#define GLB_GPIO_CFGCTL31_OFFSET                                (0x184)

