bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x188 : GPIO_CFGCTL32 */
#define GLB_GPIO_CFGCTL32_OFFSET                                (0x188)
#define GLB_REG_GPIO_0_O                                        GLB_REG_GPIO_0_O
#define GLB_REG_GPIO_0_O_POS                                    (0U)
#define GLB_REG_GPIO_0_O_LEN                                    (1U)
#define GLB_REG_GPIO_0_O_MSK                                    (((1U<<GLB_REG_GPIO_0_O_LEN)-1)<<GLB_REG_GPIO_0_O_POS)
#define GLB_REG_GPIO_0_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_0_O_LEN)-1)<<GLB_REG_GPIO_0_O_POS))
#define GLB_REG_GPIO_1_O                                        GLB_REG_GPIO_1_O
#define GLB_REG_GPIO_1_O_POS                                    (1U)
#define GLB_REG_GPIO_1_O_LEN                                    (1U)
#define GLB_REG_GPIO_1_O_MSK                                    (((1U<<GLB_REG_GPIO_1_O_LEN)-1)<<GLB_REG_GPIO_1_O_POS)
#define GLB_REG_GPIO_1_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_1_O_LEN)-1)<<GLB_REG_GPIO_1_O_POS))
#define GLB_REG_GPIO_2_O                                        GLB_REG_GPIO_2_O
#define GLB_REG_GPIO_2_O_POS                                    (2U)
#define GLB_REG_GPIO_2_O_LEN                                    (1U)
#define GLB_REG_GPIO_2_O_MSK                                    (((1U<<GLB_REG_GPIO_2_O_LEN)-1)<<GLB_REG_GPIO_2_O_POS)
#define GLB_REG_GPIO_2_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_2_O_LEN)-1)<<GLB_REG_GPIO_2_O_POS))
#define GLB_REG_GPIO_3_O                                        GLB_REG_GPIO_3_O
#define GLB_REG_GPIO_3_O_POS                                    (3U)
#define GLB_REG_GPIO_3_O_LEN                                    (1U)
#define GLB_REG_GPIO_3_O_MSK                                    (((1U<<GLB_REG_GPIO_3_O_LEN)-1)<<GLB_REG_GPIO_3_O_POS)
#define GLB_REG_GPIO_3_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_3_O_LEN)-1)<<GLB_REG_GPIO_3_O_POS))
#define GLB_REG_GPIO_7_O                                        GLB_REG_GPIO_7_O
#define GLB_REG_GPIO_7_O_POS                                    (7U)
#define GLB_REG_GPIO_7_O_LEN                                    (1U)
#define GLB_REG_GPIO_7_O_MSK                                    (((1U<<GLB_REG_GPIO_7_O_LEN)-1)<<GLB_REG_GPIO_7_O_POS)
#define GLB_REG_GPIO_7_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_7_O_LEN)-1)<<GLB_REG_GPIO_7_O_POS))
#define GLB_REG_GPIO_8_O                                        GLB_REG_GPIO_8_O
#define GLB_REG_GPIO_8_O_POS                                    (8U)
#define GLB_REG_GPIO_8_O_LEN                                    (1U)
#define GLB_REG_GPIO_8_O_MSK                                    (((1U<<GLB_REG_GPIO_8_O_LEN)-1)<<GLB_REG_GPIO_8_O_POS)
#define GLB_REG_GPIO_8_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_8_O_LEN)-1)<<GLB_REG_GPIO_8_O_POS))
#define GLB_REG_GPIO_9_O                                        GLB_REG_GPIO_9_O
#define GLB_REG_GPIO_9_O_POS                                    (9U)
#define GLB_REG_GPIO_9_O_LEN                                    (1U)
#define GLB_REG_GPIO_9_O_MSK                                    (((1U<<GLB_REG_GPIO_9_O_LEN)-1)<<GLB_REG_GPIO_9_O_POS)
#define GLB_REG_GPIO_9_O_UMSK                                   (~(((1U<<GLB_REG_GPIO_9_O_LEN)-1)<<GLB_REG_GPIO_9_O_POS))
#define GLB_REG_GPIO_10_O                                       GLB_REG_GPIO_10_O
#define GLB_REG_GPIO_10_O_POS                                   (10U)
#define GLB_REG_GPIO_10_O_LEN                                   (1U)
#define GLB_REG_GPIO_10_O_MSK                                   (((1U<<GLB_REG_GPIO_10_O_LEN)-1)<<GLB_REG_GPIO_10_O_POS)
#define GLB_REG_GPIO_10_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_10_O_LEN)-1)<<GLB_REG_GPIO_10_O_POS))
#define GLB_REG_GPIO_11_O                                       GLB_REG_GPIO_11_O
#define GLB_REG_GPIO_11_O_POS                                   (11U)
#define GLB_REG_GPIO_11_O_LEN                                   (1U)
#define GLB_REG_GPIO_11_O_MSK                                   (((1U<<GLB_REG_GPIO_11_O_LEN)-1)<<GLB_REG_GPIO_11_O_POS)
#define GLB_REG_GPIO_11_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_11_O_LEN)-1)<<GLB_REG_GPIO_11_O_POS))
#define GLB_REG_GPIO_12_O                                       GLB_REG_GPIO_12_O
#define GLB_REG_GPIO_12_O_POS                                   (12U)
#define GLB_REG_GPIO_12_O_LEN                                   (1U)
#define GLB_REG_GPIO_12_O_MSK                                   (((1U<<GLB_REG_GPIO_12_O_LEN)-1)<<GLB_REG_GPIO_12_O_POS)
#define GLB_REG_GPIO_12_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_12_O_LEN)-1)<<GLB_REG_GPIO_12_O_POS))
#define GLB_REG_GPIO_13_O                                       GLB_REG_GPIO_13_O
#define GLB_REG_GPIO_13_O_POS                                   (13U)
#define GLB_REG_GPIO_13_O_LEN                                   (1U)
#define GLB_REG_GPIO_13_O_MSK                                   (((1U<<GLB_REG_GPIO_13_O_LEN)-1)<<GLB_REG_GPIO_13_O_POS)
#define GLB_REG_GPIO_13_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_13_O_LEN)-1)<<GLB_REG_GPIO_13_O_POS))
#define GLB_REG_GPIO_14_O                                       GLB_REG_GPIO_14_O
#define GLB_REG_GPIO_14_O_POS                                   (14U)
#define GLB_REG_GPIO_14_O_LEN                                   (1U)
#define GLB_REG_GPIO_14_O_MSK                                   (((1U<<GLB_REG_GPIO_14_O_LEN)-1)<<GLB_REG_GPIO_14_O_POS)
#define GLB_REG_GPIO_14_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_14_O_LEN)-1)<<GLB_REG_GPIO_14_O_POS))
#define GLB_REG_GPIO_15_O                                       GLB_REG_GPIO_15_O
#define GLB_REG_GPIO_15_O_POS                                   (15U)
#define GLB_REG_GPIO_15_O_LEN                                   (1U)
#define GLB_REG_GPIO_15_O_MSK                                   (((1U<<GLB_REG_GPIO_15_O_LEN)-1)<<GLB_REG_GPIO_15_O_POS)
#define GLB_REG_GPIO_15_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_15_O_LEN)-1)<<GLB_REG_GPIO_15_O_POS))
#define GLB_REG_GPIO_16_O                                       GLB_REG_GPIO_16_O
#define GLB_REG_GPIO_16_O_POS                                   (16U)
#define GLB_REG_GPIO_16_O_LEN                                   (1U)
#define GLB_REG_GPIO_16_O_MSK                                   (((1U<<GLB_REG_GPIO_16_O_LEN)-1)<<GLB_REG_GPIO_16_O_POS)
#define GLB_REG_GPIO_16_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_16_O_LEN)-1)<<GLB_REG_GPIO_16_O_POS))
#define GLB_REG_GPIO_17_O                                       GLB_REG_GPIO_17_O
#define GLB_REG_GPIO_17_O_POS                                   (17U)
#define GLB_REG_GPIO_17_O_LEN                                   (1U)
#define GLB_REG_GPIO_17_O_MSK                                   (((1U<<GLB_REG_GPIO_17_O_LEN)-1)<<GLB_REG_GPIO_17_O_POS)
#define GLB_REG_GPIO_17_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_17_O_LEN)-1)<<GLB_REG_GPIO_17_O_POS))
#define GLB_REG_GPIO_18_O                                       GLB_REG_GPIO_18_O
#define GLB_REG_GPIO_18_O_POS                                   (18U)
#define GLB_REG_GPIO_18_O_LEN                                   (1U)
#define GLB_REG_GPIO_18_O_MSK                                   (((1U<<GLB_REG_GPIO_18_O_LEN)-1)<<GLB_REG_GPIO_18_O_POS)
#define GLB_REG_GPIO_18_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_18_O_LEN)-1)<<GLB_REG_GPIO_18_O_POS))
#define GLB_REG_GPIO_19_O                                       GLB_REG_GPIO_19_O
#define GLB_REG_GPIO_19_O_POS                                   (19U)
#define GLB_REG_GPIO_19_O_LEN                                   (1U)
#define GLB_REG_GPIO_19_O_MSK                                   (((1U<<GLB_REG_GPIO_19_O_LEN)-1)<<GLB_REG_GPIO_19_O_POS)
#define GLB_REG_GPIO_19_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_19_O_LEN)-1)<<GLB_REG_GPIO_19_O_POS))
#define GLB_REG_GPIO_20_O                                       GLB_REG_GPIO_20_O
#define GLB_REG_GPIO_20_O_POS                                   (20U)
#define GLB_REG_GPIO_20_O_LEN                                   (1U)
#define GLB_REG_GPIO_20_O_MSK                                   (((1U<<GLB_REG_GPIO_20_O_LEN)-1)<<GLB_REG_GPIO_20_O_POS)
#define GLB_REG_GPIO_20_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_20_O_LEN)-1)<<GLB_REG_GPIO_20_O_POS))
#define GLB_REG_GPIO_21_O                                       GLB_REG_GPIO_21_O
#define GLB_REG_GPIO_21_O_POS                                   (21U)
#define GLB_REG_GPIO_21_O_LEN                                   (1U)
#define GLB_REG_GPIO_21_O_MSK                                   (((1U<<GLB_REG_GPIO_21_O_LEN)-1)<<GLB_REG_GPIO_21_O_POS)
#define GLB_REG_GPIO_21_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_21_O_LEN)-1)<<GLB_REG_GPIO_21_O_POS))
#define GLB_REG_GPIO_22_O                                       GLB_REG_GPIO_22_O
#define GLB_REG_GPIO_22_O_POS                                   (22U)
#define GLB_REG_GPIO_22_O_LEN                                   (1U)
#define GLB_REG_GPIO_22_O_MSK                                   (((1U<<GLB_REG_GPIO_22_O_LEN)-1)<<GLB_REG_GPIO_22_O_POS)
#define GLB_REG_GPIO_22_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_22_O_LEN)-1)<<GLB_REG_GPIO_22_O_POS))
#define GLB_REG_GPIO_23_O                                       GLB_REG_GPIO_23_O
#define GLB_REG_GPIO_23_O_POS                                   (23U)
#define GLB_REG_GPIO_23_O_LEN                                   (1U)
#define GLB_REG_GPIO_23_O_MSK                                   (((1U<<GLB_REG_GPIO_23_O_LEN)-1)<<GLB_REG_GPIO_23_O_POS)
#define GLB_REG_GPIO_23_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_23_O_LEN)-1)<<GLB_REG_GPIO_23_O_POS))
#define GLB_REG_GPIO_24_O                                       GLB_REG_GPIO_24_O
#define GLB_REG_GPIO_24_O_POS                                   (24U)
#define GLB_REG_GPIO_24_O_LEN                                   (1U)
#define GLB_REG_GPIO_24_O_MSK                                   (((1U<<GLB_REG_GPIO_24_O_LEN)-1)<<GLB_REG_GPIO_24_O_POS)
#define GLB_REG_GPIO_24_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_24_O_LEN)-1)<<GLB_REG_GPIO_24_O_POS))
#define GLB_REG_GPIO_25_O                                       GLB_REG_GPIO_25_O
#define GLB_REG_GPIO_25_O_POS                                   (25U)
#define GLB_REG_GPIO_25_O_LEN                                   (1U)
#define GLB_REG_GPIO_25_O_MSK                                   (((1U<<GLB_REG_GPIO_25_O_LEN)-1)<<GLB_REG_GPIO_25_O_POS)
#define GLB_REG_GPIO_25_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_25_O_LEN)-1)<<GLB_REG_GPIO_25_O_POS))
#define GLB_REG_GPIO_26_O                                       GLB_REG_GPIO_26_O
#define GLB_REG_GPIO_26_O_POS                                   (26U)
#define GLB_REG_GPIO_26_O_LEN                                   (1U)
#define GLB_REG_GPIO_26_O_MSK                                   (((1U<<GLB_REG_GPIO_26_O_LEN)-1)<<GLB_REG_GPIO_26_O_POS)
#define GLB_REG_GPIO_26_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_26_O_LEN)-1)<<GLB_REG_GPIO_26_O_POS))
#define GLB_REG_GPIO_27_O                                       GLB_REG_GPIO_27_O
#define GLB_REG_GPIO_27_O_POS                                   (27U)
#define GLB_REG_GPIO_27_O_LEN                                   (1U)
#define GLB_REG_GPIO_27_O_MSK                                   (((1U<<GLB_REG_GPIO_27_O_LEN)-1)<<GLB_REG_GPIO_27_O_POS)
#define GLB_REG_GPIO_27_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_27_O_LEN)-1)<<GLB_REG_GPIO_27_O_POS))
#define GLB_REG_GPIO_28_O                                       GLB_REG_GPIO_28_O
#define GLB_REG_GPIO_28_O_POS                                   (28U)
#define GLB_REG_GPIO_28_O_LEN                                   (1U)
#define GLB_REG_GPIO_28_O_MSK                                   (((1U<<GLB_REG_GPIO_28_O_LEN)-1)<<GLB_REG_GPIO_28_O_POS)
#define GLB_REG_GPIO_28_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_28_O_LEN)-1)<<GLB_REG_GPIO_28_O_POS))
#define GLB_REG_GPIO_29_O                                       GLB_REG_GPIO_29_O
#define GLB_REG_GPIO_29_O_POS                                   (29U)
#define GLB_REG_GPIO_29_O_LEN                                   (1U)
#define GLB_REG_GPIO_29_O_MSK                                   (((1U<<GLB_REG_GPIO_29_O_LEN)-1)<<GLB_REG_GPIO_29_O_POS)
#define GLB_REG_GPIO_29_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_29_O_LEN)-1)<<GLB_REG_GPIO_29_O_POS))
#define GLB_REG_GPIO_30_O                                       GLB_REG_GPIO_30_O
#define GLB_REG_GPIO_30_O_POS                                   (30U)
#define GLB_REG_GPIO_30_O_LEN                                   (1U)
#define GLB_REG_GPIO_30_O_MSK                                   (((1U<<GLB_REG_GPIO_30_O_LEN)-1)<<GLB_REG_GPIO_30_O_POS)
#define GLB_REG_GPIO_30_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_30_O_LEN)-1)<<GLB_REG_GPIO_30_O_POS))
#define GLB_REG_GPIO_31_O                                       GLB_REG_GPIO_31_O
#define GLB_REG_GPIO_31_O_POS                                   (31U)
#define GLB_REG_GPIO_31_O_LEN                                   (1U)
#define GLB_REG_GPIO_31_O_MSK                                   (((1U<<GLB_REG_GPIO_31_O_LEN)-1)<<GLB_REG_GPIO_31_O_POS)
#define GLB_REG_GPIO_31_O_UMSK                                  (~(((1U<<GLB_REG_GPIO_31_O_LEN)-1)<<GLB_REG_GPIO_31_O_POS))

/* 0x18C : GPIO_CFGCTL33 */
#define GLB_GPIO_CFGCTL33_OFFSET                                (0x18C)

