bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x190 : GPIO_CFGCTL34 */
#define GLB_GPIO_CFGCTL34_OFFSET                                (0x190)
#define GLB_REG_GPIO_0_OE                                       GLB_REG_GPIO_0_OE
#define GLB_REG_GPIO_0_OE_POS                                   (0U)
#define GLB_REG_GPIO_0_OE_LEN                                   (1U)
#define GLB_REG_GPIO_0_OE_MSK                                   (((1U<<GLB_REG_GPIO_0_OE_LEN)-1)<<GLB_REG_GPIO_0_OE_POS)
#define GLB_REG_GPIO_0_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_0_OE_LEN)-1)<<GLB_REG_GPIO_0_OE_POS))
#define GLB_REG_GPIO_1_OE                                       GLB_REG_GPIO_1_OE
#define GLB_REG_GPIO_1_OE_POS                                   (1U)
#define GLB_REG_GPIO_1_OE_LEN                                   (1U)
#define GLB_REG_GPIO_1_OE_MSK                                   (((1U<<GLB_REG_GPIO_1_OE_LEN)-1)<<GLB_REG_GPIO_1_OE_POS)
#define GLB_REG_GPIO_1_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_1_OE_LEN)-1)<<GLB_REG_GPIO_1_OE_POS))
#define GLB_REG_GPIO_2_OE                                       GLB_REG_GPIO_2_OE
#define GLB_REG_GPIO_2_OE_POS                                   (2U)
#define GLB_REG_GPIO_2_OE_LEN                                   (1U)
#define GLB_REG_GPIO_2_OE_MSK                                   (((1U<<GLB_REG_GPIO_2_OE_LEN)-1)<<GLB_REG_GPIO_2_OE_POS)
#define GLB_REG_GPIO_2_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_2_OE_LEN)-1)<<GLB_REG_GPIO_2_OE_POS))
#define GLB_REG_GPIO_3_OE                                       GLB_REG_GPIO_3_OE
#define GLB_REG_GPIO_3_OE_POS                                   (3U)
#define GLB_REG_GPIO_3_OE_LEN                                   (1U)
#define GLB_REG_GPIO_3_OE_MSK                                   (((1U<<GLB_REG_GPIO_3_OE_LEN)-1)<<GLB_REG_GPIO_3_OE_POS)
#define GLB_REG_GPIO_3_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_3_OE_LEN)-1)<<GLB_REG_GPIO_3_OE_POS))
#define GLB_REG_GPIO_7_OE                                       GLB_REG_GPIO_7_OE
#define GLB_REG_GPIO_7_OE_POS                                   (7U)
#define GLB_REG_GPIO_7_OE_LEN                                   (1U)
#define GLB_REG_GPIO_7_OE_MSK                                   (((1U<<GLB_REG_GPIO_7_OE_LEN)-1)<<GLB_REG_GPIO_7_OE_POS)
#define GLB_REG_GPIO_7_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_7_OE_LEN)-1)<<GLB_REG_GPIO_7_OE_POS))
#define GLB_REG_GPIO_8_OE                                       GLB_REG_GPIO_8_OE
#define GLB_REG_GPIO_8_OE_POS                                   (8U)
#define GLB_REG_GPIO_8_OE_LEN                                   (1U)
#define GLB_REG_GPIO_8_OE_MSK                                   (((1U<<GLB_REG_GPIO_8_OE_LEN)-1)<<GLB_REG_GPIO_8_OE_POS)
#define GLB_REG_GPIO_8_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_8_OE_LEN)-1)<<GLB_REG_GPIO_8_OE_POS))
#define GLB_REG_GPIO_9_OE                                       GLB_REG_GPIO_9_OE
#define GLB_REG_GPIO_9_OE_POS                                   (9U)
#define GLB_REG_GPIO_9_OE_LEN                                   (1U)
#define GLB_REG_GPIO_9_OE_MSK                                   (((1U<<GLB_REG_GPIO_9_OE_LEN)-1)<<GLB_REG_GPIO_9_OE_POS)
#define GLB_REG_GPIO_9_OE_UMSK                                  (~(((1U<<GLB_REG_GPIO_9_OE_LEN)-1)<<GLB_REG_GPIO_9_OE_POS))
#define GLB_REG_GPIO_10_OE                                      GLB_REG_GPIO_10_OE
#define GLB_REG_GPIO_10_OE_POS                                  (10U)
#define GLB_REG_GPIO_10_OE_LEN                                  (1U)
#define GLB_REG_GPIO_10_OE_MSK                                  (((1U<<GLB_REG_GPIO_10_OE_LEN)-1)<<GLB_REG_GPIO_10_OE_POS)
#define GLB_REG_GPIO_10_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_10_OE_LEN)-1)<<GLB_REG_GPIO_10_OE_POS))
#define GLB_REG_GPIO_11_OE                                      GLB_REG_GPIO_11_OE
#define GLB_REG_GPIO_11_OE_POS                                  (11U)
#define GLB_REG_GPIO_11_OE_LEN                                  (1U)
#define GLB_REG_GPIO_11_OE_MSK                                  (((1U<<GLB_REG_GPIO_11_OE_LEN)-1)<<GLB_REG_GPIO_11_OE_POS)
#define GLB_REG_GPIO_11_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_11_OE_LEN)-1)<<GLB_REG_GPIO_11_OE_POS))
#define GLB_REG_GPIO_12_OE                                      GLB_REG_GPIO_12_OE
#define GLB_REG_GPIO_12_OE_POS                                  (12U)
#define GLB_REG_GPIO_12_OE_LEN                                  (1U)
#define GLB_REG_GPIO_12_OE_MSK                                  (((1U<<GLB_REG_GPIO_12_OE_LEN)-1)<<GLB_REG_GPIO_12_OE_POS)
#define GLB_REG_GPIO_12_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_12_OE_LEN)-1)<<GLB_REG_GPIO_12_OE_POS))
#define GLB_REG_GPIO_13_OE                                      GLB_REG_GPIO_13_OE
#define GLB_REG_GPIO_13_OE_POS                                  (13U)
#define GLB_REG_GPIO_13_OE_LEN                                  (1U)
#define GLB_REG_GPIO_13_OE_MSK                                  (((1U<<GLB_REG_GPIO_13_OE_LEN)-1)<<GLB_REG_GPIO_13_OE_POS)
#define GLB_REG_GPIO_13_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_13_OE_LEN)-1)<<GLB_REG_GPIO_13_OE_POS))
#define GLB_REG_GPIO_14_OE                                      GLB_REG_GPIO_14_OE
#define GLB_REG_GPIO_14_OE_POS                                  (14U)
#define GLB_REG_GPIO_14_OE_LEN                                  (1U)
#define GLB_REG_GPIO_14_OE_MSK                                  (((1U<<GLB_REG_GPIO_14_OE_LEN)-1)<<GLB_REG_GPIO_14_OE_POS)
#define GLB_REG_GPIO_14_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_14_OE_LEN)-1)<<GLB_REG_GPIO_14_OE_POS))
#define GLB_REG_GPIO_15_OE                                      GLB_REG_GPIO_15_OE
#define GLB_REG_GPIO_15_OE_POS                                  (15U)
#define GLB_REG_GPIO_15_OE_LEN                                  (1U)
#define GLB_REG_GPIO_15_OE_MSK                                  (((1U<<GLB_REG_GPIO_15_OE_LEN)-1)<<GLB_REG_GPIO_15_OE_POS)
#define GLB_REG_GPIO_15_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_15_OE_LEN)-1)<<GLB_REG_GPIO_15_OE_POS))
#define GLB_REG_GPIO_16_OE                                      GLB_REG_GPIO_16_OE
#define GLB_REG_GPIO_16_OE_POS                                  (16U)
#define GLB_REG_GPIO_16_OE_LEN                                  (1U)
#define GLB_REG_GPIO_16_OE_MSK                                  (((1U<<GLB_REG_GPIO_16_OE_LEN)-1)<<GLB_REG_GPIO_16_OE_POS)
#define GLB_REG_GPIO_16_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_16_OE_LEN)-1)<<GLB_REG_GPIO_16_OE_POS))
#define GLB_REG_GPIO_17_OE                                      GLB_REG_GPIO_17_OE
#define GLB_REG_GPIO_17_OE_POS                                  (17U)
#define GLB_REG_GPIO_17_OE_LEN                                  (1U)
#define GLB_REG_GPIO_17_OE_MSK                                  (((1U<<GLB_REG_GPIO_17_OE_LEN)-1)<<GLB_REG_GPIO_17_OE_POS)
#define GLB_REG_GPIO_17_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_17_OE_LEN)-1)<<GLB_REG_GPIO_17_OE_POS))
#define GLB_REG_GPIO_18_OE                                      GLB_REG_GPIO_18_OE
#define GLB_REG_GPIO_18_OE_POS                                  (18U)
#define GLB_REG_GPIO_18_OE_LEN                                  (1U)
#define GLB_REG_GPIO_18_OE_MSK                                  (((1U<<GLB_REG_GPIO_18_OE_LEN)-1)<<GLB_REG_GPIO_18_OE_POS)
#define GLB_REG_GPIO_18_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_18_OE_LEN)-1)<<GLB_REG_GPIO_18_OE_POS))
#define GLB_REG_GPIO_19_OE                                      GLB_REG_GPIO_19_OE
#define GLB_REG_GPIO_19_OE_POS                                  (19U)
#define GLB_REG_GPIO_19_OE_LEN                                  (1U)
#define GLB_REG_GPIO_19_OE_MSK                                  (((1U<<GLB_REG_GPIO_19_OE_LEN)-1)<<GLB_REG_GPIO_19_OE_POS)
#define GLB_REG_GPIO_19_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_19_OE_LEN)-1)<<GLB_REG_GPIO_19_OE_POS))
#define GLB_REG_GPIO_20_OE                                      GLB_REG_GPIO_20_OE
#define GLB_REG_GPIO_20_OE_POS                                  (20U)
#define GLB_REG_GPIO_20_OE_LEN                                  (1U)
#define GLB_REG_GPIO_20_OE_MSK                                  (((1U<<GLB_REG_GPIO_20_OE_LEN)-1)<<GLB_REG_GPIO_20_OE_POS)
#define GLB_REG_GPIO_20_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_20_OE_LEN)-1)<<GLB_REG_GPIO_20_OE_POS))
#define GLB_REG_GPIO_21_OE                                      GLB_REG_GPIO_21_OE
#define GLB_REG_GPIO_21_OE_POS                                  (21U)
#define GLB_REG_GPIO_21_OE_LEN                                  (1U)
#define GLB_REG_GPIO_21_OE_MSK                                  (((1U<<GLB_REG_GPIO_21_OE_LEN)-1)<<GLB_REG_GPIO_21_OE_POS)
#define GLB_REG_GPIO_21_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_21_OE_LEN)-1)<<GLB_REG_GPIO_21_OE_POS))
#define GLB_REG_GPIO_22_OE                                      GLB_REG_GPIO_22_OE
#define GLB_REG_GPIO_22_OE_POS                                  (22U)
#define GLB_REG_GPIO_22_OE_LEN                                  (1U)
#define GLB_REG_GPIO_22_OE_MSK                                  (((1U<<GLB_REG_GPIO_22_OE_LEN)-1)<<GLB_REG_GPIO_22_OE_POS)
#define GLB_REG_GPIO_22_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_22_OE_LEN)-1)<<GLB_REG_GPIO_22_OE_POS))
#define GLB_REG_GPIO_23_OE                                      GLB_REG_GPIO_23_OE
#define GLB_REG_GPIO_23_OE_POS                                  (23U)
#define GLB_REG_GPIO_23_OE_LEN                                  (1U)
#define GLB_REG_GPIO_23_OE_MSK                                  (((1U<<GLB_REG_GPIO_23_OE_LEN)-1)<<GLB_REG_GPIO_23_OE_POS)
#define GLB_REG_GPIO_23_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_23_OE_LEN)-1)<<GLB_REG_GPIO_23_OE_POS))
#define GLB_REG_GPIO_24_OE                                      GLB_REG_GPIO_24_OE
#define GLB_REG_GPIO_24_OE_POS                                  (24U)
#define GLB_REG_GPIO_24_OE_LEN                                  (1U)
#define GLB_REG_GPIO_24_OE_MSK                                  (((1U<<GLB_REG_GPIO_24_OE_LEN)-1)<<GLB_REG_GPIO_24_OE_POS)
#define GLB_REG_GPIO_24_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_24_OE_LEN)-1)<<GLB_REG_GPIO_24_OE_POS))
#define GLB_REG_GPIO_25_OE                                      GLB_REG_GPIO_25_OE
#define GLB_REG_GPIO_25_OE_POS                                  (25U)
#define GLB_REG_GPIO_25_OE_LEN                                  (1U)
#define GLB_REG_GPIO_25_OE_MSK                                  (((1U<<GLB_REG_GPIO_25_OE_LEN)-1)<<GLB_REG_GPIO_25_OE_POS)
#define GLB_REG_GPIO_25_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_25_OE_LEN)-1)<<GLB_REG_GPIO_25_OE_POS))
#define GLB_REG_GPIO_26_OE                                      GLB_REG_GPIO_26_OE
#define GLB_REG_GPIO_26_OE_POS                                  (26U)
#define GLB_REG_GPIO_26_OE_LEN                                  (1U)
#define GLB_REG_GPIO_26_OE_MSK                                  (((1U<<GLB_REG_GPIO_26_OE_LEN)-1)<<GLB_REG_GPIO_26_OE_POS)
#define GLB_REG_GPIO_26_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_26_OE_LEN)-1)<<GLB_REG_GPIO_26_OE_POS))
#define GLB_REG_GPIO_27_OE                                      GLB_REG_GPIO_27_OE
#define GLB_REG_GPIO_27_OE_POS                                  (27U)
#define GLB_REG_GPIO_27_OE_LEN                                  (1U)
#define GLB_REG_GPIO_27_OE_MSK                                  (((1U<<GLB_REG_GPIO_27_OE_LEN)-1)<<GLB_REG_GPIO_27_OE_POS)
#define GLB_REG_GPIO_27_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_27_OE_LEN)-1)<<GLB_REG_GPIO_27_OE_POS))
#define GLB_REG_GPIO_28_OE                                      GLB_REG_GPIO_28_OE
#define GLB_REG_GPIO_28_OE_POS                                  (28U)
#define GLB_REG_GPIO_28_OE_LEN                                  (1U)
#define GLB_REG_GPIO_28_OE_MSK                                  (((1U<<GLB_REG_GPIO_28_OE_LEN)-1)<<GLB_REG_GPIO_28_OE_POS)
#define GLB_REG_GPIO_28_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_28_OE_LEN)-1)<<GLB_REG_GPIO_28_OE_POS))
#define GLB_REG_GPIO_29_OE                                      GLB_REG_GPIO_29_OE
#define GLB_REG_GPIO_29_OE_POS                                  (29U)
#define GLB_REG_GPIO_29_OE_LEN                                  (1U)
#define GLB_REG_GPIO_29_OE_MSK                                  (((1U<<GLB_REG_GPIO_29_OE_LEN)-1)<<GLB_REG_GPIO_29_OE_POS)
#define GLB_REG_GPIO_29_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_29_OE_LEN)-1)<<GLB_REG_GPIO_29_OE_POS))
#define GLB_REG_GPIO_30_OE                                      GLB_REG_GPIO_30_OE
#define GLB_REG_GPIO_30_OE_POS                                  (30U)
#define GLB_REG_GPIO_30_OE_LEN                                  (1U)
#define GLB_REG_GPIO_30_OE_MSK                                  (((1U<<GLB_REG_GPIO_30_OE_LEN)-1)<<GLB_REG_GPIO_30_OE_POS)
#define GLB_REG_GPIO_30_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_30_OE_LEN)-1)<<GLB_REG_GPIO_30_OE_POS))
#define GLB_REG_GPIO_31_OE                                      GLB_REG_GPIO_31_OE
#define GLB_REG_GPIO_31_OE_POS                                  (31U)
#define GLB_REG_GPIO_31_OE_LEN                                  (1U)
#define GLB_REG_GPIO_31_OE_MSK                                  (((1U<<GLB_REG_GPIO_31_OE_LEN)-1)<<GLB_REG_GPIO_31_OE_POS)
#define GLB_REG_GPIO_31_OE_UMSK                                 (~(((1U<<GLB_REG_GPIO_31_OE_LEN)-1)<<GLB_REG_GPIO_31_OE_POS))

