bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x194 : GPIO_CFGCTL35 */
#define GLB_GPIO_CFGCTL35_OFFSET                                (0x194)
#define GLB_REG_GPIO_0_SET                                      GLB_REG_GPIO_0_SET
#define GLB_REG_GPIO_0_SET_POS                                  (0U)
#define GLB_REG_GPIO_0_SET_LEN                                  (1U)
#define GLB_REG_GPIO_0_SET_MSK                                  (((1U<<GLB_REG_GPIO_0_SET_LEN)-1)<<GLB_REG_GPIO_0_SET_POS)
#define GLB_REG_GPIO_0_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_0_SET_LEN)-1)<<GLB_REG_GPIO_0_SET_POS))
#define GLB_REG_GPIO_1_SET                                      GLB_REG_GPIO_1_SET
#define GLB_REG_GPIO_1_SET_POS                                  (1U)
#define GLB_REG_GPIO_1_SET_LEN                                  (1U)
#define GLB_REG_GPIO_1_SET_MSK                                  (((1U<<GLB_REG_GPIO_1_SET_LEN)-1)<<GLB_REG_GPIO_1_SET_POS)
#define GLB_REG_GPIO_1_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_1_SET_LEN)-1)<<GLB_REG_GPIO_1_SET_POS))
#define GLB_REG_GPIO_2_SET                                      GLB_REG_GPIO_2_SET
#define GLB_REG_GPIO_2_SET_POS                                  (2U)
#define GLB_REG_GPIO_2_SET_LEN                                  (1U)
#define GLB_REG_GPIO_2_SET_MSK                                  (((1U<<GLB_REG_GPIO_2_SET_LEN)-1)<<GLB_REG_GPIO_2_SET_POS)
#define GLB_REG_GPIO_2_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_2_SET_LEN)-1)<<GLB_REG_GPIO_2_SET_POS))
#define GLB_REG_GPIO_3_SET                                      GLB_REG_GPIO_3_SET
#define GLB_REG_GPIO_3_SET_POS                                  (3U)
#define GLB_REG_GPIO_3_SET_LEN                                  (1U)
#define GLB_REG_GPIO_3_SET_MSK                                  (((1U<<GLB_REG_GPIO_3_SET_LEN)-1)<<GLB_REG_GPIO_3_SET_POS)
#define GLB_REG_GPIO_3_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_3_SET_LEN)-1)<<GLB_REG_GPIO_3_SET_POS))
#define GLB_REG_GPIO_7_SET                                      GLB_REG_GPIO_7_SET
#define GLB_REG_GPIO_7_SET_POS                                  (7U)
#define GLB_REG_GPIO_7_SET_LEN                                  (1U)
#define GLB_REG_GPIO_7_SET_MSK                                  (((1U<<GLB_REG_GPIO_7_SET_LEN)-1)<<GLB_REG_GPIO_7_SET_POS)
#define GLB_REG_GPIO_7_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_7_SET_LEN)-1)<<GLB_REG_GPIO_7_SET_POS))
#define GLB_REG_GPIO_8_SET                                      GLB_REG_GPIO_8_SET
#define GLB_REG_GPIO_8_SET_POS                                  (8U)
#define GLB_REG_GPIO_8_SET_LEN                                  (1U)
#define GLB_REG_GPIO_8_SET_MSK                                  (((1U<<GLB_REG_GPIO_8_SET_LEN)-1)<<GLB_REG_GPIO_8_SET_POS)
#define GLB_REG_GPIO_8_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_8_SET_LEN)-1)<<GLB_REG_GPIO_8_SET_POS))
#define GLB_REG_GPIO_9_SET                                      GLB_REG_GPIO_9_SET
#define GLB_REG_GPIO_9_SET_POS                                  (9U)
#define GLB_REG_GPIO_9_SET_LEN                                  (1U)
#define GLB_REG_GPIO_9_SET_MSK                                  (((1U<<GLB_REG_GPIO_9_SET_LEN)-1)<<GLB_REG_GPIO_9_SET_POS)
#define GLB_REG_GPIO_9_SET_UMSK                                 (~(((1U<<GLB_REG_GPIO_9_SET_LEN)-1)<<GLB_REG_GPIO_9_SET_POS))
#define GLB_REG_GPIO_10_SET                                     GLB_REG_GPIO_10_SET
#define GLB_REG_GPIO_10_SET_POS                                 (10U)
#define GLB_REG_GPIO_10_SET_LEN                                 (1U)
#define GLB_REG_GPIO_10_SET_MSK                                 (((1U<<GLB_REG_GPIO_10_SET_LEN)-1)<<GLB_REG_GPIO_10_SET_POS)
#define GLB_REG_GPIO_10_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_10_SET_LEN)-1)<<GLB_REG_GPIO_10_SET_POS))
#define GLB_REG_GPIO_11_SET                                     GLB_REG_GPIO_11_SET
#define GLB_REG_GPIO_11_SET_POS                                 (11U)
#define GLB_REG_GPIO_11_SET_LEN                                 (1U)
#define GLB_REG_GPIO_11_SET_MSK                                 (((1U<<GLB_REG_GPIO_11_SET_LEN)-1)<<GLB_REG_GPIO_11_SET_POS)
#define GLB_REG_GPIO_11_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_11_SET_LEN)-1)<<GLB_REG_GPIO_11_SET_POS))
#define GLB_REG_GPIO_12_SET                                     GLB_REG_GPIO_12_SET
#define GLB_REG_GPIO_12_SET_POS                                 (12U)
#define GLB_REG_GPIO_12_SET_LEN                                 (1U)
#define GLB_REG_GPIO_12_SET_MSK                                 (((1U<<GLB_REG_GPIO_12_SET_LEN)-1)<<GLB_REG_GPIO_12_SET_POS)
#define GLB_REG_GPIO_12_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_12_SET_LEN)-1)<<GLB_REG_GPIO_12_SET_POS))
#define GLB_REG_GPIO_13_SET                                     GLB_REG_GPIO_13_SET
#define GLB_REG_GPIO_13_SET_POS                                 (13U)
#define GLB_REG_GPIO_13_SET_LEN                                 (1U)
#define GLB_REG_GPIO_13_SET_MSK                                 (((1U<<GLB_REG_GPIO_13_SET_LEN)-1)<<GLB_REG_GPIO_13_SET_POS)
#define GLB_REG_GPIO_13_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_13_SET_LEN)-1)<<GLB_REG_GPIO_13_SET_POS))
#define GLB_REG_GPIO_14_SET                                     GLB_REG_GPIO_14_SET
#define GLB_REG_GPIO_14_SET_POS                                 (14U)
#define GLB_REG_GPIO_14_SET_LEN                                 (1U)
#define GLB_REG_GPIO_14_SET_MSK                                 (((1U<<GLB_REG_GPIO_14_SET_LEN)-1)<<GLB_REG_GPIO_14_SET_POS)
#define GLB_REG_GPIO_14_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_14_SET_LEN)-1)<<GLB_REG_GPIO_14_SET_POS))
#define GLB_REG_GPIO_15_SET                                     GLB_REG_GPIO_15_SET
#define GLB_REG_GPIO_15_SET_POS                                 (15U)
#define GLB_REG_GPIO_15_SET_LEN                                 (1U)
#define GLB_REG_GPIO_15_SET_MSK                                 (((1U<<GLB_REG_GPIO_15_SET_LEN)-1)<<GLB_REG_GPIO_15_SET_POS)
#define GLB_REG_GPIO_15_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_15_SET_LEN)-1)<<GLB_REG_GPIO_15_SET_POS))
#define GLB_REG_GPIO_16_SET                                     GLB_REG_GPIO_16_SET
#define GLB_REG_GPIO_16_SET_POS                                 (16U)
#define GLB_REG_GPIO_16_SET_LEN                                 (1U)
#define GLB_REG_GPIO_16_SET_MSK                                 (((1U<<GLB_REG_GPIO_16_SET_LEN)-1)<<GLB_REG_GPIO_16_SET_POS)
#define GLB_REG_GPIO_16_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_16_SET_LEN)-1)<<GLB_REG_GPIO_16_SET_POS))
#define GLB_REG_GPIO_17_SET                                     GLB_REG_GPIO_17_SET
#define GLB_REG_GPIO_17_SET_POS                                 (17U)
#define GLB_REG_GPIO_17_SET_LEN                                 (1U)
#define GLB_REG_GPIO_17_SET_MSK                                 (((1U<<GLB_REG_GPIO_17_SET_LEN)-1)<<GLB_REG_GPIO_17_SET_POS)
#define GLB_REG_GPIO_17_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_17_SET_LEN)-1)<<GLB_REG_GPIO_17_SET_POS))
#define GLB_REG_GPIO_18_SET                                     GLB_REG_GPIO_18_SET
#define GLB_REG_GPIO_18_SET_POS                                 (18U)
#define GLB_REG_GPIO_18_SET_LEN                                 (1U)
#define GLB_REG_GPIO_18_SET_MSK                                 (((1U<<GLB_REG_GPIO_18_SET_LEN)-1)<<GLB_REG_GPIO_18_SET_POS)
#define GLB_REG_GPIO_18_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_18_SET_LEN)-1)<<GLB_REG_GPIO_18_SET_POS))
#define GLB_REG_GPIO_19_SET                                     GLB_REG_GPIO_19_SET
#define GLB_REG_GPIO_19_SET_POS                                 (19U)
#define GLB_REG_GPIO_19_SET_LEN                                 (1U)
#define GLB_REG_GPIO_19_SET_MSK                                 (((1U<<GLB_REG_GPIO_19_SET_LEN)-1)<<GLB_REG_GPIO_19_SET_POS)
#define GLB_REG_GPIO_19_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_19_SET_LEN)-1)<<GLB_REG_GPIO_19_SET_POS))
#define GLB_REG_GPIO_20_SET                                     GLB_REG_GPIO_20_SET
#define GLB_REG_GPIO_20_SET_POS                                 (20U)
#define GLB_REG_GPIO_20_SET_LEN                                 (1U)
#define GLB_REG_GPIO_20_SET_MSK                                 (((1U<<GLB_REG_GPIO_20_SET_LEN)-1)<<GLB_REG_GPIO_20_SET_POS)
#define GLB_REG_GPIO_20_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_20_SET_LEN)-1)<<GLB_REG_GPIO_20_SET_POS))
#define GLB_REG_GPIO_21_SET                                     GLB_REG_GPIO_21_SET
#define GLB_REG_GPIO_21_SET_POS                                 (21U)
#define GLB_REG_GPIO_21_SET_LEN                                 (1U)
#define GLB_REG_GPIO_21_SET_MSK                                 (((1U<<GLB_REG_GPIO_21_SET_LEN)-1)<<GLB_REG_GPIO_21_SET_POS)
#define GLB_REG_GPIO_21_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_21_SET_LEN)-1)<<GLB_REG_GPIO_21_SET_POS))
#define GLB_REG_GPIO_22_SET                                     GLB_REG_GPIO_22_SET
#define GLB_REG_GPIO_22_SET_POS                                 (22U)
#define GLB_REG_GPIO_22_SET_LEN                                 (1U)
#define GLB_REG_GPIO_22_SET_MSK                                 (((1U<<GLB_REG_GPIO_22_SET_LEN)-1)<<GLB_REG_GPIO_22_SET_POS)
#define GLB_REG_GPIO_22_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_22_SET_LEN)-1)<<GLB_REG_GPIO_22_SET_POS))
#define GLB_REG_GPIO_23_SET                                     GLB_REG_GPIO_23_SET
#define GLB_REG_GPIO_23_SET_POS                                 (23U)
#define GLB_REG_GPIO_23_SET_LEN                                 (1U)
#define GLB_REG_GPIO_23_SET_MSK                                 (((1U<<GLB_REG_GPIO_23_SET_LEN)-1)<<GLB_REG_GPIO_23_SET_POS)
#define GLB_REG_GPIO_23_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_23_SET_LEN)-1)<<GLB_REG_GPIO_23_SET_POS))
#define GLB_REG_GPIO_24_SET                                     GLB_REG_GPIO_24_SET
#define GLB_REG_GPIO_24_SET_POS                                 (24U)
#define GLB_REG_GPIO_24_SET_LEN                                 (1U)
#define GLB_REG_GPIO_24_SET_MSK                                 (((1U<<GLB_REG_GPIO_24_SET_LEN)-1)<<GLB_REG_GPIO_24_SET_POS)
#define GLB_REG_GPIO_24_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_24_SET_LEN)-1)<<GLB_REG_GPIO_24_SET_POS))
#define GLB_REG_GPIO_25_SET                                     GLB_REG_GPIO_25_SET
#define GLB_REG_GPIO_25_SET_POS                                 (25U)
#define GLB_REG_GPIO_25_SET_LEN                                 (1U)
#define GLB_REG_GPIO_25_SET_MSK                                 (((1U<<GLB_REG_GPIO_25_SET_LEN)-1)<<GLB_REG_GPIO_25_SET_POS)
#define GLB_REG_GPIO_25_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_25_SET_LEN)-1)<<GLB_REG_GPIO_25_SET_POS))
#define GLB_REG_GPIO_26_SET                                     GLB_REG_GPIO_26_SET
#define GLB_REG_GPIO_26_SET_POS                                 (26U)
#define GLB_REG_GPIO_26_SET_LEN                                 (1U)
#define GLB_REG_GPIO_26_SET_MSK                                 (((1U<<GLB_REG_GPIO_26_SET_LEN)-1)<<GLB_REG_GPIO_26_SET_POS)
#define GLB_REG_GPIO_26_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_26_SET_LEN)-1)<<GLB_REG_GPIO_26_SET_POS))
#define GLB_REG_GPIO_27_SET                                     GLB_REG_GPIO_27_SET
#define GLB_REG_GPIO_27_SET_POS                                 (27U)
#define GLB_REG_GPIO_27_SET_LEN                                 (1U)
#define GLB_REG_GPIO_27_SET_MSK                                 (((1U<<GLB_REG_GPIO_27_SET_LEN)-1)<<GLB_REG_GPIO_27_SET_POS)
#define GLB_REG_GPIO_27_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_27_SET_LEN)-1)<<GLB_REG_GPIO_27_SET_POS))
#define GLB_REG_GPIO_28_SET                                     GLB_REG_GPIO_28_SET
#define GLB_REG_GPIO_28_SET_POS                                 (28U)
#define GLB_REG_GPIO_28_SET_LEN                                 (1U)
#define GLB_REG_GPIO_28_SET_MSK                                 (((1U<<GLB_REG_GPIO_28_SET_LEN)-1)<<GLB_REG_GPIO_28_SET_POS)
#define GLB_REG_GPIO_28_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_28_SET_LEN)-1)<<GLB_REG_GPIO_28_SET_POS))
#define GLB_REG_GPIO_29_SET                                     GLB_REG_GPIO_29_SET
#define GLB_REG_GPIO_29_SET_POS                                 (29U)
#define GLB_REG_GPIO_29_SET_LEN                                 (1U)
#define GLB_REG_GPIO_29_SET_MSK                                 (((1U<<GLB_REG_GPIO_29_SET_LEN)-1)<<GLB_REG_GPIO_29_SET_POS)
#define GLB_REG_GPIO_29_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_29_SET_LEN)-1)<<GLB_REG_GPIO_29_SET_POS))
#define GLB_REG_GPIO_30_SET                                     GLB_REG_GPIO_30_SET
#define GLB_REG_GPIO_30_SET_POS                                 (30U)
#define GLB_REG_GPIO_30_SET_LEN                                 (1U)
#define GLB_REG_GPIO_30_SET_MSK                                 (((1U<<GLB_REG_GPIO_30_SET_LEN)-1)<<GLB_REG_GPIO_30_SET_POS)
#define GLB_REG_GPIO_30_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_30_SET_LEN)-1)<<GLB_REG_GPIO_30_SET_POS))
#define GLB_REG_GPIO_31_SET                                     GLB_REG_GPIO_31_SET
#define GLB_REG_GPIO_31_SET_POS                                 (31U)
#define GLB_REG_GPIO_31_SET_LEN                                 (1U)
#define GLB_REG_GPIO_31_SET_MSK                                 (((1U<<GLB_REG_GPIO_31_SET_LEN)-1)<<GLB_REG_GPIO_31_SET_POS)
#define GLB_REG_GPIO_31_SET_UMSK                                (~(((1U<<GLB_REG_GPIO_31_SET_LEN)-1)<<GLB_REG_GPIO_31_SET_POS))

