bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x1A0 : GPIO_INT_MASK1 */
#define GLB_GPIO_INT_MASK1_OFFSET                               (0x1A0)
#define GLB_REG_GPIO0_INT_MASK                                  GLB_REG_GPIO0_INT_MASK
#define GLB_REG_GPIO0_INT_MASK_POS                              (0U)
#define GLB_REG_GPIO0_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO0_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO0_INT_MASK_LEN)-1)<<GLB_REG_GPIO0_INT_MASK_POS)
#define GLB_REG_GPIO0_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO0_INT_MASK_LEN)-1)<<GLB_REG_GPIO0_INT_MASK_POS))
#define GLB_REG_GPIO1_INT_MASK                                  GLB_REG_GPIO1_INT_MASK
#define GLB_REG_GPIO1_INT_MASK_POS                              (1U)
#define GLB_REG_GPIO1_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO1_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO1_INT_MASK_LEN)-1)<<GLB_REG_GPIO1_INT_MASK_POS)
#define GLB_REG_GPIO1_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO1_INT_MASK_LEN)-1)<<GLB_REG_GPIO1_INT_MASK_POS))
#define GLB_REG_GPIO2_INT_MASK                                  GLB_REG_GPIO2_INT_MASK
#define GLB_REG_GPIO2_INT_MASK_POS                              (2U)
#define GLB_REG_GPIO2_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO2_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO2_INT_MASK_LEN)-1)<<GLB_REG_GPIO2_INT_MASK_POS)
#define GLB_REG_GPIO2_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO2_INT_MASK_LEN)-1)<<GLB_REG_GPIO2_INT_MASK_POS))
#define GLB_REG_GPIO3_INT_MASK                                  GLB_REG_GPIO3_INT_MASK
#define GLB_REG_GPIO3_INT_MASK_POS                              (3U)
#define GLB_REG_GPIO3_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO3_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO3_INT_MASK_LEN)-1)<<GLB_REG_GPIO3_INT_MASK_POS)
#define GLB_REG_GPIO3_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO3_INT_MASK_LEN)-1)<<GLB_REG_GPIO3_INT_MASK_POS))
#define GLB_REG_GPIO7_INT_MASK                                  GLB_REG_GPIO7_INT_MASK
#define GLB_REG_GPIO7_INT_MASK_POS                              (7U)
#define GLB_REG_GPIO7_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO7_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO7_INT_MASK_LEN)-1)<<GLB_REG_GPIO7_INT_MASK_POS)
#define GLB_REG_GPIO7_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO7_INT_MASK_LEN)-1)<<GLB_REG_GPIO7_INT_MASK_POS))
#define GLB_REG_GPIO8_INT_MASK                                  GLB_REG_GPIO8_INT_MASK
#define GLB_REG_GPIO8_INT_MASK_POS                              (8U)
#define GLB_REG_GPIO8_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO8_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO8_INT_MASK_LEN)-1)<<GLB_REG_GPIO8_INT_MASK_POS)
#define GLB_REG_GPIO8_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO8_INT_MASK_LEN)-1)<<GLB_REG_GPIO8_INT_MASK_POS))
#define GLB_REG_GPIO9_INT_MASK                                  GLB_REG_GPIO9_INT_MASK
#define GLB_REG_GPIO9_INT_MASK_POS                              (9U)
#define GLB_REG_GPIO9_INT_MASK_LEN                              (1U)
#define GLB_REG_GPIO9_INT_MASK_MSK                              (((1U<<GLB_REG_GPIO9_INT_MASK_LEN)-1)<<GLB_REG_GPIO9_INT_MASK_POS)
#define GLB_REG_GPIO9_INT_MASK_UMSK                             (~(((1U<<GLB_REG_GPIO9_INT_MASK_LEN)-1)<<GLB_REG_GPIO9_INT_MASK_POS))
#define GLB_REG_GPIO10_INT_MASK                                 GLB_REG_GPIO10_INT_MASK
#define GLB_REG_GPIO10_INT_MASK_POS                             (10U)
#define GLB_REG_GPIO10_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO10_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO10_INT_MASK_LEN)-1)<<GLB_REG_GPIO10_INT_MASK_POS)
#define GLB_REG_GPIO10_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO10_INT_MASK_LEN)-1)<<GLB_REG_GPIO10_INT_MASK_POS))
#define GLB_REG_GPIO11_INT_MASK                                 GLB_REG_GPIO11_INT_MASK
#define GLB_REG_GPIO11_INT_MASK_POS                             (11U)
#define GLB_REG_GPIO11_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO11_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO11_INT_MASK_LEN)-1)<<GLB_REG_GPIO11_INT_MASK_POS)
#define GLB_REG_GPIO11_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO11_INT_MASK_LEN)-1)<<GLB_REG_GPIO11_INT_MASK_POS))
#define GLB_REG_GPIO12_INT_MASK                                 GLB_REG_GPIO12_INT_MASK
#define GLB_REG_GPIO12_INT_MASK_POS                             (12U)
#define GLB_REG_GPIO12_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO12_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO12_INT_MASK_LEN)-1)<<GLB_REG_GPIO12_INT_MASK_POS)
#define GLB_REG_GPIO12_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO12_INT_MASK_LEN)-1)<<GLB_REG_GPIO12_INT_MASK_POS))
#define GLB_REG_GPIO13_INT_MASK                                 GLB_REG_GPIO13_INT_MASK
#define GLB_REG_GPIO13_INT_MASK_POS                             (13U)
#define GLB_REG_GPIO13_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO13_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO13_INT_MASK_LEN)-1)<<GLB_REG_GPIO13_INT_MASK_POS)
#define GLB_REG_GPIO13_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO13_INT_MASK_LEN)-1)<<GLB_REG_GPIO13_INT_MASK_POS))
#define GLB_REG_GPIO14_INT_MASK                                 GLB_REG_GPIO14_INT_MASK
#define GLB_REG_GPIO14_INT_MASK_POS                             (14U)
#define GLB_REG_GPIO14_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO14_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO14_INT_MASK_LEN)-1)<<GLB_REG_GPIO14_INT_MASK_POS)
#define GLB_REG_GPIO14_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO14_INT_MASK_LEN)-1)<<GLB_REG_GPIO14_INT_MASK_POS))
#define GLB_REG_GPIO15_INT_MASK                                 GLB_REG_GPIO15_INT_MASK
#define GLB_REG_GPIO15_INT_MASK_POS                             (15U)
#define GLB_REG_GPIO15_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO15_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO15_INT_MASK_LEN)-1)<<GLB_REG_GPIO15_INT_MASK_POS)
#define GLB_REG_GPIO15_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO15_INT_MASK_LEN)-1)<<GLB_REG_GPIO15_INT_MASK_POS))
#define GLB_REG_GPIO16_INT_MASK                                 GLB_REG_GPIO16_INT_MASK
#define GLB_REG_GPIO16_INT_MASK_POS                             (16U)
#define GLB_REG_GPIO16_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO16_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO16_INT_MASK_LEN)-1)<<GLB_REG_GPIO16_INT_MASK_POS)
#define GLB_REG_GPIO16_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO16_INT_MASK_LEN)-1)<<GLB_REG_GPIO16_INT_MASK_POS))
#define GLB_REG_GPIO17_INT_MASK                                 GLB_REG_GPIO17_INT_MASK
#define GLB_REG_GPIO17_INT_MASK_POS                             (17U)
#define GLB_REG_GPIO17_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO17_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO17_INT_MASK_LEN)-1)<<GLB_REG_GPIO17_INT_MASK_POS)
#define GLB_REG_GPIO17_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO17_INT_MASK_LEN)-1)<<GLB_REG_GPIO17_INT_MASK_POS))
#define GLB_REG_GPIO18_INT_MASK                                 GLB_REG_GPIO18_INT_MASK
#define GLB_REG_GPIO18_INT_MASK_POS                             (18U)
#define GLB_REG_GPIO18_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO18_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO18_INT_MASK_LEN)-1)<<GLB_REG_GPIO18_INT_MASK_POS)
#define GLB_REG_GPIO18_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO18_INT_MASK_LEN)-1)<<GLB_REG_GPIO18_INT_MASK_POS))
#define GLB_REG_GPIO19_INT_MASK                                 GLB_REG_GPIO19_INT_MASK
#define GLB_REG_GPIO19_INT_MASK_POS                             (19U)
#define GLB_REG_GPIO19_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO19_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO19_INT_MASK_LEN)-1)<<GLB_REG_GPIO19_INT_MASK_POS)
#define GLB_REG_GPIO19_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO19_INT_MASK_LEN)-1)<<GLB_REG_GPIO19_INT_MASK_POS))
#define GLB_REG_GPIO20_INT_MASK                                 GLB_REG_GPIO20_INT_MASK
#define GLB_REG_GPIO20_INT_MASK_POS                             (20U)
#define GLB_REG_GPIO20_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO20_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO20_INT_MASK_LEN)-1)<<GLB_REG_GPIO20_INT_MASK_POS)
#define GLB_REG_GPIO20_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO20_INT_MASK_LEN)-1)<<GLB_REG_GPIO20_INT_MASK_POS))
#define GLB_REG_GPIO21_INT_MASK                                 GLB_REG_GPIO21_INT_MASK
#define GLB_REG_GPIO21_INT_MASK_POS                             (21U)
#define GLB_REG_GPIO21_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO21_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO21_INT_MASK_LEN)-1)<<GLB_REG_GPIO21_INT_MASK_POS)
#define GLB_REG_GPIO21_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO21_INT_MASK_LEN)-1)<<GLB_REG_GPIO21_INT_MASK_POS))
#define GLB_REG_GPIO22_INT_MASK                                 GLB_REG_GPIO22_INT_MASK
#define GLB_REG_GPIO22_INT_MASK_POS                             (22U)
#define GLB_REG_GPIO22_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO22_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO22_INT_MASK_LEN)-1)<<GLB_REG_GPIO22_INT_MASK_POS)
#define GLB_REG_GPIO22_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO22_INT_MASK_LEN)-1)<<GLB_REG_GPIO22_INT_MASK_POS))
#define GLB_REG_GPIO23_INT_MASK                                 GLB_REG_GPIO23_INT_MASK
#define GLB_REG_GPIO23_INT_MASK_POS                             (23U)
#define GLB_REG_GPIO23_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO23_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO23_INT_MASK_LEN)-1)<<GLB_REG_GPIO23_INT_MASK_POS)
#define GLB_REG_GPIO23_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO23_INT_MASK_LEN)-1)<<GLB_REG_GPIO23_INT_MASK_POS))
#define GLB_REG_GPIO24_INT_MASK                                 GLB_REG_GPIO24_INT_MASK
#define GLB_REG_GPIO24_INT_MASK_POS                             (24U)
#define GLB_REG_GPIO24_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO24_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO24_INT_MASK_LEN)-1)<<GLB_REG_GPIO24_INT_MASK_POS)
#define GLB_REG_GPIO24_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO24_INT_MASK_LEN)-1)<<GLB_REG_GPIO24_INT_MASK_POS))
#define GLB_REG_GPIO25_INT_MASK                                 GLB_REG_GPIO25_INT_MASK
#define GLB_REG_GPIO25_INT_MASK_POS                             (25U)
#define GLB_REG_GPIO25_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO25_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO25_INT_MASK_LEN)-1)<<GLB_REG_GPIO25_INT_MASK_POS)
#define GLB_REG_GPIO25_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO25_INT_MASK_LEN)-1)<<GLB_REG_GPIO25_INT_MASK_POS))
#define GLB_REG_GPIO26_INT_MASK                                 GLB_REG_GPIO26_INT_MASK
#define GLB_REG_GPIO26_INT_MASK_POS                             (26U)
#define GLB_REG_GPIO26_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO26_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO26_INT_MASK_LEN)-1)<<GLB_REG_GPIO26_INT_MASK_POS)
#define GLB_REG_GPIO26_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO26_INT_MASK_LEN)-1)<<GLB_REG_GPIO26_INT_MASK_POS))
#define GLB_REG_GPIO27_INT_MASK                                 GLB_REG_GPIO27_INT_MASK
#define GLB_REG_GPIO27_INT_MASK_POS                             (27U)
#define GLB_REG_GPIO27_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO27_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO27_INT_MASK_LEN)-1)<<GLB_REG_GPIO27_INT_MASK_POS)
#define GLB_REG_GPIO27_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO27_INT_MASK_LEN)-1)<<GLB_REG_GPIO27_INT_MASK_POS))
#define GLB_REG_GPIO28_INT_MASK                                 GLB_REG_GPIO28_INT_MASK
#define GLB_REG_GPIO28_INT_MASK_POS                             (28U)
#define GLB_REG_GPIO28_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO28_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO28_INT_MASK_LEN)-1)<<GLB_REG_GPIO28_INT_MASK_POS)
#define GLB_REG_GPIO28_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO28_INT_MASK_LEN)-1)<<GLB_REG_GPIO28_INT_MASK_POS))
#define GLB_REG_GPIO29_INT_MASK                                 GLB_REG_GPIO29_INT_MASK
#define GLB_REG_GPIO29_INT_MASK_POS                             (29U)
#define GLB_REG_GPIO29_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO29_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO29_INT_MASK_LEN)-1)<<GLB_REG_GPIO29_INT_MASK_POS)
#define GLB_REG_GPIO29_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO29_INT_MASK_LEN)-1)<<GLB_REG_GPIO29_INT_MASK_POS))
#define GLB_REG_GPIO30_INT_MASK                                 GLB_REG_GPIO30_INT_MASK
#define GLB_REG_GPIO30_INT_MASK_POS                             (30U)
#define GLB_REG_GPIO30_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO30_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO30_INT_MASK_LEN)-1)<<GLB_REG_GPIO30_INT_MASK_POS)
#define GLB_REG_GPIO30_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO30_INT_MASK_LEN)-1)<<GLB_REG_GPIO30_INT_MASK_POS))
#define GLB_REG_GPIO31_INT_MASK                                 GLB_REG_GPIO31_INT_MASK
#define GLB_REG_GPIO31_INT_MASK_POS                             (31U)
#define GLB_REG_GPIO31_INT_MASK_LEN                             (1U)
#define GLB_REG_GPIO31_INT_MASK_MSK                             (((1U<<GLB_REG_GPIO31_INT_MASK_LEN)-1)<<GLB_REG_GPIO31_INT_MASK_POS)
#define GLB_REG_GPIO31_INT_MASK_UMSK                            (~(((1U<<GLB_REG_GPIO31_INT_MASK_LEN)-1)<<GLB_REG_GPIO31_INT_MASK_POS))

/* 0x1A8 : GPIO_INT_STAT1 */
#define GLB_GPIO_INT_STAT1_OFFSET                               (0x1A8)
#define GLB_GPIO_INT_STAT1                                      GLB_GPIO_INT_STAT1
#define GLB_GPIO_INT_STAT1_POS                                  (0U)
#define GLB_GPIO_INT_STAT1_LEN                                  (32U)
#define GLB_GPIO_INT_STAT1_MSK                                  (((1U<<GLB_GPIO_INT_STAT1_LEN)-1)<<GLB_GPIO_INT_STAT1_POS)
#define GLB_GPIO_INT_STAT1_UMSK                                 (~(((1U<<GLB_GPIO_INT_STAT1_LEN)-1)<<GLB_GPIO_INT_STAT1_POS))

