bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x1B0 : GPIO_INT_CLR1 */
#define GLB_GPIO_INT_CLR1_OFFSET                                (0x1B0)
#define GLB_REG_GPIO0_INT_CLR                                   GLB_REG_GPIO0_INT_CLR
#define GLB_REG_GPIO0_INT_CLR_POS                               (0U)
#define GLB_REG_GPIO0_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO0_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO0_INT_CLR_LEN)-1)<<GLB_REG_GPIO0_INT_CLR_POS)
#define GLB_REG_GPIO0_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO0_INT_CLR_LEN)-1)<<GLB_REG_GPIO0_INT_CLR_POS))
#define GLB_REG_GPIO1_INT_CLR                                   GLB_REG_GPIO1_INT_CLR
#define GLB_REG_GPIO1_INT_CLR_POS                               (1U)
#define GLB_REG_GPIO1_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO1_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO1_INT_CLR_LEN)-1)<<GLB_REG_GPIO1_INT_CLR_POS)
#define GLB_REG_GPIO1_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO1_INT_CLR_LEN)-1)<<GLB_REG_GPIO1_INT_CLR_POS))
#define GLB_REG_GPIO2_INT_CLR                                   GLB_REG_GPIO2_INT_CLR
#define GLB_REG_GPIO2_INT_CLR_POS                               (2U)
#define GLB_REG_GPIO2_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO2_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO2_INT_CLR_LEN)-1)<<GLB_REG_GPIO2_INT_CLR_POS)
#define GLB_REG_GPIO2_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO2_INT_CLR_LEN)-1)<<GLB_REG_GPIO2_INT_CLR_POS))
#define GLB_REG_GPIO3_INT_CLR                                   GLB_REG_GPIO3_INT_CLR
#define GLB_REG_GPIO3_INT_CLR_POS                               (3U)
#define GLB_REG_GPIO3_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO3_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO3_INT_CLR_LEN)-1)<<GLB_REG_GPIO3_INT_CLR_POS)
#define GLB_REG_GPIO3_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO3_INT_CLR_LEN)-1)<<GLB_REG_GPIO3_INT_CLR_POS))
#define GLB_REG_GPIO7_INT_CLR                                   GLB_REG_GPIO7_INT_CLR
#define GLB_REG_GPIO7_INT_CLR_POS                               (7U)
#define GLB_REG_GPIO7_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO7_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO7_INT_CLR_LEN)-1)<<GLB_REG_GPIO7_INT_CLR_POS)
#define GLB_REG_GPIO7_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO7_INT_CLR_LEN)-1)<<GLB_REG_GPIO7_INT_CLR_POS))
#define GLB_REG_GPIO8_INT_CLR                                   GLB_REG_GPIO8_INT_CLR
#define GLB_REG_GPIO8_INT_CLR_POS                               (8U)
#define GLB_REG_GPIO8_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO8_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO8_INT_CLR_LEN)-1)<<GLB_REG_GPIO8_INT_CLR_POS)
#define GLB_REG_GPIO8_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO8_INT_CLR_LEN)-1)<<GLB_REG_GPIO8_INT_CLR_POS))
#define GLB_REG_GPIO9_INT_CLR                                   GLB_REG_GPIO9_INT_CLR
#define GLB_REG_GPIO9_INT_CLR_POS                               (9U)
#define GLB_REG_GPIO9_INT_CLR_LEN                               (1U)
#define GLB_REG_GPIO9_INT_CLR_MSK                               (((1U<<GLB_REG_GPIO9_INT_CLR_LEN)-1)<<GLB_REG_GPIO9_INT_CLR_POS)
#define GLB_REG_GPIO9_INT_CLR_UMSK                              (~(((1U<<GLB_REG_GPIO9_INT_CLR_LEN)-1)<<GLB_REG_GPIO9_INT_CLR_POS))
#define GLB_REG_GPIO10_INT_CLR                                  GLB_REG_GPIO10_INT_CLR
#define GLB_REG_GPIO10_INT_CLR_POS                              (10U)
#define GLB_REG_GPIO10_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO10_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO10_INT_CLR_LEN)-1)<<GLB_REG_GPIO10_INT_CLR_POS)
#define GLB_REG_GPIO10_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO10_INT_CLR_LEN)-1)<<GLB_REG_GPIO10_INT_CLR_POS))
#define GLB_REG_GPIO11_INT_CLR                                  GLB_REG_GPIO11_INT_CLR
#define GLB_REG_GPIO11_INT_CLR_POS                              (11U)
#define GLB_REG_GPIO11_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO11_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO11_INT_CLR_LEN)-1)<<GLB_REG_GPIO11_INT_CLR_POS)
#define GLB_REG_GPIO11_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO11_INT_CLR_LEN)-1)<<GLB_REG_GPIO11_INT_CLR_POS))
#define GLB_REG_GPIO12_INT_CLR                                  GLB_REG_GPIO12_INT_CLR
#define GLB_REG_GPIO12_INT_CLR_POS                              (12U)
#define GLB_REG_GPIO12_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO12_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO12_INT_CLR_LEN)-1)<<GLB_REG_GPIO12_INT_CLR_POS)
#define GLB_REG_GPIO12_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO12_INT_CLR_LEN)-1)<<GLB_REG_GPIO12_INT_CLR_POS))
#define GLB_REG_GPIO13_INT_CLR                                  GLB_REG_GPIO13_INT_CLR
#define GLB_REG_GPIO13_INT_CLR_POS                              (13U)
#define GLB_REG_GPIO13_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO13_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO13_INT_CLR_LEN)-1)<<GLB_REG_GPIO13_INT_CLR_POS)
#define GLB_REG_GPIO13_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO13_INT_CLR_LEN)-1)<<GLB_REG_GPIO13_INT_CLR_POS))
#define GLB_REG_GPIO14_INT_CLR                                  GLB_REG_GPIO14_INT_CLR
#define GLB_REG_GPIO14_INT_CLR_POS                              (14U)
#define GLB_REG_GPIO14_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO14_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO14_INT_CLR_LEN)-1)<<GLB_REG_GPIO14_INT_CLR_POS)
#define GLB_REG_GPIO14_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO14_INT_CLR_LEN)-1)<<GLB_REG_GPIO14_INT_CLR_POS))
#define GLB_REG_GPIO15_INT_CLR                                  GLB_REG_GPIO15_INT_CLR
#define GLB_REG_GPIO15_INT_CLR_POS                              (15U)
#define GLB_REG_GPIO15_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO15_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO15_INT_CLR_LEN)-1)<<GLB_REG_GPIO15_INT_CLR_POS)
#define GLB_REG_GPIO15_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO15_INT_CLR_LEN)-1)<<GLB_REG_GPIO15_INT_CLR_POS))
#define GLB_REG_GPIO16_INT_CLR                                  GLB_REG_GPIO16_INT_CLR
#define GLB_REG_GPIO16_INT_CLR_POS                              (16U)
#define GLB_REG_GPIO16_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO16_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO16_INT_CLR_LEN)-1)<<GLB_REG_GPIO16_INT_CLR_POS)
#define GLB_REG_GPIO16_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO16_INT_CLR_LEN)-1)<<GLB_REG_GPIO16_INT_CLR_POS))
#define GLB_REG_GPIO17_INT_CLR                                  GLB_REG_GPIO17_INT_CLR
#define GLB_REG_GPIO17_INT_CLR_POS                              (17U)
#define GLB_REG_GPIO17_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO17_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO17_INT_CLR_LEN)-1)<<GLB_REG_GPIO17_INT_CLR_POS)
#define GLB_REG_GPIO17_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO17_INT_CLR_LEN)-1)<<GLB_REG_GPIO17_INT_CLR_POS))
#define GLB_REG_GPIO18_INT_CLR                                  GLB_REG_GPIO18_INT_CLR
#define GLB_REG_GPIO18_INT_CLR_POS                              (18U)
#define GLB_REG_GPIO18_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO18_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO18_INT_CLR_LEN)-1)<<GLB_REG_GPIO18_INT_CLR_POS)
#define GLB_REG_GPIO18_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO18_INT_CLR_LEN)-1)<<GLB_REG_GPIO18_INT_CLR_POS))
#define GLB_REG_GPIO19_INT_CLR                                  GLB_REG_GPIO19_INT_CLR
#define GLB_REG_GPIO19_INT_CLR_POS                              (19U)
#define GLB_REG_GPIO19_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO19_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO19_INT_CLR_LEN)-1)<<GLB_REG_GPIO19_INT_CLR_POS)
#define GLB_REG_GPIO19_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO19_INT_CLR_LEN)-1)<<GLB_REG_GPIO19_INT_CLR_POS))
#define GLB_REG_GPIO20_INT_CLR                                  GLB_REG_GPIO20_INT_CLR
#define GLB_REG_GPIO20_INT_CLR_POS                              (20U)
#define GLB_REG_GPIO20_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO20_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO20_INT_CLR_LEN)-1)<<GLB_REG_GPIO20_INT_CLR_POS)
#define GLB_REG_GPIO20_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO20_INT_CLR_LEN)-1)<<GLB_REG_GPIO20_INT_CLR_POS))
#define GLB_REG_GPIO21_INT_CLR                                  GLB_REG_GPIO21_INT_CLR
#define GLB_REG_GPIO21_INT_CLR_POS                              (21U)
#define GLB_REG_GPIO21_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO21_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO21_INT_CLR_LEN)-1)<<GLB_REG_GPIO21_INT_CLR_POS)
#define GLB_REG_GPIO21_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO21_INT_CLR_LEN)-1)<<GLB_REG_GPIO21_INT_CLR_POS))
#define GLB_REG_GPIO22_INT_CLR                                  GLB_REG_GPIO22_INT_CLR
#define GLB_REG_GPIO22_INT_CLR_POS                              (22U)
#define GLB_REG_GPIO22_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO22_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO22_INT_CLR_LEN)-1)<<GLB_REG_GPIO22_INT_CLR_POS)
#define GLB_REG_GPIO22_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO22_INT_CLR_LEN)-1)<<GLB_REG_GPIO22_INT_CLR_POS))
#define GLB_REG_GPIO23_INT_CLR                                  GLB_REG_GPIO23_INT_CLR
#define GLB_REG_GPIO23_INT_CLR_POS                              (23U)
#define GLB_REG_GPIO23_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO23_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO23_INT_CLR_LEN)-1)<<GLB_REG_GPIO23_INT_CLR_POS)
#define GLB_REG_GPIO23_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO23_INT_CLR_LEN)-1)<<GLB_REG_GPIO23_INT_CLR_POS))
#define GLB_REG_GPIO24_INT_CLR                                  GLB_REG_GPIO24_INT_CLR
#define GLB_REG_GPIO24_INT_CLR_POS                              (24U)
#define GLB_REG_GPIO24_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO24_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO24_INT_CLR_LEN)-1)<<GLB_REG_GPIO24_INT_CLR_POS)
#define GLB_REG_GPIO24_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO24_INT_CLR_LEN)-1)<<GLB_REG_GPIO24_INT_CLR_POS))
#define GLB_REG_GPIO25_INT_CLR                                  GLB_REG_GPIO25_INT_CLR
#define GLB_REG_GPIO25_INT_CLR_POS                              (25U)
#define GLB_REG_GPIO25_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO25_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO25_INT_CLR_LEN)-1)<<GLB_REG_GPIO25_INT_CLR_POS)
#define GLB_REG_GPIO25_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO25_INT_CLR_LEN)-1)<<GLB_REG_GPIO25_INT_CLR_POS))
#define GLB_REG_GPIO26_INT_CLR                                  GLB_REG_GPIO26_INT_CLR
#define GLB_REG_GPIO26_INT_CLR_POS                              (26U)
#define GLB_REG_GPIO26_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO26_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO26_INT_CLR_LEN)-1)<<GLB_REG_GPIO26_INT_CLR_POS)
#define GLB_REG_GPIO26_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO26_INT_CLR_LEN)-1)<<GLB_REG_GPIO26_INT_CLR_POS))
#define GLB_REG_GPIO27_INT_CLR                                  GLB_REG_GPIO27_INT_CLR
#define GLB_REG_GPIO27_INT_CLR_POS                              (27U)
#define GLB_REG_GPIO27_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO27_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO27_INT_CLR_LEN)-1)<<GLB_REG_GPIO27_INT_CLR_POS)
#define GLB_REG_GPIO27_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO27_INT_CLR_LEN)-1)<<GLB_REG_GPIO27_INT_CLR_POS))
#define GLB_REG_GPIO28_INT_CLR                                  GLB_REG_GPIO28_INT_CLR
#define GLB_REG_GPIO28_INT_CLR_POS                              (28U)
#define GLB_REG_GPIO28_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO28_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO28_INT_CLR_LEN)-1)<<GLB_REG_GPIO28_INT_CLR_POS)
#define GLB_REG_GPIO28_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO28_INT_CLR_LEN)-1)<<GLB_REG_GPIO28_INT_CLR_POS))
#define GLB_REG_GPIO29_INT_CLR                                  GLB_REG_GPIO29_INT_CLR
#define GLB_REG_GPIO29_INT_CLR_POS                              (29U)
#define GLB_REG_GPIO29_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO29_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO29_INT_CLR_LEN)-1)<<GLB_REG_GPIO29_INT_CLR_POS)
#define GLB_REG_GPIO29_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO29_INT_CLR_LEN)-1)<<GLB_REG_GPIO29_INT_CLR_POS))
#define GLB_REG_GPIO30_INT_CLR                                  GLB_REG_GPIO30_INT_CLR
#define GLB_REG_GPIO30_INT_CLR_POS                              (30U)
#define GLB_REG_GPIO30_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO30_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO30_INT_CLR_LEN)-1)<<GLB_REG_GPIO30_INT_CLR_POS)
#define GLB_REG_GPIO30_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO30_INT_CLR_LEN)-1)<<GLB_REG_GPIO30_INT_CLR_POS))
#define GLB_REG_GPIO31_INT_CLR                                  GLB_REG_GPIO31_INT_CLR
#define GLB_REG_GPIO31_INT_CLR_POS                              (31U)
#define GLB_REG_GPIO31_INT_CLR_LEN                              (1U)
#define GLB_REG_GPIO31_INT_CLR_MSK                              (((1U<<GLB_REG_GPIO31_INT_CLR_LEN)-1)<<GLB_REG_GPIO31_INT_CLR_POS)
#define GLB_REG_GPIO31_INT_CLR_UMSK                             (~(((1U<<GLB_REG_GPIO31_INT_CLR_LEN)-1)<<GLB_REG_GPIO31_INT_CLR_POS))

/* 0x1C0 : GPIO_INT_MODE_SET1 */
#define GLB_GPIO_INT_MODE_SET1_OFFSET                           (0x1C0)
#define GLB_REG_GPIO0_INT_MODE_SET                              GLB_REG_GPIO0_INT_MODE_SET
#define GLB_REG_GPIO0_INT_MODE_SET_POS                          (0U)
#define GLB_REG_GPIO0_INT_MODE_SET_LEN                          (4U)
#define GLB_REG_GPIO0_INT_MODE_SET_MSK                          (((1U<<GLB_REG_GPIO0_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO0_INT_MODE_SET_POS)
#define GLB_REG_GPIO0_INT_MODE_SET_UMSK                         (~(((1U<<GLB_REG_GPIO0_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO0_INT_MODE_SET_POS))
#define GLB_REG_GPIO1_INT_MODE_SET                              GLB_REG_GPIO1_INT_MODE_SET
#define GLB_REG_GPIO1_INT_MODE_SET_POS                          (4U)
#define GLB_REG_GPIO1_INT_MODE_SET_LEN                          (4U)
#define GLB_REG_GPIO1_INT_MODE_SET_MSK                          (((1U<<GLB_REG_GPIO1_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO1_INT_MODE_SET_POS)
#define GLB_REG_GPIO1_INT_MODE_SET_UMSK                         (~(((1U<<GLB_REG_GPIO1_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO1_INT_MODE_SET_POS))
#define GLB_REG_GPIO2_INT_MODE_SET                              GLB_REG_GPIO2_INT_MODE_SET
#define GLB_REG_GPIO2_INT_MODE_SET_POS                          (8U)
#define GLB_REG_GPIO2_INT_MODE_SET_LEN                          (4U)
#define GLB_REG_GPIO2_INT_MODE_SET_MSK                          (((1U<<GLB_REG_GPIO2_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO2_INT_MODE_SET_POS)
#define GLB_REG_GPIO2_INT_MODE_SET_UMSK                         (~(((1U<<GLB_REG_GPIO2_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO2_INT_MODE_SET_POS))
#define GLB_REG_GPIO3_INT_MODE_SET                              GLB_REG_GPIO3_INT_MODE_SET
#define GLB_REG_GPIO3_INT_MODE_SET_POS                          (12U)
#define GLB_REG_GPIO3_INT_MODE_SET_LEN                          (4U)
#define GLB_REG_GPIO3_INT_MODE_SET_MSK                          (((1U<<GLB_REG_GPIO3_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO3_INT_MODE_SET_POS)
#define GLB_REG_GPIO3_INT_MODE_SET_UMSK                         (~(((1U<<GLB_REG_GPIO3_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO3_INT_MODE_SET_POS))
#define GLB_REG_GPIO7_INT_MODE_SET                              GLB_REG_GPIO7_INT_MODE_SET
#define GLB_REG_GPIO7_INT_MODE_SET_POS                          (28U)
#define GLB_REG_GPIO7_INT_MODE_SET_LEN                          (4U)
#define GLB_REG_GPIO7_INT_MODE_SET_MSK                          (((1U<<GLB_REG_GPIO7_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO7_INT_MODE_SET_POS)
#define GLB_REG_GPIO7_INT_MODE_SET_UMSK                         (~(((1U<<GLB_REG_GPIO7_INT_MODE_SET_LEN)-1)<<GLB_REG_GPIO7_INT_MODE_SET_POS))

/* 0x1C4 : GPIO_INT_MODE_SET2 */
#define GLB_GPIO_INT_MODE_SET2_OFFSET                           (0x1C4)
#define GLB_REG_GPIO_INT_MODE_SET2                              GLB_REG_GPIO_INT_MODE_SET2
#define GLB_REG_GPIO_INT_MODE_SET2_POS                          (0U)
#define GLB_REG_GPIO_INT_MODE_SET2_LEN                          (32U)
#define GLB_REG_GPIO_INT_MODE_SET2_MSK                          (((1U<<GLB_REG_GPIO_INT_MODE_SET2_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET2_POS)
#define GLB_REG_GPIO_INT_MODE_SET2_UMSK                         (~(((1U<<GLB_REG_GPIO_INT_MODE_SET2_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET2_POS))

/* 0x1C8 : GPIO_INT_MODE_SET3 */
#define GLB_GPIO_INT_MODE_SET3_OFFSET                           (0x1C8)
#define GLB_REG_GPIO_INT_MODE_SET3                              GLB_REG_GPIO_INT_MODE_SET3
#define GLB_REG_GPIO_INT_MODE_SET3_POS                          (0U)
#define GLB_REG_GPIO_INT_MODE_SET3_LEN                          (32U)
#define GLB_REG_GPIO_INT_MODE_SET3_MSK                          (((1U<<GLB_REG_GPIO_INT_MODE_SET3_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET3_POS)
#define GLB_REG_GPIO_INT_MODE_SET3_UMSK                         (~(((1U<<GLB_REG_GPIO_INT_MODE_SET3_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET3_POS))

/* 0x1CC : GPIO_INT_MODE_SET4 */
#define GLB_GPIO_INT_MODE_SET4_OFFSET                           (0x1CC)
#define GLB_REG_GPIO_INT_MODE_SET4                              GLB_REG_GPIO_INT_MODE_SET4
#define GLB_REG_GPIO_INT_MODE_SET4_POS                          (0U)
#define GLB_REG_GPIO_INT_MODE_SET4_LEN                          (32U)
#define GLB_REG_GPIO_INT_MODE_SET4_MSK                          (((1U<<GLB_REG_GPIO_INT_MODE_SET4_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET4_POS)
#define GLB_REG_GPIO_INT_MODE_SET4_UMSK                         (~(((1U<<GLB_REG_GPIO_INT_MODE_SET4_LEN)-1)<<GLB_REG_GPIO_INT_MODE_SET4_POS))

