bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x200 : dll */
#define GLB_DLL_OFFSET                                          (0x200)
#define GLB_TEN_DLL                                             GLB_TEN_DLL
#define GLB_TEN_DLL_POS                                         (2U)
#define GLB_TEN_DLL_LEN                                         (1U)
#define GLB_TEN_DLL_MSK                                         (((1U<<GLB_TEN_DLL_LEN)-1)<<GLB_TEN_DLL_POS)
#define GLB_TEN_DLL_UMSK                                        (~(((1U<<GLB_TEN_DLL_LEN)-1)<<GLB_TEN_DLL_POS))
#define GLB_DLL_VCTRL_SEL                                       GLB_DLL_VCTRL_SEL
#define GLB_DLL_VCTRL_SEL_POS                                   (8U)
#define GLB_DLL_VCTRL_SEL_LEN                                   (3U)
#define GLB_DLL_VCTRL_SEL_MSK                                   (((1U<<GLB_DLL_VCTRL_SEL_LEN)-1)<<GLB_DLL_VCTRL_SEL_POS)
#define GLB_DLL_VCTRL_SEL_UMSK                                  (~(((1U<<GLB_DLL_VCTRL_SEL_LEN)-1)<<GLB_DLL_VCTRL_SEL_POS))
#define GLB_DLL_PRECHG_SEL                                      GLB_DLL_PRECHG_SEL
#define GLB_DLL_PRECHG_SEL_POS                                  (12U)
#define GLB_DLL_PRECHG_SEL_LEN                                  (1U)
#define GLB_DLL_PRECHG_SEL_MSK                                  (((1U<<GLB_DLL_PRECHG_SEL_LEN)-1)<<GLB_DLL_PRECHG_SEL_POS)
#define GLB_DLL_PRECHG_SEL_UMSK                                 (~(((1U<<GLB_DLL_PRECHG_SEL_LEN)-1)<<GLB_DLL_PRECHG_SEL_POS))
#define GLB_DLL_PRECHG_REG                                      GLB_DLL_PRECHG_REG
#define GLB_DLL_PRECHG_REG_POS                                  (13U)
#define GLB_DLL_PRECHG_REG_LEN                                  (1U)
#define GLB_DLL_PRECHG_REG_MSK                                  (((1U<<GLB_DLL_PRECHG_REG_LEN)-1)<<GLB_DLL_PRECHG_REG_POS)
#define GLB_DLL_PRECHG_REG_UMSK                                 (~(((1U<<GLB_DLL_PRECHG_REG_LEN)-1)<<GLB_DLL_PRECHG_REG_POS))
#define GLB_DLL_PRECHG_EN                                       GLB_DLL_PRECHG_EN
#define GLB_DLL_PRECHG_EN_POS                                   (14U)
#define GLB_DLL_PRECHG_EN_LEN                                   (1U)
#define GLB_DLL_PRECHG_EN_MSK                                   (((1U<<GLB_DLL_PRECHG_EN_LEN)-1)<<GLB_DLL_PRECHG_EN_POS)
#define GLB_DLL_PRECHG_EN_UMSK                                  (~(((1U<<GLB_DLL_PRECHG_EN_LEN)-1)<<GLB_DLL_PRECHG_EN_POS))
#define GLB_DLL_VCTRL_FORCE_EN                                  GLB_DLL_VCTRL_FORCE_EN
#define GLB_DLL_VCTRL_FORCE_EN_POS                              (15U)
#define GLB_DLL_VCTRL_FORCE_EN_LEN                              (1U)
#define GLB_DLL_VCTRL_FORCE_EN_MSK                              (((1U<<GLB_DLL_VCTRL_FORCE_EN_LEN)-1)<<GLB_DLL_VCTRL_FORCE_EN_POS)
#define GLB_DLL_VCTRL_FORCE_EN_UMSK                             (~(((1U<<GLB_DLL_VCTRL_FORCE_EN_LEN)-1)<<GLB_DLL_VCTRL_FORCE_EN_POS))
#define GLB_DLL_POSTDIV                                         GLB_DLL_POSTDIV
#define GLB_DLL_POSTDIV_POS                                     (16U)
#define GLB_DLL_POSTDIV_LEN                                     (6U)
#define GLB_DLL_POSTDIV_MSK                                     (((1U<<GLB_DLL_POSTDIV_LEN)-1)<<GLB_DLL_POSTDIV_POS)
#define GLB_DLL_POSTDIV_UMSK                                    (~(((1U<<GLB_DLL_POSTDIV_LEN)-1)<<GLB_DLL_POSTDIV_POS))
#define GLB_DLL_DELAY_SEL                                       GLB_DLL_DELAY_SEL
#define GLB_DLL_DELAY_SEL_POS                                   (24U)
#define GLB_DLL_DELAY_SEL_LEN                                   (2U)
#define GLB_DLL_DELAY_SEL_MSK                                   (((1U<<GLB_DLL_DELAY_SEL_LEN)-1)<<GLB_DLL_DELAY_SEL_POS)
#define GLB_DLL_DELAY_SEL_UMSK                                  (~(((1U<<GLB_DLL_DELAY_SEL_LEN)-1)<<GLB_DLL_DELAY_SEL_POS))
#define GLB_DLL_CP_OP_EN                                        GLB_DLL_CP_OP_EN
#define GLB_DLL_CP_OP_EN_POS                                    (26U)
#define GLB_DLL_CP_OP_EN_LEN                                    (1U)
#define GLB_DLL_CP_OP_EN_MSK                                    (((1U<<GLB_DLL_CP_OP_EN_LEN)-1)<<GLB_DLL_CP_OP_EN_POS)
#define GLB_DLL_CP_OP_EN_UMSK                                   (~(((1U<<GLB_DLL_CP_OP_EN_LEN)-1)<<GLB_DLL_CP_OP_EN_POS))
#define GLB_DLL_CP_HIZ                                          GLB_DLL_CP_HIZ
#define GLB_DLL_CP_HIZ_POS                                      (27U)
#define GLB_DLL_CP_HIZ_LEN                                      (1U)
#define GLB_DLL_CP_HIZ_MSK                                      (((1U<<GLB_DLL_CP_HIZ_LEN)-1)<<GLB_DLL_CP_HIZ_POS)
#define GLB_DLL_CP_HIZ_UMSK                                     (~(((1U<<GLB_DLL_CP_HIZ_LEN)-1)<<GLB_DLL_CP_HIZ_POS))
#define GLB_DLL_REFCLK_SEL                                      GLB_DLL_REFCLK_SEL
#define GLB_DLL_REFCLK_SEL_POS                                  (28U)
#define GLB_DLL_REFCLK_SEL_LEN                                  (1U)
#define GLB_DLL_REFCLK_SEL_MSK                                  (((1U<<GLB_DLL_REFCLK_SEL_LEN)-1)<<GLB_DLL_REFCLK_SEL_POS)
#define GLB_DLL_REFCLK_SEL_UMSK                                 (~(((1U<<GLB_DLL_REFCLK_SEL_LEN)-1)<<GLB_DLL_REFCLK_SEL_POS))
#define GLB_DLL_RESET                                           GLB_DLL_RESET
#define GLB_DLL_RESET_POS                                       (29U)
#define GLB_DLL_RESET_LEN                                       (1U)
#define GLB_DLL_RESET_MSK                                       (((1U<<GLB_DLL_RESET_LEN)-1)<<GLB_DLL_RESET_POS)
#define GLB_DLL_RESET_UMSK                                      (~(((1U<<GLB_DLL_RESET_LEN)-1)<<GLB_DLL_RESET_POS))
#define GLB_PU_DLL                                              GLB_PU_DLL
#define GLB_PU_DLL_POS                                          (30U)
#define GLB_PU_DLL_LEN                                          (1U)
#define GLB_PU_DLL_MSK                                          (((1U<<GLB_PU_DLL_LEN)-1)<<GLB_PU_DLL_POS)
#define GLB_PU_DLL_UMSK                                         (~(((1U<<GLB_PU_DLL_LEN)-1)<<GLB_PU_DLL_POS))
#define GLB_PPU_DLL                                             GLB_PPU_DLL
#define GLB_PPU_DLL_POS                                         (31U)
#define GLB_PPU_DLL_LEN                                         (1U)
#define GLB_PPU_DLL_MSK                                         (((1U<<GLB_PPU_DLL_LEN)-1)<<GLB_PPU_DLL_POS)
#define GLB_PPU_DLL_UMSK                                        (~(((1U<<GLB_PPU_DLL_LEN)-1)<<GLB_PPU_DLL_POS))

/* 0x204 : dll2 */
#define GLB_DLL2_OFFSET                                         (0x204)
#define GLB_DLL_EN_DIV1_RF                                      GLB_DLL_EN_DIV1_RF
#define GLB_DLL_EN_DIV1_RF_POS                                  (0U)
#define GLB_DLL_EN_DIV1_RF_LEN                                  (1U)
#define GLB_DLL_EN_DIV1_RF_MSK                                  (((1U<<GLB_DLL_EN_DIV1_RF_LEN)-1)<<GLB_DLL_EN_DIV1_RF_POS)
#define GLB_DLL_EN_DIV1_RF_UMSK                                 (~(((1U<<GLB_DLL_EN_DIV1_RF_LEN)-1)<<GLB_DLL_EN_DIV1_RF_POS))
#define GLB_DLL_EN_DIV63                                        GLB_DLL_EN_DIV63
#define GLB_DLL_EN_DIV63_POS                                    (1U)
#define GLB_DLL_EN_DIV63_LEN                                    (1U)
#define GLB_DLL_EN_DIV63_MSK                                    (((1U<<GLB_DLL_EN_DIV63_LEN)-1)<<GLB_DLL_EN_DIV63_POS)
#define GLB_DLL_EN_DIV63_UMSK                                   (~(((1U<<GLB_DLL_EN_DIV63_LEN)-1)<<GLB_DLL_EN_DIV63_POS))
#define GLB_DLL_EN_DIV21                                        GLB_DLL_EN_DIV21
#define GLB_DLL_EN_DIV21_POS                                    (2U)
#define GLB_DLL_EN_DIV21_LEN                                    (1U)
#define GLB_DLL_EN_DIV21_MSK                                    (((1U<<GLB_DLL_EN_DIV21_LEN)-1)<<GLB_DLL_EN_DIV21_POS)
#define GLB_DLL_EN_DIV21_UMSK                                   (~(((1U<<GLB_DLL_EN_DIV21_LEN)-1)<<GLB_DLL_EN_DIV21_POS))
#define GLB_DLL_EN_DIV5                                         GLB_DLL_EN_DIV5
#define GLB_DLL_EN_DIV5_POS                                     (3U)
#define GLB_DLL_EN_DIV5_LEN                                     (1U)
#define GLB_DLL_EN_DIV5_MSK                                     (((1U<<GLB_DLL_EN_DIV5_LEN)-1)<<GLB_DLL_EN_DIV5_POS)
#define GLB_DLL_EN_DIV5_UMSK                                    (~(((1U<<GLB_DLL_EN_DIV5_LEN)-1)<<GLB_DLL_EN_DIV5_POS))
#define GLB_DLL_EN_DIV3                                         GLB_DLL_EN_DIV3
#define GLB_DLL_EN_DIV3_POS                                     (4U)
#define GLB_DLL_EN_DIV3_LEN                                     (1U)
#define GLB_DLL_EN_DIV3_MSK                                     (((1U<<GLB_DLL_EN_DIV3_LEN)-1)<<GLB_DLL_EN_DIV3_POS)
#define GLB_DLL_EN_DIV3_UMSK                                    (~(((1U<<GLB_DLL_EN_DIV3_LEN)-1)<<GLB_DLL_EN_DIV3_POS))
#define GLB_DLL_EN_DIV2                                         GLB_DLL_EN_DIV2
#define GLB_DLL_EN_DIV2_POS                                     (5U)
#define GLB_DLL_EN_DIV2_LEN                                     (1U)
#define GLB_DLL_EN_DIV2_MSK                                     (((1U<<GLB_DLL_EN_DIV2_LEN)-1)<<GLB_DLL_EN_DIV2_POS)
#define GLB_DLL_EN_DIV2_UMSK                                    (~(((1U<<GLB_DLL_EN_DIV2_LEN)-1)<<GLB_DLL_EN_DIV2_POS))
#define GLB_DLL_EN_DIV1                                         GLB_DLL_EN_DIV1
#define GLB_DLL_EN_DIV1_POS                                     (6U)
#define GLB_DLL_EN_DIV1_LEN                                     (1U)
#define GLB_DLL_EN_DIV1_MSK                                     (((1U<<GLB_DLL_EN_DIV1_LEN)-1)<<GLB_DLL_EN_DIV1_POS)
#define GLB_DLL_EN_DIV1_UMSK                                    (~(((1U<<GLB_DLL_EN_DIV1_LEN)-1)<<GLB_DLL_EN_DIV1_POS))
#define GLB_DLL_DL_CTRL_DIV1_RF                                 GLB_DLL_DL_CTRL_DIV1_RF
#define GLB_DLL_DL_CTRL_DIV1_RF_POS                             (7U)
#define GLB_DLL_DL_CTRL_DIV1_RF_LEN                             (1U)
#define GLB_DLL_DL_CTRL_DIV1_RF_MSK                             (((1U<<GLB_DLL_DL_CTRL_DIV1_RF_LEN)-1)<<GLB_DLL_DL_CTRL_DIV1_RF_POS)
#define GLB_DLL_DL_CTRL_DIV1_RF_UMSK                            (~(((1U<<GLB_DLL_DL_CTRL_DIV1_RF_LEN)-1)<<GLB_DLL_DL_CTRL_DIV1_RF_POS))
#define GLB_DLL_DL_CTRL_DIV5                                    GLB_DLL_DL_CTRL_DIV5
#define GLB_DLL_DL_CTRL_DIV5_POS                                (8U)
#define GLB_DLL_DL_CTRL_DIV5_LEN                                (1U)
#define GLB_DLL_DL_CTRL_DIV5_MSK                                (((1U<<GLB_DLL_DL_CTRL_DIV5_LEN)-1)<<GLB_DLL_DL_CTRL_DIV5_POS)
#define GLB_DLL_DL_CTRL_DIV5_UMSK                               (~(((1U<<GLB_DLL_DL_CTRL_DIV5_LEN)-1)<<GLB_DLL_DL_CTRL_DIV5_POS))
#define GLB_DLL_DL_CTRL_DIV3                                    GLB_DLL_DL_CTRL_DIV3
#define GLB_DLL_DL_CTRL_DIV3_POS                                (9U)
#define GLB_DLL_DL_CTRL_DIV3_LEN                                (1U)
#define GLB_DLL_DL_CTRL_DIV3_MSK                                (((1U<<GLB_DLL_DL_CTRL_DIV3_LEN)-1)<<GLB_DLL_DL_CTRL_DIV3_POS)
#define GLB_DLL_DL_CTRL_DIV3_UMSK                               (~(((1U<<GLB_DLL_DL_CTRL_DIV3_LEN)-1)<<GLB_DLL_DL_CTRL_DIV3_POS))
#define GLB_DLL_DL_CTRL_DIV2                                    GLB_DLL_DL_CTRL_DIV2
#define GLB_DLL_DL_CTRL_DIV2_POS                                (10U)
#define GLB_DLL_DL_CTRL_DIV2_LEN                                (1U)
#define GLB_DLL_DL_CTRL_DIV2_MSK                                (((1U<<GLB_DLL_DL_CTRL_DIV2_LEN)-1)<<GLB_DLL_DL_CTRL_DIV2_POS)
#define GLB_DLL_DL_CTRL_DIV2_UMSK                               (~(((1U<<GLB_DLL_DL_CTRL_DIV2_LEN)-1)<<GLB_DLL_DL_CTRL_DIV2_POS))
#define GLB_DLL_DL_CTRL_DIV1                                    GLB_DLL_DL_CTRL_DIV1
#define GLB_DLL_DL_CTRL_DIV1_POS                                (11U)
#define GLB_DLL_DL_CTRL_DIV1_LEN                                (1U)
#define GLB_DLL_DL_CTRL_DIV1_MSK                                (((1U<<GLB_DLL_DL_CTRL_DIV1_LEN)-1)<<GLB_DLL_DL_CTRL_DIV1_POS)
#define GLB_DLL_DL_CTRL_DIV1_UMSK                               (~(((1U<<GLB_DLL_DL_CTRL_DIV1_LEN)-1)<<GLB_DLL_DL_CTRL_DIV1_POS))
#define GLB_DLL_POSTDIV_DL_CTRL                                 GLB_DLL_POSTDIV_DL_CTRL
#define GLB_DLL_POSTDIV_DL_CTRL_POS                             (16U)
#define GLB_DLL_POSTDIV_DL_CTRL_LEN                             (1U)
#define GLB_DLL_POSTDIV_DL_CTRL_MSK                             (((1U<<GLB_DLL_POSTDIV_DL_CTRL_LEN)-1)<<GLB_DLL_POSTDIV_DL_CTRL_POS)
#define GLB_DLL_POSTDIV_DL_CTRL_UMSK                            (~(((1U<<GLB_DLL_POSTDIV_DL_CTRL_LEN)-1)<<GLB_DLL_POSTDIV_DL_CTRL_POS))
#define GLB_DLL_POSTDIV_STG2_DIV2                               GLB_DLL_POSTDIV_STG2_DIV2
#define GLB_DLL_POSTDIV_STG2_DIV2_POS                           (17U)
#define GLB_DLL_POSTDIV_STG2_DIV2_LEN                           (1U)
#define GLB_DLL_POSTDIV_STG2_DIV2_MSK                           (((1U<<GLB_DLL_POSTDIV_STG2_DIV2_LEN)-1)<<GLB_DLL_POSTDIV_STG2_DIV2_POS)
#define GLB_DLL_POSTDIV_STG2_DIV2_UMSK                          (~(((1U<<GLB_DLL_POSTDIV_STG2_DIV2_LEN)-1)<<GLB_DLL_POSTDIV_STG2_DIV2_POS))
#define GLB_DLL_POSTDIV_EN                                      GLB_DLL_POSTDIV_EN
#define GLB_DLL_POSTDIV_EN_POS                                  (18U)
#define GLB_DLL_POSTDIV_EN_LEN                                  (1U)
#define GLB_DLL_POSTDIV_EN_MSK                                  (((1U<<GLB_DLL_POSTDIV_EN_LEN)-1)<<GLB_DLL_POSTDIV_EN_POS)
#define GLB_DLL_POSTDIV_EN_UMSK                                 (~(((1U<<GLB_DLL_POSTDIV_EN_LEN)-1)<<GLB_DLL_POSTDIV_EN_POS))
#define GLB_DLL_REF_POLARITY                                    GLB_DLL_REF_POLARITY
#define GLB_DLL_REF_POLARITY_POS                                (19U)
#define GLB_DLL_REF_POLARITY_LEN                                (1U)
#define GLB_DLL_REF_POLARITY_MSK                                (((1U<<GLB_DLL_REF_POLARITY_LEN)-1)<<GLB_DLL_REF_POLARITY_POS)
#define GLB_DLL_REF_POLARITY_UMSK                               (~(((1U<<GLB_DLL_REF_POLARITY_LEN)-1)<<GLB_DLL_REF_POLARITY_POS))
#define GLB_DTEN_DLL_REFBUF                                     GLB_DTEN_DLL_REFBUF
#define GLB_DTEN_DLL_REFBUF_POS                                 (20U)
#define GLB_DTEN_DLL_REFBUF_LEN                                 (1U)
#define GLB_DTEN_DLL_REFBUF_MSK                                 (((1U<<GLB_DTEN_DLL_REFBUF_LEN)-1)<<GLB_DTEN_DLL_REFBUF_POS)
#define GLB_DTEN_DLL_REFBUF_UMSK                                (~(((1U<<GLB_DTEN_DLL_REFBUF_LEN)-1)<<GLB_DTEN_DLL_REFBUF_POS))
#define GLB_DTEN_DLL_POSTDIV                                    GLB_DTEN_DLL_POSTDIV
#define GLB_DTEN_DLL_POSTDIV_POS                                (21U)
#define GLB_DTEN_DLL_POSTDIV_LEN                                (1U)
#define GLB_DTEN_DLL_POSTDIV_MSK                                (((1U<<GLB_DTEN_DLL_POSTDIV_LEN)-1)<<GLB_DTEN_DLL_POSTDIV_POS)
#define GLB_DTEN_DLL_POSTDIV_UMSK                               (~(((1U<<GLB_DTEN_DLL_POSTDIV_LEN)-1)<<GLB_DTEN_DLL_POSTDIV_POS))
#define GLB_DTEN_DLL_CLKDIV63                                   GLB_DTEN_DLL_CLKDIV63
#define GLB_DTEN_DLL_CLKDIV63_POS                               (22U)
#define GLB_DTEN_DLL_CLKDIV63_LEN                               (1U)
#define GLB_DTEN_DLL_CLKDIV63_MSK                               (((1U<<GLB_DTEN_DLL_CLKDIV63_LEN)-1)<<GLB_DTEN_DLL_CLKDIV63_POS)
#define GLB_DTEN_DLL_CLKDIV63_UMSK                              (~(((1U<<GLB_DTEN_DLL_CLKDIV63_LEN)-1)<<GLB_DTEN_DLL_CLKDIV63_POS))
#define GLB_DLL_RESV                                            GLB_DLL_RESV
#define GLB_DLL_RESV_POS                                        (24U)
#define GLB_DLL_RESV_LEN                                        (8U)
#define GLB_DLL_RESV_MSK                                        (((1U<<GLB_DLL_RESV_LEN)-1)<<GLB_DLL_RESV_POS)
#define GLB_DLL_RESV_UMSK                                       (~(((1U<<GLB_DLL_RESV_LEN)-1)<<GLB_DLL_RESV_POS))

/* 0x224 : led_driver */
#define GLB_LED_DRIVER_OFFSET                                   (0x224)
#define GLB_LED_DIN_REG                                         GLB_LED_DIN_REG
#define GLB_LED_DIN_REG_POS                                     (0U)
#define GLB_LED_DIN_REG_LEN                                     (1U)
#define GLB_LED_DIN_REG_MSK                                     (((1U<<GLB_LED_DIN_REG_LEN)-1)<<GLB_LED_DIN_REG_POS)
#define GLB_LED_DIN_REG_UMSK                                    (~(((1U<<GLB_LED_DIN_REG_LEN)-1)<<GLB_LED_DIN_REG_POS))
#define GLB_LED_DIN_SEL                                         GLB_LED_DIN_SEL
#define GLB_LED_DIN_SEL_POS                                     (1U)
#define GLB_LED_DIN_SEL_LEN                                     (1U)
#define GLB_LED_DIN_SEL_MSK                                     (((1U<<GLB_LED_DIN_SEL_LEN)-1)<<GLB_LED_DIN_SEL_POS)
#define GLB_LED_DIN_SEL_UMSK                                    (~(((1U<<GLB_LED_DIN_SEL_LEN)-1)<<GLB_LED_DIN_SEL_POS))
#define GLB_LED_DIN_POLARITY_SEL                                GLB_LED_DIN_POLARITY_SEL
#define GLB_LED_DIN_POLARITY_SEL_POS                            (2U)
#define GLB_LED_DIN_POLARITY_SEL_LEN                            (1U)
#define GLB_LED_DIN_POLARITY_SEL_MSK                            (((1U<<GLB_LED_DIN_POLARITY_SEL_LEN)-1)<<GLB_LED_DIN_POLARITY_SEL_POS)
#define GLB_LED_DIN_POLARITY_SEL_UMSK                           (~(((1U<<GLB_LED_DIN_POLARITY_SEL_LEN)-1)<<GLB_LED_DIN_POLARITY_SEL_POS))
#define GLB_LEDDRV_IBIAS                                        GLB_LEDDRV_IBIAS
#define GLB_LEDDRV_IBIAS_POS                                    (4U)
#define GLB_LEDDRV_IBIAS_LEN                                    (3U)
#define GLB_LEDDRV_IBIAS_MSK                                    (((1U<<GLB_LEDDRV_IBIAS_LEN)-1)<<GLB_LEDDRV_IBIAS_POS)
#define GLB_LEDDRV_IBIAS_UMSK                                   (~(((1U<<GLB_LEDDRV_IBIAS_LEN)-1)<<GLB_LEDDRV_IBIAS_POS))
#define GLB_LEDDRV_OUT_EN                                       GLB_LEDDRV_OUT_EN
#define GLB_LEDDRV_OUT_EN_POS                                   (28U)
#define GLB_LEDDRV_OUT_EN_LEN                                   (2U)
#define GLB_LEDDRV_OUT_EN_MSK                                   (((1U<<GLB_LEDDRV_OUT_EN_LEN)-1)<<GLB_LEDDRV_OUT_EN_POS)
#define GLB_LEDDRV_OUT_EN_UMSK                                  (~(((1U<<GLB_LEDDRV_OUT_EN_LEN)-1)<<GLB_LEDDRV_OUT_EN_POS))
#define GLB_PU_LEDDRV                                           GLB_PU_LEDDRV
#define GLB_PU_LEDDRV_POS                                       (31U)
#define GLB_PU_LEDDRV_LEN                                       (1U)
#define GLB_PU_LEDDRV_MSK                                       (((1U<<GLB_PU_LEDDRV_LEN)-1)<<GLB_PU_LEDDRV_POS)
#define GLB_PU_LEDDRV_UMSK                                      (~(((1U<<GLB_PU_LEDDRV_LEN)-1)<<GLB_PU_LEDDRV_POS))

/* 0x228 : usb_xcvr */
#define GLB_USB_XCVR_OFFSET                                     (0x228)

