bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x22C : usb_xcvr_config */
#define GLB_USB_XCVR_CONFIG_OFFSET                              (0x22C)

/* 0x300 : rc32m_ctrl0 */
#define GLB_RC32M_CTRL0_OFFSET                                  (0x300)
#define GLB_RC32M_CAL_DONE                                      GLB_RC32M_CAL_DONE
#define GLB_RC32M_CAL_DONE_POS                                  (0U)
#define GLB_RC32M_CAL_DONE_LEN                                  (1U)
#define GLB_RC32M_CAL_DONE_MSK                                  (((1U<<GLB_RC32M_CAL_DONE_LEN)-1)<<GLB_RC32M_CAL_DONE_POS)
#define GLB_RC32M_CAL_DONE_UMSK                                 (~(((1U<<GLB_RC32M_CAL_DONE_LEN)-1)<<GLB_RC32M_CAL_DONE_POS))
#define GLB_RC32M_RDY                                           GLB_RC32M_RDY
#define GLB_RC32M_RDY_POS                                       (1U)
#define GLB_RC32M_RDY_LEN                                       (1U)
#define GLB_RC32M_RDY_MSK                                       (((1U<<GLB_RC32M_RDY_LEN)-1)<<GLB_RC32M_RDY_POS)
#define GLB_RC32M_RDY_UMSK                                      (~(((1U<<GLB_RC32M_RDY_LEN)-1)<<GLB_RC32M_RDY_POS))
#define GLB_RC32M_CAL_INPROGRESS                                GLB_RC32M_CAL_INPROGRESS
#define GLB_RC32M_CAL_INPROGRESS_POS                            (2U)
#define GLB_RC32M_CAL_INPROGRESS_LEN                            (1U)
#define GLB_RC32M_CAL_INPROGRESS_MSK                            (((1U<<GLB_RC32M_CAL_INPROGRESS_LEN)-1)<<GLB_RC32M_CAL_INPROGRESS_POS)
#define GLB_RC32M_CAL_INPROGRESS_UMSK                           (~(((1U<<GLB_RC32M_CAL_INPROGRESS_LEN)-1)<<GLB_RC32M_CAL_INPROGRESS_POS))
#define GLB_RC32M_CAL_DIV                                       GLB_RC32M_CAL_DIV
#define GLB_RC32M_CAL_DIV_POS                                   (3U)
#define GLB_RC32M_CAL_DIV_LEN                                   (2U)
#define GLB_RC32M_CAL_DIV_MSK                                   (((1U<<GLB_RC32M_CAL_DIV_LEN)-1)<<GLB_RC32M_CAL_DIV_POS)
#define GLB_RC32M_CAL_DIV_UMSK                                  (~(((1U<<GLB_RC32M_CAL_DIV_LEN)-1)<<GLB_RC32M_CAL_DIV_POS))
#define GLB_RC32M_CAL_PRECHARGE                                 GLB_RC32M_CAL_PRECHARGE
#define GLB_RC32M_CAL_PRECHARGE_POS                             (5U)
#define GLB_RC32M_CAL_PRECHARGE_LEN                             (1U)
#define GLB_RC32M_CAL_PRECHARGE_MSK                             (((1U<<GLB_RC32M_CAL_PRECHARGE_LEN)-1)<<GLB_RC32M_CAL_PRECHARGE_POS)
#define GLB_RC32M_CAL_PRECHARGE_UMSK                            (~(((1U<<GLB_RC32M_CAL_PRECHARGE_LEN)-1)<<GLB_RC32M_CAL_PRECHARGE_POS))
#define GLB_RC32M_DIG_CODE_FR_CAL                               GLB_RC32M_DIG_CODE_FR_CAL
#define GLB_RC32M_DIG_CODE_FR_CAL_POS                           (6U)
#define GLB_RC32M_DIG_CODE_FR_CAL_LEN                           (8U)
#define GLB_RC32M_DIG_CODE_FR_CAL_MSK                           (((1U<<GLB_RC32M_DIG_CODE_FR_CAL_LEN)-1)<<GLB_RC32M_DIG_CODE_FR_CAL_POS)
#define GLB_RC32M_DIG_CODE_FR_CAL_UMSK                          (~(((1U<<GLB_RC32M_DIG_CODE_FR_CAL_LEN)-1)<<GLB_RC32M_DIG_CODE_FR_CAL_POS))
#define GLB_RC32M_ALLOW_CAL                                     GLB_RC32M_ALLOW_CAL
#define GLB_RC32M_ALLOW_CAL_POS                                 (17U)
#define GLB_RC32M_ALLOW_CAL_LEN                                 (1U)
#define GLB_RC32M_ALLOW_CAL_MSK                                 (((1U<<GLB_RC32M_ALLOW_CAL_LEN)-1)<<GLB_RC32M_ALLOW_CAL_POS)
#define GLB_RC32M_ALLOW_CAL_UMSK                                (~(((1U<<GLB_RC32M_ALLOW_CAL_LEN)-1)<<GLB_RC32M_ALLOW_CAL_POS))
#define GLB_RC32M_EXT_CODE_EN                                   GLB_RC32M_EXT_CODE_EN
#define GLB_RC32M_EXT_CODE_EN_POS                               (19U)
#define GLB_RC32M_EXT_CODE_EN_LEN                               (1U)
#define GLB_RC32M_EXT_CODE_EN_MSK                               (((1U<<GLB_RC32M_EXT_CODE_EN_LEN)-1)<<GLB_RC32M_EXT_CODE_EN_POS)
#define GLB_RC32M_EXT_CODE_EN_UMSK                              (~(((1U<<GLB_RC32M_EXT_CODE_EN_LEN)-1)<<GLB_RC32M_EXT_CODE_EN_POS))
#define GLB_RC32M_CAL_EN                                        GLB_RC32M_CAL_EN
#define GLB_RC32M_CAL_EN_POS                                    (20U)
#define GLB_RC32M_CAL_EN_LEN                                    (1U)
#define GLB_RC32M_CAL_EN_MSK                                    (((1U<<GLB_RC32M_CAL_EN_LEN)-1)<<GLB_RC32M_CAL_EN_POS)
#define GLB_RC32M_CAL_EN_UMSK                                   (~(((1U<<GLB_RC32M_CAL_EN_LEN)-1)<<GLB_RC32M_CAL_EN_POS))
#define GLB_RC32M_PD                                            GLB_RC32M_PD
#define GLB_RC32M_PD_POS                                        (21U)
#define GLB_RC32M_PD_LEN                                        (1U)
#define GLB_RC32M_PD_MSK                                        (((1U<<GLB_RC32M_PD_LEN)-1)<<GLB_RC32M_PD_POS)
#define GLB_RC32M_PD_UMSK                                       (~(((1U<<GLB_RC32M_PD_LEN)-1)<<GLB_RC32M_PD_POS))
#define GLB_RC32M_CODE_FR_EXT                                   GLB_RC32M_CODE_FR_EXT
#define GLB_RC32M_CODE_FR_EXT_POS                               (22U)
#define GLB_RC32M_CODE_FR_EXT_LEN                               (8U)
#define GLB_RC32M_CODE_FR_EXT_MSK                               (((1U<<GLB_RC32M_CODE_FR_EXT_LEN)-1)<<GLB_RC32M_CODE_FR_EXT_POS)
#define GLB_RC32M_CODE_FR_EXT_UMSK                              (~(((1U<<GLB_RC32M_CODE_FR_EXT_LEN)-1)<<GLB_RC32M_CODE_FR_EXT_POS))
#define GLB_RC32M_RC32K_CAL_CGEN                                GLB_RC32M_RC32K_CAL_CGEN
#define GLB_RC32M_RC32K_CAL_CGEN_POS                            (30U)
#define GLB_RC32M_RC32K_CAL_CGEN_LEN                            (1U)
#define GLB_RC32M_RC32K_CAL_CGEN_MSK                            (((1U<<GLB_RC32M_RC32K_CAL_CGEN_LEN)-1)<<GLB_RC32M_RC32K_CAL_CGEN_POS)
#define GLB_RC32M_RC32K_CAL_CGEN_UMSK                           (~(((1U<<GLB_RC32M_RC32K_CAL_CGEN_LEN)-1)<<GLB_RC32M_RC32K_CAL_CGEN_POS))

/* 0x304 : rc32m_ctrl1 */
#define GLB_RC32M_CTRL1_OFFSET                                  (0x304)
#define GLB_RC32M_TEST_EN                                       GLB_RC32M_TEST_EN
#define GLB_RC32M_TEST_EN_POS                                   (0U)
#define GLB_RC32M_TEST_EN_LEN                                   (1U)
#define GLB_RC32M_TEST_EN_MSK                                   (((1U<<GLB_RC32M_TEST_EN_LEN)-1)<<GLB_RC32M_TEST_EN_POS)
#define GLB_RC32M_TEST_EN_UMSK                                  (~(((1U<<GLB_RC32M_TEST_EN_LEN)-1)<<GLB_RC32M_TEST_EN_POS))
#define GLB_RC32M_CODE_FR_EXT2                                  GLB_RC32M_CODE_FR_EXT2
#define GLB_RC32M_CODE_FR_EXT2_POS                              (8U)
#define GLB_RC32M_CODE_FR_EXT2_LEN                              (8U)
#define GLB_RC32M_CODE_FR_EXT2_MSK                              (((1U<<GLB_RC32M_CODE_FR_EXT2_LEN)-1)<<GLB_RC32M_CODE_FR_EXT2_POS)
#define GLB_RC32M_CODE_FR_EXT2_UMSK                             (~(((1U<<GLB_RC32M_CODE_FR_EXT2_LEN)-1)<<GLB_RC32M_CODE_FR_EXT2_POS))
#define GLB_RC32M_EXT_CODE_SEL                                  GLB_RC32M_EXT_CODE_SEL
#define GLB_RC32M_EXT_CODE_SEL_POS                              (16U)
#define GLB_RC32M_EXT_CODE_SEL_LEN                              (1U)
#define GLB_RC32M_EXT_CODE_SEL_MSK                              (((1U<<GLB_RC32M_EXT_CODE_SEL_LEN)-1)<<GLB_RC32M_EXT_CODE_SEL_POS)
#define GLB_RC32M_EXT_CODE_SEL_UMSK                             (~(((1U<<GLB_RC32M_EXT_CODE_SEL_LEN)-1)<<GLB_RC32M_EXT_CODE_SEL_POS))
#define GLB_RC32M_EXT_CODE_SEL_CGEN                             GLB_RC32M_EXT_CODE_SEL_CGEN
#define GLB_RC32M_EXT_CODE_SEL_CGEN_POS                         (17U)
#define GLB_RC32M_EXT_CODE_SEL_CGEN_LEN                         (1U)
#define GLB_RC32M_EXT_CODE_SEL_CGEN_MSK                         (((1U<<GLB_RC32M_EXT_CODE_SEL_CGEN_LEN)-1)<<GLB_RC32M_EXT_CODE_SEL_CGEN_POS)
#define GLB_RC32M_EXT_CODE_SEL_CGEN_UMSK                        (~(((1U<<GLB_RC32M_EXT_CODE_SEL_CGEN_LEN)-1)<<GLB_RC32M_EXT_CODE_SEL_CGEN_POS))
#define GLB_RC32M_RESERVED                                      GLB_RC32M_RESERVED
#define GLB_RC32M_RESERVED_POS                                  (24U)
#define GLB_RC32M_RESERVED_LEN                                  (8U)
#define GLB_RC32M_RESERVED_MSK                                  (((1U<<GLB_RC32M_RESERVED_LEN)-1)<<GLB_RC32M_RESERVED_POS)
#define GLB_RC32M_RESERVED_UMSK                                 (~(((1U<<GLB_RC32M_RESERVED_LEN)-1)<<GLB_RC32M_RESERVED_POS))

/* 0x308 : rc32k_ctrl2 */
#define GLB_RC32K_CTRL2_OFFSET                                  (0x308)
#define GLB_RC32K_DIG_CAL_DONE                                  GLB_RC32K_DIG_CAL_DONE
#define GLB_RC32K_DIG_CAL_DONE_POS                              (0U)
#define GLB_RC32K_DIG_CAL_DONE_LEN                              (1U)
#define GLB_RC32K_DIG_CAL_DONE_MSK                              (((1U<<GLB_RC32K_DIG_CAL_DONE_LEN)-1)<<GLB_RC32K_DIG_CAL_DONE_POS)
#define GLB_RC32K_DIG_CAL_DONE_UMSK                             (~(((1U<<GLB_RC32K_DIG_CAL_DONE_LEN)-1)<<GLB_RC32K_DIG_CAL_DONE_POS))
#define GLB_RC32K_RDY                                           GLB_RC32K_RDY
#define GLB_RC32K_RDY_POS                                       (1U)
#define GLB_RC32K_RDY_LEN                                       (1U)
#define GLB_RC32K_RDY_MSK                                       (((1U<<GLB_RC32K_RDY_LEN)-1)<<GLB_RC32K_RDY_POS)
#define GLB_RC32K_RDY_UMSK                                      (~(((1U<<GLB_RC32K_RDY_LEN)-1)<<GLB_RC32K_RDY_POS))
#define GLB_RC32K_DIG_CAL_INPROGRESS                            GLB_RC32K_DIG_CAL_INPROGRESS
#define GLB_RC32K_DIG_CAL_INPROGRESS_POS                        (2U)
#define GLB_RC32K_DIG_CAL_INPROGRESS_LEN                        (1U)
#define GLB_RC32K_DIG_CAL_INPROGRESS_MSK                        (((1U<<GLB_RC32K_DIG_CAL_INPROGRESS_LEN)-1)<<GLB_RC32K_DIG_CAL_INPROGRESS_POS)
#define GLB_RC32K_DIG_CAL_INPROGRESS_UMSK                       (~(((1U<<GLB_RC32K_DIG_CAL_INPROGRESS_LEN)-1)<<GLB_RC32K_DIG_CAL_INPROGRESS_POS))
#define GLB_RC32K_DIG_CAL_DIV                                   GLB_RC32K_DIG_CAL_DIV
#define GLB_RC32K_DIG_CAL_DIV_POS                               (3U)
#define GLB_RC32K_DIG_CAL_DIV_LEN                               (2U)
#define GLB_RC32K_DIG_CAL_DIV_MSK                               (((1U<<GLB_RC32K_DIG_CAL_DIV_LEN)-1)<<GLB_RC32K_DIG_CAL_DIV_POS)
#define GLB_RC32K_DIG_CAL_DIV_UMSK                              (~(((1U<<GLB_RC32K_DIG_CAL_DIV_LEN)-1)<<GLB_RC32K_DIG_CAL_DIV_POS))
#define GLB_RC32K_DIG_CAL_PRECHARGE                             GLB_RC32K_DIG_CAL_PRECHARGE
#define GLB_RC32K_DIG_CAL_PRECHARGE_POS                         (5U)
#define GLB_RC32K_DIG_CAL_PRECHARGE_LEN                         (1U)
#define GLB_RC32K_DIG_CAL_PRECHARGE_MSK                         (((1U<<GLB_RC32K_DIG_CAL_PRECHARGE_LEN)-1)<<GLB_RC32K_DIG_CAL_PRECHARGE_POS)
#define GLB_RC32K_DIG_CAL_PRECHARGE_UMSK                        (~(((1U<<GLB_RC32K_DIG_CAL_PRECHARGE_LEN)-1)<<GLB_RC32K_DIG_CAL_PRECHARGE_POS))
#define GLB_RC32K_DIG_CAP_CODE_FR_CAL                           GLB_RC32K_DIG_CAP_CODE_FR_CAL
#define GLB_RC32K_DIG_CAP_CODE_FR_CAL_POS                       (6U)
#define GLB_RC32K_DIG_CAP_CODE_FR_CAL_LEN                       (4U)
#define GLB_RC32K_DIG_CAP_CODE_FR_CAL_MSK                       (((1U<<GLB_RC32K_DIG_CAP_CODE_FR_CAL_LEN)-1)<<GLB_RC32K_DIG_CAP_CODE_FR_CAL_POS)
#define GLB_RC32K_DIG_CAP_CODE_FR_CAL_UMSK                      (~(((1U<<GLB_RC32K_DIG_CAP_CODE_FR_CAL_LEN)-1)<<GLB_RC32K_DIG_CAP_CODE_FR_CAL_POS))
#define GLB_RC32K_DIG_VREF_DLY                                  GLB_RC32K_DIG_VREF_DLY
#define GLB_RC32K_DIG_VREF_DLY_POS                              (16U)
#define GLB_RC32K_DIG_VREF_DLY_LEN                              (2U)
#define GLB_RC32K_DIG_VREF_DLY_MSK                              (((1U<<GLB_RC32K_DIG_VREF_DLY_LEN)-1)<<GLB_RC32K_DIG_VREF_DLY_POS)
#define GLB_RC32K_DIG_VREF_DLY_UMSK                             (~(((1U<<GLB_RC32K_DIG_VREF_DLY_LEN)-1)<<GLB_RC32K_DIG_VREF_DLY_POS))
#define GLB_RC32K_ALLOW_CAL                                     GLB_RC32K_ALLOW_CAL
#define GLB_RC32K_ALLOW_CAL_POS                                 (18U)
#define GLB_RC32K_ALLOW_CAL_LEN                                 (1U)
#define GLB_RC32K_ALLOW_CAL_MSK                                 (((1U<<GLB_RC32K_ALLOW_CAL_LEN)-1)<<GLB_RC32K_ALLOW_CAL_POS)
#define GLB_RC32K_ALLOW_CAL_UMSK                                (~(((1U<<GLB_RC32K_ALLOW_CAL_LEN)-1)<<GLB_RC32K_ALLOW_CAL_POS))

/* 0x50C : gpadc_reg_cmd */
#define GLB_GPADC_REG_CMD_OFFSET                                (0x50C)
#define GLB_GPADC_GLOBAL_EN                                     GLB_GPADC_GLOBAL_EN
#define GLB_GPADC_GLOBAL_EN_POS                                 (0U)
#define GLB_GPADC_GLOBAL_EN_LEN                                 (1U)
#define GLB_GPADC_GLOBAL_EN_MSK                                 (((1U<<GLB_GPADC_GLOBAL_EN_LEN)-1)<<GLB_GPADC_GLOBAL_EN_POS)
#define GLB_GPADC_GLOBAL_EN_UMSK                                (~(((1U<<GLB_GPADC_GLOBAL_EN_LEN)-1)<<GLB_GPADC_GLOBAL_EN_POS))
#define GLB_GPADC_CONV_START                                    GLB_GPADC_CONV_START
#define GLB_GPADC_CONV_START_POS                                (1U)
#define GLB_GPADC_CONV_START_LEN                                (1U)
#define GLB_GPADC_CONV_START_MSK                                (((1U<<GLB_GPADC_CONV_START_LEN)-1)<<GLB_GPADC_CONV_START_POS)
#define GLB_GPADC_CONV_START_UMSK                               (~(((1U<<GLB_GPADC_CONV_START_LEN)-1)<<GLB_GPADC_CONV_START_POS))
#define GLB_GPADC_SOFT_RST                                      GLB_GPADC_SOFT_RST
#define GLB_GPADC_SOFT_RST_POS                                  (2U)
#define GLB_GPADC_SOFT_RST_LEN                                  (1U)
#define GLB_GPADC_SOFT_RST_MSK                                  (((1U<<GLB_GPADC_SOFT_RST_LEN)-1)<<GLB_GPADC_SOFT_RST_POS)
#define GLB_GPADC_SOFT_RST_UMSK                                 (~(((1U<<GLB_GPADC_SOFT_RST_LEN)-1)<<GLB_GPADC_SOFT_RST_POS))
#define GLB_GPADC_NEG_SEL                                       GLB_GPADC_NEG_SEL
#define GLB_GPADC_NEG_SEL_POS                                   (3U)
#define GLB_GPADC_NEG_SEL_LEN                                   (5U)
#define GLB_GPADC_NEG_SEL_MSK                                   (((1U<<GLB_GPADC_NEG_SEL_LEN)-1)<<GLB_GPADC_NEG_SEL_POS)
#define GLB_GPADC_NEG_SEL_UMSK                                  (~(((1U<<GLB_GPADC_NEG_SEL_LEN)-1)<<GLB_GPADC_NEG_SEL_POS))
#define GLB_GPADC_POS_SEL                                       GLB_GPADC_POS_SEL
#define GLB_GPADC_POS_SEL_POS                                   (8U)
#define GLB_GPADC_POS_SEL_LEN                                   (5U)
#define GLB_GPADC_POS_SEL_MSK                                   (((1U<<GLB_GPADC_POS_SEL_LEN)-1)<<GLB_GPADC_POS_SEL_POS)
#define GLB_GPADC_POS_SEL_UMSK                                  (~(((1U<<GLB_GPADC_POS_SEL_LEN)-1)<<GLB_GPADC_POS_SEL_POS))
#define GLB_GPADC_NEG_GND                                       GLB_GPADC_NEG_GND
#define GLB_GPADC_NEG_GND_POS                                   (13U)
#define GLB_GPADC_NEG_GND_LEN                                   (1U)
#define GLB_GPADC_NEG_GND_MSK                                   (((1U<<GLB_GPADC_NEG_GND_LEN)-1)<<GLB_GPADC_NEG_GND_POS)
#define GLB_GPADC_NEG_GND_UMSK                                  (~(((1U<<GLB_GPADC_NEG_GND_LEN)-1)<<GLB_GPADC_NEG_GND_POS))
#define GLB_GPADC_MICBIAS_EN                                    GLB_GPADC_MICBIAS_EN
#define GLB_GPADC_MICBIAS_EN_POS                                (14U)
#define GLB_GPADC_MICBIAS_EN_LEN                                (1U)
#define GLB_GPADC_MICBIAS_EN_MSK                                (((1U<<GLB_GPADC_MICBIAS_EN_LEN)-1)<<GLB_GPADC_MICBIAS_EN_POS)
#define GLB_GPADC_MICBIAS_EN_UMSK                               (~(((1U<<GLB_GPADC_MICBIAS_EN_LEN)-1)<<GLB_GPADC_MICBIAS_EN_POS))
#define GLB_GPADC_MICPGA_EN                                     GLB_GPADC_MICPGA_EN
#define GLB_GPADC_MICPGA_EN_POS                                 (15U)
#define GLB_GPADC_MICPGA_EN_LEN                                 (1U)
#define GLB_GPADC_MICPGA_EN_MSK                                 (((1U<<GLB_GPADC_MICPGA_EN_LEN)-1)<<GLB_GPADC_MICPGA_EN_POS)
#define GLB_GPADC_MICPGA_EN_UMSK                                (~(((1U<<GLB_GPADC_MICPGA_EN_LEN)-1)<<GLB_GPADC_MICPGA_EN_POS))
#define GLB_GPADC_BYP_MICBOOST                                  GLB_GPADC_BYP_MICBOOST
#define GLB_GPADC_BYP_MICBOOST_POS                              (16U)
#define GLB_GPADC_BYP_MICBOOST_LEN                              (1U)
#define GLB_GPADC_BYP_MICBOOST_MSK                              (((1U<<GLB_GPADC_BYP_MICBOOST_LEN)-1)<<GLB_GPADC_BYP_MICBOOST_POS)
#define GLB_GPADC_BYP_MICBOOST_UMSK                             (~(((1U<<GLB_GPADC_BYP_MICBOOST_LEN)-1)<<GLB_GPADC_BYP_MICBOOST_POS))
#define GLB_GPADC_RCAL_EN                                       GLB_GPADC_RCAL_EN
#define GLB_GPADC_RCAL_EN_POS                                   (17U)
#define GLB_GPADC_RCAL_EN_LEN                                   (1U)
#define GLB_GPADC_RCAL_EN_MSK                                   (((1U<<GLB_GPADC_RCAL_EN_LEN)-1)<<GLB_GPADC_RCAL_EN_POS)
#define GLB_GPADC_RCAL_EN_UMSK                                  (~(((1U<<GLB_GPADC_RCAL_EN_LEN)-1)<<GLB_GPADC_RCAL_EN_POS))
#define GLB_GPADC_DWA_EN                                        GLB_GPADC_DWA_EN
#define GLB_GPADC_DWA_EN_POS                                    (18U)
#define GLB_GPADC_DWA_EN_LEN                                    (1U)
#define GLB_GPADC_DWA_EN_MSK                                    (((1U<<GLB_GPADC_DWA_EN_LEN)-1)<<GLB_GPADC_DWA_EN_POS)
#define GLB_GPADC_DWA_EN_UMSK                                   (~(((1U<<GLB_GPADC_DWA_EN_LEN)-1)<<GLB_GPADC_DWA_EN_POS))
#define GLB_GPADC_MIC2_DIFF                                     GLB_GPADC_MIC2_DIFF
#define GLB_GPADC_MIC2_DIFF_POS                                 (19U)
#define GLB_GPADC_MIC2_DIFF_LEN                                 (1U)
#define GLB_GPADC_MIC2_DIFF_MSK                                 (((1U<<GLB_GPADC_MIC2_DIFF_LEN)-1)<<GLB_GPADC_MIC2_DIFF_POS)
#define GLB_GPADC_MIC2_DIFF_UMSK                                (~(((1U<<GLB_GPADC_MIC2_DIFF_LEN)-1)<<GLB_GPADC_MIC2_DIFF_POS))
#define GLB_GPADC_MIC1_DIFF                                     GLB_GPADC_MIC1_DIFF
#define GLB_GPADC_MIC1_DIFF_POS                                 (20U)
#define GLB_GPADC_MIC1_DIFF_LEN                                 (1U)
#define GLB_GPADC_MIC1_DIFF_MSK                                 (((1U<<GLB_GPADC_MIC1_DIFF_LEN)-1)<<GLB_GPADC_MIC1_DIFF_POS)
#define GLB_GPADC_MIC1_DIFF_UMSK                                (~(((1U<<GLB_GPADC_MIC1_DIFF_LEN)-1)<<GLB_GPADC_MIC1_DIFF_POS))
#define GLB_GPADC_MIC_PGA2_GAIN                                 GLB_GPADC_MIC_PGA2_GAIN
#define GLB_GPADC_MIC_PGA2_GAIN_POS                             (21U)
#define GLB_GPADC_MIC_PGA2_GAIN_LEN                             (2U)
#define GLB_GPADC_MIC_PGA2_GAIN_MSK                             (((1U<<GLB_GPADC_MIC_PGA2_GAIN_LEN)-1)<<GLB_GPADC_MIC_PGA2_GAIN_POS)
#define GLB_GPADC_MIC_PGA2_GAIN_UMSK                            (~(((1U<<GLB_GPADC_MIC_PGA2_GAIN_LEN)-1)<<GLB_GPADC_MIC_PGA2_GAIN_POS))
#define GLB_GPADC_MICBOOST_32DB_EN                              GLB_GPADC_MICBOOST_32DB_EN
#define GLB_GPADC_MICBOOST_32DB_EN_POS                          (23U)
#define GLB_GPADC_MICBOOST_32DB_EN_LEN                          (1U)
#define GLB_GPADC_MICBOOST_32DB_EN_MSK                          (((1U<<GLB_GPADC_MICBOOST_32DB_EN_LEN)-1)<<GLB_GPADC_MICBOOST_32DB_EN_POS)
#define GLB_GPADC_MICBOOST_32DB_EN_UMSK                         (~(((1U<<GLB_GPADC_MICBOOST_32DB_EN_LEN)-1)<<GLB_GPADC_MICBOOST_32DB_EN_POS))
#define GLB_GPADC_CHIP_SEN_PU                                   GLB_GPADC_CHIP_SEN_PU
#define GLB_GPADC_CHIP_SEN_PU_POS                               (27U)
#define GLB_GPADC_CHIP_SEN_PU_LEN                               (1U)
#define GLB_GPADC_CHIP_SEN_PU_MSK                               (((1U<<GLB_GPADC_CHIP_SEN_PU_LEN)-1)<<GLB_GPADC_CHIP_SEN_PU_POS)
#define GLB_GPADC_CHIP_SEN_PU_UMSK                              (~(((1U<<GLB_GPADC_CHIP_SEN_PU_LEN)-1)<<GLB_GPADC_CHIP_SEN_PU_POS))
#define GLB_GPADC_SEN_SEL                                       GLB_GPADC_SEN_SEL
#define GLB_GPADC_SEN_SEL_POS                                   (28U)
#define GLB_GPADC_SEN_SEL_LEN                                   (3U)
#define GLB_GPADC_SEN_SEL_MSK                                   (((1U<<GLB_GPADC_SEN_SEL_LEN)-1)<<GLB_GPADC_SEN_SEL_POS)
#define GLB_GPADC_SEN_SEL_UMSK                                  (~(((1U<<GLB_GPADC_SEN_SEL_LEN)-1)<<GLB_GPADC_SEN_SEL_POS))
#define GLB_GPADC_SEN_TEST_EN                                   GLB_GPADC_SEN_TEST_EN
#define GLB_GPADC_SEN_TEST_EN_POS                               (31U)
#define GLB_GPADC_SEN_TEST_EN_LEN                               (1U)
#define GLB_GPADC_SEN_TEST_EN_MSK                               (((1U<<GLB_GPADC_SEN_TEST_EN_LEN)-1)<<GLB_GPADC_SEN_TEST_EN_POS)
#define GLB_GPADC_SEN_TEST_EN_UMSK                              (~(((1U<<GLB_GPADC_SEN_TEST_EN_LEN)-1)<<GLB_GPADC_SEN_TEST_EN_POS))

