bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x510 : gpadc_reg_config1 */
#define GLB_GPADC_REG_CONFIG1_OFFSET                            (0x510)
#define GLB_GPADC_CONT_CONV_EN                                  GLB_GPADC_CONT_CONV_EN
#define GLB_GPADC_CONT_CONV_EN_POS                              (1U)
#define GLB_GPADC_CONT_CONV_EN_LEN                              (1U)
#define GLB_GPADC_CONT_CONV_EN_MSK                              (((1U<<GLB_GPADC_CONT_CONV_EN_LEN)-1)<<GLB_GPADC_CONT_CONV_EN_POS)
#define GLB_GPADC_CONT_CONV_EN_UMSK                             (~(((1U<<GLB_GPADC_CONT_CONV_EN_LEN)-1)<<GLB_GPADC_CONT_CONV_EN_POS))
#define GLB_GPADC_RES_SEL                                       GLB_GPADC_RES_SEL
#define GLB_GPADC_RES_SEL_POS                                   (2U)
#define GLB_GPADC_RES_SEL_LEN                                   (3U)
#define GLB_GPADC_RES_SEL_MSK                                   (((1U<<GLB_GPADC_RES_SEL_LEN)-1)<<GLB_GPADC_RES_SEL_POS)
#define GLB_GPADC_RES_SEL_UMSK                                  (~(((1U<<GLB_GPADC_RES_SEL_LEN)-1)<<GLB_GPADC_RES_SEL_POS))
#define GLB_GPADC_VCM_SEL_EN                                    GLB_GPADC_VCM_SEL_EN
#define GLB_GPADC_VCM_SEL_EN_POS                                (8U)
#define GLB_GPADC_VCM_SEL_EN_LEN                                (1U)
#define GLB_GPADC_VCM_SEL_EN_MSK                                (((1U<<GLB_GPADC_VCM_SEL_EN_LEN)-1)<<GLB_GPADC_VCM_SEL_EN_POS)
#define GLB_GPADC_VCM_SEL_EN_UMSK                               (~(((1U<<GLB_GPADC_VCM_SEL_EN_LEN)-1)<<GLB_GPADC_VCM_SEL_EN_POS))
#define GLB_GPADC_VCM_HYST_SEL                                  GLB_GPADC_VCM_HYST_SEL
#define GLB_GPADC_VCM_HYST_SEL_POS                              (9U)
#define GLB_GPADC_VCM_HYST_SEL_LEN                              (1U)
#define GLB_GPADC_VCM_HYST_SEL_MSK                              (((1U<<GLB_GPADC_VCM_HYST_SEL_LEN)-1)<<GLB_GPADC_VCM_HYST_SEL_POS)
#define GLB_GPADC_VCM_HYST_SEL_UMSK                             (~(((1U<<GLB_GPADC_VCM_HYST_SEL_LEN)-1)<<GLB_GPADC_VCM_HYST_SEL_POS))
#define GLB_GPADC_LOWV_DET_EN                                   GLB_GPADC_LOWV_DET_EN
#define GLB_GPADC_LOWV_DET_EN_POS                               (10U)
#define GLB_GPADC_LOWV_DET_EN_LEN                               (1U)
#define GLB_GPADC_LOWV_DET_EN_MSK                               (((1U<<GLB_GPADC_LOWV_DET_EN_LEN)-1)<<GLB_GPADC_LOWV_DET_EN_POS)
#define GLB_GPADC_LOWV_DET_EN_UMSK                              (~(((1U<<GLB_GPADC_LOWV_DET_EN_LEN)-1)<<GLB_GPADC_LOWV_DET_EN_POS))
#define GLB_GPADC_PWM_TRG_EN                                    GLB_GPADC_PWM_TRG_EN
#define GLB_GPADC_PWM_TRG_EN_POS                                (11U)
#define GLB_GPADC_PWM_TRG_EN_LEN                                (1U)
#define GLB_GPADC_PWM_TRG_EN_MSK                                (((1U<<GLB_GPADC_PWM_TRG_EN_LEN)-1)<<GLB_GPADC_PWM_TRG_EN_POS)
#define GLB_GPADC_PWM_TRG_EN_UMSK                               (~(((1U<<GLB_GPADC_PWM_TRG_EN_LEN)-1)<<GLB_GPADC_PWM_TRG_EN_POS))
#define GLB_GPADC_CLK_ANA_DLY                                   GLB_GPADC_CLK_ANA_DLY
#define GLB_GPADC_CLK_ANA_DLY_POS                               (12U)
#define GLB_GPADC_CLK_ANA_DLY_LEN                               (4U)
#define GLB_GPADC_CLK_ANA_DLY_MSK                               (((1U<<GLB_GPADC_CLK_ANA_DLY_LEN)-1)<<GLB_GPADC_CLK_ANA_DLY_POS)
#define GLB_GPADC_CLK_ANA_DLY_UMSK                              (~(((1U<<GLB_GPADC_CLK_ANA_DLY_LEN)-1)<<GLB_GPADC_CLK_ANA_DLY_POS))
#define GLB_GPADC_CLK_ANA_DLY_EN                                GLB_GPADC_CLK_ANA_DLY_EN
#define GLB_GPADC_CLK_ANA_DLY_EN_POS                            (16U)
#define GLB_GPADC_CLK_ANA_DLY_EN_LEN                            (1U)
#define GLB_GPADC_CLK_ANA_DLY_EN_MSK                            (((1U<<GLB_GPADC_CLK_ANA_DLY_EN_LEN)-1)<<GLB_GPADC_CLK_ANA_DLY_EN_POS)
#define GLB_GPADC_CLK_ANA_DLY_EN_UMSK                           (~(((1U<<GLB_GPADC_CLK_ANA_DLY_EN_LEN)-1)<<GLB_GPADC_CLK_ANA_DLY_EN_POS))
#define GLB_GPADC_CLK_ANA_INV                                   GLB_GPADC_CLK_ANA_INV
#define GLB_GPADC_CLK_ANA_INV_POS                               (17U)
#define GLB_GPADC_CLK_ANA_INV_LEN                               (1U)
#define GLB_GPADC_CLK_ANA_INV_MSK                               (((1U<<GLB_GPADC_CLK_ANA_INV_LEN)-1)<<GLB_GPADC_CLK_ANA_INV_POS)
#define GLB_GPADC_CLK_ANA_INV_UMSK                              (~(((1U<<GLB_GPADC_CLK_ANA_INV_LEN)-1)<<GLB_GPADC_CLK_ANA_INV_POS))
#define GLB_GPADC_CLK_DIV_RATIO                                 GLB_GPADC_CLK_DIV_RATIO
#define GLB_GPADC_CLK_DIV_RATIO_POS                             (18U)
#define GLB_GPADC_CLK_DIV_RATIO_LEN                             (3U)
#define GLB_GPADC_CLK_DIV_RATIO_MSK                             (((1U<<GLB_GPADC_CLK_DIV_RATIO_LEN)-1)<<GLB_GPADC_CLK_DIV_RATIO_POS)
#define GLB_GPADC_CLK_DIV_RATIO_UMSK                            (~(((1U<<GLB_GPADC_CLK_DIV_RATIO_LEN)-1)<<GLB_GPADC_CLK_DIV_RATIO_POS))
#define GLB_GPADC_SCAN_LENGTH                                   GLB_GPADC_SCAN_LENGTH
#define GLB_GPADC_SCAN_LENGTH_POS                               (21U)
#define GLB_GPADC_SCAN_LENGTH_LEN                               (4U)
#define GLB_GPADC_SCAN_LENGTH_MSK                               (((1U<<GLB_GPADC_SCAN_LENGTH_LEN)-1)<<GLB_GPADC_SCAN_LENGTH_POS)
#define GLB_GPADC_SCAN_LENGTH_UMSK                              (~(((1U<<GLB_GPADC_SCAN_LENGTH_LEN)-1)<<GLB_GPADC_SCAN_LENGTH_POS))
#define GLB_GPADC_SCAN_EN                                       GLB_GPADC_SCAN_EN
#define GLB_GPADC_SCAN_EN_POS                                   (25U)
#define GLB_GPADC_SCAN_EN_LEN                                   (1U)
#define GLB_GPADC_SCAN_EN_MSK                                   (((1U<<GLB_GPADC_SCAN_EN_LEN)-1)<<GLB_GPADC_SCAN_EN_POS)
#define GLB_GPADC_SCAN_EN_UMSK                                  (~(((1U<<GLB_GPADC_SCAN_EN_LEN)-1)<<GLB_GPADC_SCAN_EN_POS))
#define GLB_GPADC_DITHER_EN                                     GLB_GPADC_DITHER_EN
#define GLB_GPADC_DITHER_EN_POS                                 (26U)
#define GLB_GPADC_DITHER_EN_LEN                                 (1U)
#define GLB_GPADC_DITHER_EN_MSK                                 (((1U<<GLB_GPADC_DITHER_EN_LEN)-1)<<GLB_GPADC_DITHER_EN_POS)
#define GLB_GPADC_DITHER_EN_UMSK                                (~(((1U<<GLB_GPADC_DITHER_EN_LEN)-1)<<GLB_GPADC_DITHER_EN_POS))
#define GLB_GPADC_V11_SEL                                       GLB_GPADC_V11_SEL
#define GLB_GPADC_V11_SEL_POS                                   (27U)
#define GLB_GPADC_V11_SEL_LEN                                   (2U)
#define GLB_GPADC_V11_SEL_MSK                                   (((1U<<GLB_GPADC_V11_SEL_LEN)-1)<<GLB_GPADC_V11_SEL_POS)
#define GLB_GPADC_V11_SEL_UMSK                                  (~(((1U<<GLB_GPADC_V11_SEL_LEN)-1)<<GLB_GPADC_V11_SEL_POS))
#define GLB_GPADC_V18_SEL                                       GLB_GPADC_V18_SEL
#define GLB_GPADC_V18_SEL_POS                                   (29U)
#define GLB_GPADC_V18_SEL_LEN                                   (2U)
#define GLB_GPADC_V18_SEL_MSK                                   (((1U<<GLB_GPADC_V18_SEL_LEN)-1)<<GLB_GPADC_V18_SEL_POS)
#define GLB_GPADC_V18_SEL_UMSK                                  (~(((1U<<GLB_GPADC_V18_SEL_LEN)-1)<<GLB_GPADC_V18_SEL_POS))

