bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x514 : gpadc_reg_config2 */
#define GLB_GPADC_REG_CONFIG2_OFFSET                            (0x514)
#define GLB_GPADC_DIFF_MODE                                     GLB_GPADC_DIFF_MODE
#define GLB_GPADC_DIFF_MODE_POS                                 (2U)
#define GLB_GPADC_DIFF_MODE_LEN                                 (1U)
#define GLB_GPADC_DIFF_MODE_MSK                                 (((1U<<GLB_GPADC_DIFF_MODE_LEN)-1)<<GLB_GPADC_DIFF_MODE_POS)
#define GLB_GPADC_DIFF_MODE_UMSK                                (~(((1U<<GLB_GPADC_DIFF_MODE_LEN)-1)<<GLB_GPADC_DIFF_MODE_POS))
#define GLB_GPADC_VREF_SEL                                      GLB_GPADC_VREF_SEL
#define GLB_GPADC_VREF_SEL_POS                                  (3U)
#define GLB_GPADC_VREF_SEL_LEN                                  (1U)
#define GLB_GPADC_VREF_SEL_MSK                                  (((1U<<GLB_GPADC_VREF_SEL_LEN)-1)<<GLB_GPADC_VREF_SEL_POS)
#define GLB_GPADC_VREF_SEL_UMSK                                 (~(((1U<<GLB_GPADC_VREF_SEL_LEN)-1)<<GLB_GPADC_VREF_SEL_POS))
#define GLB_GPADC_VBAT_EN                                       GLB_GPADC_VBAT_EN
#define GLB_GPADC_VBAT_EN_POS                                   (4U)
#define GLB_GPADC_VBAT_EN_LEN                                   (1U)
#define GLB_GPADC_VBAT_EN_MSK                                   (((1U<<GLB_GPADC_VBAT_EN_LEN)-1)<<GLB_GPADC_VBAT_EN_POS)
#define GLB_GPADC_VBAT_EN_UMSK                                  (~(((1U<<GLB_GPADC_VBAT_EN_LEN)-1)<<GLB_GPADC_VBAT_EN_POS))
#define GLB_GPADC_TSEXT_SEL                                     GLB_GPADC_TSEXT_SEL
#define GLB_GPADC_TSEXT_SEL_POS                                 (5U)
#define GLB_GPADC_TSEXT_SEL_LEN                                 (1U)
#define GLB_GPADC_TSEXT_SEL_MSK                                 (((1U<<GLB_GPADC_TSEXT_SEL_LEN)-1)<<GLB_GPADC_TSEXT_SEL_POS)
#define GLB_GPADC_TSEXT_SEL_UMSK                                (~(((1U<<GLB_GPADC_TSEXT_SEL_LEN)-1)<<GLB_GPADC_TSEXT_SEL_POS))
#define GLB_GPADC_TS_EN                                         GLB_GPADC_TS_EN
#define GLB_GPADC_TS_EN_POS                                     (6U)
#define GLB_GPADC_TS_EN_LEN                                     (1U)
#define GLB_GPADC_TS_EN_MSK                                     (((1U<<GLB_GPADC_TS_EN_LEN)-1)<<GLB_GPADC_TS_EN_POS)
#define GLB_GPADC_TS_EN_UMSK                                    (~(((1U<<GLB_GPADC_TS_EN_LEN)-1)<<GLB_GPADC_TS_EN_POS))
#define GLB_GPADC_PGA_VCM                                       GLB_GPADC_PGA_VCM
#define GLB_GPADC_PGA_VCM_POS                                   (7U)
#define GLB_GPADC_PGA_VCM_LEN                                   (2U)
#define GLB_GPADC_PGA_VCM_MSK                                   (((1U<<GLB_GPADC_PGA_VCM_LEN)-1)<<GLB_GPADC_PGA_VCM_POS)
#define GLB_GPADC_PGA_VCM_UMSK                                  (~(((1U<<GLB_GPADC_PGA_VCM_LEN)-1)<<GLB_GPADC_PGA_VCM_POS))
#define GLB_GPADC_PGA_OS_CAL                                    GLB_GPADC_PGA_OS_CAL
#define GLB_GPADC_PGA_OS_CAL_POS                                (9U)
#define GLB_GPADC_PGA_OS_CAL_LEN                                (4U)
#define GLB_GPADC_PGA_OS_CAL_MSK                                (((1U<<GLB_GPADC_PGA_OS_CAL_LEN)-1)<<GLB_GPADC_PGA_OS_CAL_POS)
#define GLB_GPADC_PGA_OS_CAL_UMSK                               (~(((1U<<GLB_GPADC_PGA_OS_CAL_LEN)-1)<<GLB_GPADC_PGA_OS_CAL_POS))
#define GLB_GPADC_PGA_EN                                        GLB_GPADC_PGA_EN
#define GLB_GPADC_PGA_EN_POS                                    (13U)
#define GLB_GPADC_PGA_EN_LEN                                    (1U)
#define GLB_GPADC_PGA_EN_MSK                                    (((1U<<GLB_GPADC_PGA_EN_LEN)-1)<<GLB_GPADC_PGA_EN_POS)
#define GLB_GPADC_PGA_EN_UMSK                                   (~(((1U<<GLB_GPADC_PGA_EN_LEN)-1)<<GLB_GPADC_PGA_EN_POS))
#define GLB_GPADC_PGA_VCMI_EN                                   GLB_GPADC_PGA_VCMI_EN
#define GLB_GPADC_PGA_VCMI_EN_POS                               (14U)
#define GLB_GPADC_PGA_VCMI_EN_LEN                               (1U)
#define GLB_GPADC_PGA_VCMI_EN_MSK                               (((1U<<GLB_GPADC_PGA_VCMI_EN_LEN)-1)<<GLB_GPADC_PGA_VCMI_EN_POS)
#define GLB_GPADC_PGA_VCMI_EN_UMSK                              (~(((1U<<GLB_GPADC_PGA_VCMI_EN_LEN)-1)<<GLB_GPADC_PGA_VCMI_EN_POS))
#define GLB_GPADC_CHOP_MODE                                     GLB_GPADC_CHOP_MODE
#define GLB_GPADC_CHOP_MODE_POS                                 (15U)
#define GLB_GPADC_CHOP_MODE_LEN                                 (2U)
#define GLB_GPADC_CHOP_MODE_MSK                                 (((1U<<GLB_GPADC_CHOP_MODE_LEN)-1)<<GLB_GPADC_CHOP_MODE_POS)
#define GLB_GPADC_CHOP_MODE_UMSK                                (~(((1U<<GLB_GPADC_CHOP_MODE_LEN)-1)<<GLB_GPADC_CHOP_MODE_POS))
#define GLB_GPADC_BIAS_SEL                                      GLB_GPADC_BIAS_SEL
#define GLB_GPADC_BIAS_SEL_POS                                  (17U)
#define GLB_GPADC_BIAS_SEL_LEN                                  (1U)
#define GLB_GPADC_BIAS_SEL_MSK                                  (((1U<<GLB_GPADC_BIAS_SEL_LEN)-1)<<GLB_GPADC_BIAS_SEL_POS)
#define GLB_GPADC_BIAS_SEL_UMSK                                 (~(((1U<<GLB_GPADC_BIAS_SEL_LEN)-1)<<GLB_GPADC_BIAS_SEL_POS))
#define GLB_GPADC_TEST_EN                                       GLB_GPADC_TEST_EN
#define GLB_GPADC_TEST_EN_POS                                   (18U)
#define GLB_GPADC_TEST_EN_LEN                                   (1U)
#define GLB_GPADC_TEST_EN_MSK                                   (((1U<<GLB_GPADC_TEST_EN_LEN)-1)<<GLB_GPADC_TEST_EN_POS)
#define GLB_GPADC_TEST_EN_UMSK                                  (~(((1U<<GLB_GPADC_TEST_EN_LEN)-1)<<GLB_GPADC_TEST_EN_POS))
#define GLB_GPADC_TEST_SEL                                      GLB_GPADC_TEST_SEL
#define GLB_GPADC_TEST_SEL_POS                                  (19U)
#define GLB_GPADC_TEST_SEL_LEN                                  (3U)
#define GLB_GPADC_TEST_SEL_MSK                                  (((1U<<GLB_GPADC_TEST_SEL_LEN)-1)<<GLB_GPADC_TEST_SEL_POS)
#define GLB_GPADC_TEST_SEL_UMSK                                 (~(((1U<<GLB_GPADC_TEST_SEL_LEN)-1)<<GLB_GPADC_TEST_SEL_POS))
#define GLB_GPADC_PGA2_GAIN                                     GLB_GPADC_PGA2_GAIN
#define GLB_GPADC_PGA2_GAIN_POS                                 (22U)
#define GLB_GPADC_PGA2_GAIN_LEN                                 (3U)
#define GLB_GPADC_PGA2_GAIN_MSK                                 (((1U<<GLB_GPADC_PGA2_GAIN_LEN)-1)<<GLB_GPADC_PGA2_GAIN_POS)
#define GLB_GPADC_PGA2_GAIN_UMSK                                (~(((1U<<GLB_GPADC_PGA2_GAIN_LEN)-1)<<GLB_GPADC_PGA2_GAIN_POS))
#define GLB_GPADC_PGA1_GAIN                                     GLB_GPADC_PGA1_GAIN
#define GLB_GPADC_PGA1_GAIN_POS                                 (25U)
#define GLB_GPADC_PGA1_GAIN_LEN                                 (3U)
#define GLB_GPADC_PGA1_GAIN_MSK                                 (((1U<<GLB_GPADC_PGA1_GAIN_LEN)-1)<<GLB_GPADC_PGA1_GAIN_POS)
#define GLB_GPADC_PGA1_GAIN_UMSK                                (~(((1U<<GLB_GPADC_PGA1_GAIN_LEN)-1)<<GLB_GPADC_PGA1_GAIN_POS))
#define GLB_GPADC_DLY_SEL                                       GLB_GPADC_DLY_SEL
#define GLB_GPADC_DLY_SEL_POS                                   (28U)
#define GLB_GPADC_DLY_SEL_LEN                                   (3U)
#define GLB_GPADC_DLY_SEL_MSK                                   (((1U<<GLB_GPADC_DLY_SEL_LEN)-1)<<GLB_GPADC_DLY_SEL_POS)
#define GLB_GPADC_DLY_SEL_UMSK                                  (~(((1U<<GLB_GPADC_DLY_SEL_LEN)-1)<<GLB_GPADC_DLY_SEL_POS))
#define GLB_GPADC_TSVBE_LOW                                     GLB_GPADC_TSVBE_LOW
#define GLB_GPADC_TSVBE_LOW_POS                                 (31U)
#define GLB_GPADC_TSVBE_LOW_LEN                                 (1U)
#define GLB_GPADC_TSVBE_LOW_MSK                                 (((1U<<GLB_GPADC_TSVBE_LOW_LEN)-1)<<GLB_GPADC_TSVBE_LOW_POS)
#define GLB_GPADC_TSVBE_LOW_UMSK                                (~(((1U<<GLB_GPADC_TSVBE_LOW_LEN)-1)<<GLB_GPADC_TSVBE_LOW_POS))

/* 0x518 : adc converation sequence 1 */
#define GLB_GPADC_REG_SCN_POS1_OFFSET                           (0x518)
#define GLB_GPADC_SCAN_POS_0                                    GLB_GPADC_SCAN_POS_0
#define GLB_GPADC_SCAN_POS_0_POS                                (0U)
#define GLB_GPADC_SCAN_POS_0_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_0_MSK                                (((1U<<GLB_GPADC_SCAN_POS_0_LEN)-1)<<GLB_GPADC_SCAN_POS_0_POS)
#define GLB_GPADC_SCAN_POS_0_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_0_LEN)-1)<<GLB_GPADC_SCAN_POS_0_POS))
#define GLB_GPADC_SCAN_POS_1                                    GLB_GPADC_SCAN_POS_1
#define GLB_GPADC_SCAN_POS_1_POS                                (5U)
#define GLB_GPADC_SCAN_POS_1_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_1_MSK                                (((1U<<GLB_GPADC_SCAN_POS_1_LEN)-1)<<GLB_GPADC_SCAN_POS_1_POS)
#define GLB_GPADC_SCAN_POS_1_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_1_LEN)-1)<<GLB_GPADC_SCAN_POS_1_POS))
#define GLB_GPADC_SCAN_POS_2                                    GLB_GPADC_SCAN_POS_2
#define GLB_GPADC_SCAN_POS_2_POS                                (10U)
#define GLB_GPADC_SCAN_POS_2_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_2_MSK                                (((1U<<GLB_GPADC_SCAN_POS_2_LEN)-1)<<GLB_GPADC_SCAN_POS_2_POS)
#define GLB_GPADC_SCAN_POS_2_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_2_LEN)-1)<<GLB_GPADC_SCAN_POS_2_POS))
#define GLB_GPADC_SCAN_POS_3                                    GLB_GPADC_SCAN_POS_3
#define GLB_GPADC_SCAN_POS_3_POS                                (15U)
#define GLB_GPADC_SCAN_POS_3_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_3_MSK                                (((1U<<GLB_GPADC_SCAN_POS_3_LEN)-1)<<GLB_GPADC_SCAN_POS_3_POS)
#define GLB_GPADC_SCAN_POS_3_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_3_LEN)-1)<<GLB_GPADC_SCAN_POS_3_POS))
#define GLB_GPADC_SCAN_POS_4                                    GLB_GPADC_SCAN_POS_4
#define GLB_GPADC_SCAN_POS_4_POS                                (20U)
#define GLB_GPADC_SCAN_POS_4_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_4_MSK                                (((1U<<GLB_GPADC_SCAN_POS_4_LEN)-1)<<GLB_GPADC_SCAN_POS_4_POS)
#define GLB_GPADC_SCAN_POS_4_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_4_LEN)-1)<<GLB_GPADC_SCAN_POS_4_POS))
#define GLB_GPADC_SCAN_POS_5                                    GLB_GPADC_SCAN_POS_5
#define GLB_GPADC_SCAN_POS_5_POS                                (25U)
#define GLB_GPADC_SCAN_POS_5_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_5_MSK                                (((1U<<GLB_GPADC_SCAN_POS_5_LEN)-1)<<GLB_GPADC_SCAN_POS_5_POS)
#define GLB_GPADC_SCAN_POS_5_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_5_LEN)-1)<<GLB_GPADC_SCAN_POS_5_POS))

/* 0x51C : adc converation sequence 2 */
#define GLB_GPADC_REG_SCN_POS2_OFFSET                           (0x51C)
#define GLB_GPADC_SCAN_POS_6                                    GLB_GPADC_SCAN_POS_6
#define GLB_GPADC_SCAN_POS_6_POS                                (0U)
#define GLB_GPADC_SCAN_POS_6_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_6_MSK                                (((1U<<GLB_GPADC_SCAN_POS_6_LEN)-1)<<GLB_GPADC_SCAN_POS_6_POS)
#define GLB_GPADC_SCAN_POS_6_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_6_LEN)-1)<<GLB_GPADC_SCAN_POS_6_POS))
#define GLB_GPADC_SCAN_POS_7                                    GLB_GPADC_SCAN_POS_7
#define GLB_GPADC_SCAN_POS_7_POS                                (5U)
#define GLB_GPADC_SCAN_POS_7_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_7_MSK                                (((1U<<GLB_GPADC_SCAN_POS_7_LEN)-1)<<GLB_GPADC_SCAN_POS_7_POS)
#define GLB_GPADC_SCAN_POS_7_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_7_LEN)-1)<<GLB_GPADC_SCAN_POS_7_POS))
#define GLB_GPADC_SCAN_POS_8                                    GLB_GPADC_SCAN_POS_8
#define GLB_GPADC_SCAN_POS_8_POS                                (10U)
#define GLB_GPADC_SCAN_POS_8_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_8_MSK                                (((1U<<GLB_GPADC_SCAN_POS_8_LEN)-1)<<GLB_GPADC_SCAN_POS_8_POS)
#define GLB_GPADC_SCAN_POS_8_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_8_LEN)-1)<<GLB_GPADC_SCAN_POS_8_POS))
#define GLB_GPADC_SCAN_POS_9                                    GLB_GPADC_SCAN_POS_9
#define GLB_GPADC_SCAN_POS_9_POS                                (15U)
#define GLB_GPADC_SCAN_POS_9_LEN                                (5U)
#define GLB_GPADC_SCAN_POS_9_MSK                                (((1U<<GLB_GPADC_SCAN_POS_9_LEN)-1)<<GLB_GPADC_SCAN_POS_9_POS)
#define GLB_GPADC_SCAN_POS_9_UMSK                               (~(((1U<<GLB_GPADC_SCAN_POS_9_LEN)-1)<<GLB_GPADC_SCAN_POS_9_POS))
#define GLB_GPADC_SCAN_POS_10                                   GLB_GPADC_SCAN_POS_10
#define GLB_GPADC_SCAN_POS_10_POS                               (20U)
#define GLB_GPADC_SCAN_POS_10_LEN                               (5U)
#define GLB_GPADC_SCAN_POS_10_MSK                               (((1U<<GLB_GPADC_SCAN_POS_10_LEN)-1)<<GLB_GPADC_SCAN_POS_10_POS)
#define GLB_GPADC_SCAN_POS_10_UMSK                              (~(((1U<<GLB_GPADC_SCAN_POS_10_LEN)-1)<<GLB_GPADC_SCAN_POS_10_POS))
#define GLB_GPADC_SCAN_POS_11                                   GLB_GPADC_SCAN_POS_11
#define GLB_GPADC_SCAN_POS_11_POS                               (25U)
#define GLB_GPADC_SCAN_POS_11_LEN                               (5U)
#define GLB_GPADC_SCAN_POS_11_MSK                               (((1U<<GLB_GPADC_SCAN_POS_11_LEN)-1)<<GLB_GPADC_SCAN_POS_11_POS)
#define GLB_GPADC_SCAN_POS_11_UMSK                              (~(((1U<<GLB_GPADC_SCAN_POS_11_LEN)-1)<<GLB_GPADC_SCAN_POS_11_POS))

/* 0x520 : adc converation sequence 3 */
#define GLB_GPADC_REG_SCN_NEG1_OFFSET                           (0x520)
#define GLB_GPADC_SCAN_NEG_0                                    GLB_GPADC_SCAN_NEG_0
#define GLB_GPADC_SCAN_NEG_0_POS                                (0U)
#define GLB_GPADC_SCAN_NEG_0_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_0_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_0_LEN)-1)<<GLB_GPADC_SCAN_NEG_0_POS)
#define GLB_GPADC_SCAN_NEG_0_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_0_LEN)-1)<<GLB_GPADC_SCAN_NEG_0_POS))
#define GLB_GPADC_SCAN_NEG_1                                    GLB_GPADC_SCAN_NEG_1
#define GLB_GPADC_SCAN_NEG_1_POS                                (5U)
#define GLB_GPADC_SCAN_NEG_1_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_1_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_1_LEN)-1)<<GLB_GPADC_SCAN_NEG_1_POS)
#define GLB_GPADC_SCAN_NEG_1_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_1_LEN)-1)<<GLB_GPADC_SCAN_NEG_1_POS))
#define GLB_GPADC_SCAN_NEG_2                                    GLB_GPADC_SCAN_NEG_2
#define GLB_GPADC_SCAN_NEG_2_POS                                (10U)
#define GLB_GPADC_SCAN_NEG_2_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_2_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_2_LEN)-1)<<GLB_GPADC_SCAN_NEG_2_POS)
#define GLB_GPADC_SCAN_NEG_2_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_2_LEN)-1)<<GLB_GPADC_SCAN_NEG_2_POS))
#define GLB_GPADC_SCAN_NEG_3                                    GLB_GPADC_SCAN_NEG_3
#define GLB_GPADC_SCAN_NEG_3_POS                                (15U)
#define GLB_GPADC_SCAN_NEG_3_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_3_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_3_LEN)-1)<<GLB_GPADC_SCAN_NEG_3_POS)
#define GLB_GPADC_SCAN_NEG_3_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_3_LEN)-1)<<GLB_GPADC_SCAN_NEG_3_POS))
#define GLB_GPADC_SCAN_NEG_4                                    GLB_GPADC_SCAN_NEG_4
#define GLB_GPADC_SCAN_NEG_4_POS                                (20U)
#define GLB_GPADC_SCAN_NEG_4_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_4_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_4_LEN)-1)<<GLB_GPADC_SCAN_NEG_4_POS)
#define GLB_GPADC_SCAN_NEG_4_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_4_LEN)-1)<<GLB_GPADC_SCAN_NEG_4_POS))
#define GLB_GPADC_SCAN_NEG_5                                    GLB_GPADC_SCAN_NEG_5
#define GLB_GPADC_SCAN_NEG_5_POS                                (25U)
#define GLB_GPADC_SCAN_NEG_5_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_5_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_5_LEN)-1)<<GLB_GPADC_SCAN_NEG_5_POS)
#define GLB_GPADC_SCAN_NEG_5_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_5_LEN)-1)<<GLB_GPADC_SCAN_NEG_5_POS))

/* 0x524 : adc converation sequence 4 */
#define GLB_GPADC_REG_SCN_NEG2_OFFSET                           (0x524)
#define GLB_GPADC_SCAN_NEG_6                                    GLB_GPADC_SCAN_NEG_6
#define GLB_GPADC_SCAN_NEG_6_POS                                (0U)
#define GLB_GPADC_SCAN_NEG_6_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_6_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_6_LEN)-1)<<GLB_GPADC_SCAN_NEG_6_POS)
#define GLB_GPADC_SCAN_NEG_6_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_6_LEN)-1)<<GLB_GPADC_SCAN_NEG_6_POS))
#define GLB_GPADC_SCAN_NEG_7                                    GLB_GPADC_SCAN_NEG_7
#define GLB_GPADC_SCAN_NEG_7_POS                                (5U)
#define GLB_GPADC_SCAN_NEG_7_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_7_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_7_LEN)-1)<<GLB_GPADC_SCAN_NEG_7_POS)
#define GLB_GPADC_SCAN_NEG_7_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_7_LEN)-1)<<GLB_GPADC_SCAN_NEG_7_POS))
#define GLB_GPADC_SCAN_NEG_8                                    GLB_GPADC_SCAN_NEG_8
#define GLB_GPADC_SCAN_NEG_8_POS                                (10U)
#define GLB_GPADC_SCAN_NEG_8_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_8_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_8_LEN)-1)<<GLB_GPADC_SCAN_NEG_8_POS)
#define GLB_GPADC_SCAN_NEG_8_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_8_LEN)-1)<<GLB_GPADC_SCAN_NEG_8_POS))
#define GLB_GPADC_SCAN_NEG_9                                    GLB_GPADC_SCAN_NEG_9
#define GLB_GPADC_SCAN_NEG_9_POS                                (15U)
#define GLB_GPADC_SCAN_NEG_9_LEN                                (5U)
#define GLB_GPADC_SCAN_NEG_9_MSK                                (((1U<<GLB_GPADC_SCAN_NEG_9_LEN)-1)<<GLB_GPADC_SCAN_NEG_9_POS)
#define GLB_GPADC_SCAN_NEG_9_UMSK                               (~(((1U<<GLB_GPADC_SCAN_NEG_9_LEN)-1)<<GLB_GPADC_SCAN_NEG_9_POS))
#define GLB_GPADC_SCAN_NEG_10                                   GLB_GPADC_SCAN_NEG_10
#define GLB_GPADC_SCAN_NEG_10_POS                               (20U)
#define GLB_GPADC_SCAN_NEG_10_LEN                               (5U)
#define GLB_GPADC_SCAN_NEG_10_MSK                               (((1U<<GLB_GPADC_SCAN_NEG_10_LEN)-1)<<GLB_GPADC_SCAN_NEG_10_POS)
#define GLB_GPADC_SCAN_NEG_10_UMSK                              (~(((1U<<GLB_GPADC_SCAN_NEG_10_LEN)-1)<<GLB_GPADC_SCAN_NEG_10_POS))
#define GLB_GPADC_SCAN_NEG_11                                   GLB_GPADC_SCAN_NEG_11
#define GLB_GPADC_SCAN_NEG_11_POS                               (25U)
#define GLB_GPADC_SCAN_NEG_11_LEN                               (5U)
#define GLB_GPADC_SCAN_NEG_11_MSK                               (((1U<<GLB_GPADC_SCAN_NEG_11_LEN)-1)<<GLB_GPADC_SCAN_NEG_11_POS)
#define GLB_GPADC_SCAN_NEG_11_UMSK                              (~(((1U<<GLB_GPADC_SCAN_NEG_11_LEN)-1)<<GLB_GPADC_SCAN_NEG_11_POS))

