bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0x528 : gpadc_reg_status */
#define GLB_GPADC_REG_STATUS_OFFSET                             (0x528)
#define GLB_GPADC_DATA_RDY                                      GLB_GPADC_DATA_RDY
#define GLB_GPADC_DATA_RDY_POS                                  (0U)
#define GLB_GPADC_DATA_RDY_LEN                                  (1U)
#define GLB_GPADC_DATA_RDY_MSK                                  (((1U<<GLB_GPADC_DATA_RDY_LEN)-1)<<GLB_GPADC_DATA_RDY_POS)
#define GLB_GPADC_DATA_RDY_UMSK                                 (~(((1U<<GLB_GPADC_DATA_RDY_LEN)-1)<<GLB_GPADC_DATA_RDY_POS))
#define GLB_GPADC_RESERVED                                      GLB_GPADC_RESERVED
#define GLB_GPADC_RESERVED_POS                                  (16U)
#define GLB_GPADC_RESERVED_LEN                                  (16U)
#define GLB_GPADC_RESERVED_MSK                                  (((1U<<GLB_GPADC_RESERVED_LEN)-1)<<GLB_GPADC_RESERVED_POS)
#define GLB_GPADC_RESERVED_UMSK                                 (~(((1U<<GLB_GPADC_RESERVED_LEN)-1)<<GLB_GPADC_RESERVED_POS))

/* 0x52C : gpadc_reg_isr */
#define GLB_GPADC_REG_ISR_OFFSET                                (0x52C)
#define GLB_GPADC_NEG_SATUR                                     GLB_GPADC_NEG_SATUR
#define GLB_GPADC_NEG_SATUR_POS                                 (0U)
#define GLB_GPADC_NEG_SATUR_LEN                                 (1U)
#define GLB_GPADC_NEG_SATUR_MSK                                 (((1U<<GLB_GPADC_NEG_SATUR_LEN)-1)<<GLB_GPADC_NEG_SATUR_POS)
#define GLB_GPADC_NEG_SATUR_UMSK                                (~(((1U<<GLB_GPADC_NEG_SATUR_LEN)-1)<<GLB_GPADC_NEG_SATUR_POS))
#define GLB_GPADC_POS_SATUR                                     GLB_GPADC_POS_SATUR
#define GLB_GPADC_POS_SATUR_POS                                 (1U)
#define GLB_GPADC_POS_SATUR_LEN                                 (1U)
#define GLB_GPADC_POS_SATUR_MSK                                 (((1U<<GLB_GPADC_POS_SATUR_LEN)-1)<<GLB_GPADC_POS_SATUR_POS)
#define GLB_GPADC_POS_SATUR_UMSK                                (~(((1U<<GLB_GPADC_POS_SATUR_LEN)-1)<<GLB_GPADC_POS_SATUR_POS))
#define GLB_GPADC_NEG_SATUR_CLR                                 GLB_GPADC_NEG_SATUR_CLR
#define GLB_GPADC_NEG_SATUR_CLR_POS                             (4U)
#define GLB_GPADC_NEG_SATUR_CLR_LEN                             (1U)
#define GLB_GPADC_NEG_SATUR_CLR_MSK                             (((1U<<GLB_GPADC_NEG_SATUR_CLR_LEN)-1)<<GLB_GPADC_NEG_SATUR_CLR_POS)
#define GLB_GPADC_NEG_SATUR_CLR_UMSK                            (~(((1U<<GLB_GPADC_NEG_SATUR_CLR_LEN)-1)<<GLB_GPADC_NEG_SATUR_CLR_POS))
#define GLB_GPADC_POS_SATUR_CLR                                 GLB_GPADC_POS_SATUR_CLR
#define GLB_GPADC_POS_SATUR_CLR_POS                             (5U)
#define GLB_GPADC_POS_SATUR_CLR_LEN                             (1U)
#define GLB_GPADC_POS_SATUR_CLR_MSK                             (((1U<<GLB_GPADC_POS_SATUR_CLR_LEN)-1)<<GLB_GPADC_POS_SATUR_CLR_POS)
#define GLB_GPADC_POS_SATUR_CLR_UMSK                            (~(((1U<<GLB_GPADC_POS_SATUR_CLR_LEN)-1)<<GLB_GPADC_POS_SATUR_CLR_POS))
#define GLB_GPADC_NEG_SATUR_MASK                                GLB_GPADC_NEG_SATUR_MASK
#define GLB_GPADC_NEG_SATUR_MASK_POS                            (8U)
#define GLB_GPADC_NEG_SATUR_MASK_LEN                            (1U)
#define GLB_GPADC_NEG_SATUR_MASK_MSK                            (((1U<<GLB_GPADC_NEG_SATUR_MASK_LEN)-1)<<GLB_GPADC_NEG_SATUR_MASK_POS)
#define GLB_GPADC_NEG_SATUR_MASK_UMSK                           (~(((1U<<GLB_GPADC_NEG_SATUR_MASK_LEN)-1)<<GLB_GPADC_NEG_SATUR_MASK_POS))
#define GLB_GPADC_POS_SATUR_MASK                                GLB_GPADC_POS_SATUR_MASK
#define GLB_GPADC_POS_SATUR_MASK_POS                            (9U)
#define GLB_GPADC_POS_SATUR_MASK_LEN                            (1U)
#define GLB_GPADC_POS_SATUR_MASK_MSK                            (((1U<<GLB_GPADC_POS_SATUR_MASK_LEN)-1)<<GLB_GPADC_POS_SATUR_MASK_POS)
#define GLB_GPADC_POS_SATUR_MASK_UMSK                           (~(((1U<<GLB_GPADC_POS_SATUR_MASK_LEN)-1)<<GLB_GPADC_POS_SATUR_MASK_POS))

/* 0x530 : gpadc_reg_result */
#define GLB_GPADC_REG_RESULT_OFFSET                             (0x530)
#define GLB_GPADC_DATA_OUT                                      GLB_GPADC_DATA_OUT
#define GLB_GPADC_DATA_OUT_POS                                  (0U)
#define GLB_GPADC_DATA_OUT_LEN                                  (26U)
#define GLB_GPADC_DATA_OUT_MSK                                  (((1U<<GLB_GPADC_DATA_OUT_LEN)-1)<<GLB_GPADC_DATA_OUT_POS)
#define GLB_GPADC_DATA_OUT_UMSK                                 (~(((1U<<GLB_GPADC_DATA_OUT_LEN)-1)<<GLB_GPADC_DATA_OUT_POS))

/* 0x534 : gpadc_reg_raw_result */
#define GLB_GPADC_REG_RAW_RESULT_OFFSET                         (0x534)
#define GLB_GPADC_RAW_DATA                                      GLB_GPADC_RAW_DATA
#define GLB_GPADC_RAW_DATA_POS                                  (0U)
#define GLB_GPADC_RAW_DATA_LEN                                  (12U)
#define GLB_GPADC_RAW_DATA_MSK                                  (((1U<<GLB_GPADC_RAW_DATA_LEN)-1)<<GLB_GPADC_RAW_DATA_POS)
#define GLB_GPADC_RAW_DATA_UMSK                                 (~(((1U<<GLB_GPADC_RAW_DATA_LEN)-1)<<GLB_GPADC_RAW_DATA_POS))

/* 0x538 : gpadc_reg_define */
#define GLB_GPADC_REG_DEFINE_OFFSET                             (0x538)
#define GLB_GPADC_OS_CAL_DATA                                   GLB_GPADC_OS_CAL_DATA
#define GLB_GPADC_OS_CAL_DATA_POS                               (0U)
#define GLB_GPADC_OS_CAL_DATA_LEN                               (16U)
#define GLB_GPADC_OS_CAL_DATA_MSK                               (((1U<<GLB_GPADC_OS_CAL_DATA_LEN)-1)<<GLB_GPADC_OS_CAL_DATA_POS)
#define GLB_GPADC_OS_CAL_DATA_UMSK                              (~(((1U<<GLB_GPADC_OS_CAL_DATA_LEN)-1)<<GLB_GPADC_OS_CAL_DATA_POS))

/* 0xF00 : tzc_glb_ctrl_0 */
#define GLB_TZC_GLB_CTRL_0_OFFSET                               (0xF00)
#define GLB_TZC_GLB_SWRST_S00_LOCK                              GLB_TZC_GLB_SWRST_S00_LOCK
#define GLB_TZC_GLB_SWRST_S00_LOCK_POS                          (0U)
#define GLB_TZC_GLB_SWRST_S00_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S00_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S00_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S00_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S00_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S00_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S00_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S01_LOCK                              GLB_TZC_GLB_SWRST_S01_LOCK
#define GLB_TZC_GLB_SWRST_S01_LOCK_POS                          (1U)
#define GLB_TZC_GLB_SWRST_S01_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S01_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S01_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S01_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S01_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S01_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S01_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S30_LOCK                              GLB_TZC_GLB_SWRST_S30_LOCK
#define GLB_TZC_GLB_SWRST_S30_LOCK_POS                          (8U)
#define GLB_TZC_GLB_SWRST_S30_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S30_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S30_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S30_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S30_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S30_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S30_LOCK_POS))
#define GLB_TZC_GLB_CTRL_PWRON_RST_LOCK                         GLB_TZC_GLB_CTRL_PWRON_RST_LOCK
#define GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_POS                     (12U)
#define GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_LEN                     (1U)
#define GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_MSK                     (((1U<<GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_POS)
#define GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_UMSK                    (~(((1U<<GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_PWRON_RST_LOCK_POS))
#define GLB_TZC_GLB_CTRL_CPU_RESET_LOCK                         GLB_TZC_GLB_CTRL_CPU_RESET_LOCK
#define GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_POS                     (13U)
#define GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_LEN                     (1U)
#define GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_MSK                     (((1U<<GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_POS)
#define GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_UMSK                    (~(((1U<<GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_CPU_RESET_LOCK_POS))
#define GLB_TZC_GLB_CTRL_SYS_RESET_LOCK                         GLB_TZC_GLB_CTRL_SYS_RESET_LOCK
#define GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_POS                     (14U)
#define GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_LEN                     (1U)
#define GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_MSK                     (((1U<<GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_POS)
#define GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_UMSK                    (~(((1U<<GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_SYS_RESET_LOCK_POS))
#define GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK                        GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK
#define GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_POS                    (15U)
#define GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_LEN                    (1U)
#define GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_MSK                    (((1U<<GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_POS)
#define GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_UMSK                   (~(((1U<<GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_LEN)-1)<<GLB_TZC_GLB_CTRL_UNGATED_AP_LOCK_POS))
#define GLB_TZC_GLB_MISC_LOCK                                   GLB_TZC_GLB_MISC_LOCK
#define GLB_TZC_GLB_MISC_LOCK_POS                               (25U)
#define GLB_TZC_GLB_MISC_LOCK_LEN                               (1U)
#define GLB_TZC_GLB_MISC_LOCK_MSK                               (((1U<<GLB_TZC_GLB_MISC_LOCK_LEN)-1)<<GLB_TZC_GLB_MISC_LOCK_POS)
#define GLB_TZC_GLB_MISC_LOCK_UMSK                              (~(((1U<<GLB_TZC_GLB_MISC_LOCK_LEN)-1)<<GLB_TZC_GLB_MISC_LOCK_POS))
#define GLB_TZC_GLB_SRAM_LOCK                                   GLB_TZC_GLB_SRAM_LOCK
#define GLB_TZC_GLB_SRAM_LOCK_POS                               (26U)
#define GLB_TZC_GLB_SRAM_LOCK_LEN                               (1U)
#define GLB_TZC_GLB_SRAM_LOCK_MSK                               (((1U<<GLB_TZC_GLB_SRAM_LOCK_LEN)-1)<<GLB_TZC_GLB_SRAM_LOCK_POS)
#define GLB_TZC_GLB_SRAM_LOCK_UMSK                              (~(((1U<<GLB_TZC_GLB_SRAM_LOCK_LEN)-1)<<GLB_TZC_GLB_SRAM_LOCK_POS))
#define GLB_TZC_GLB_L2C_LOCK                                    GLB_TZC_GLB_L2C_LOCK
#define GLB_TZC_GLB_L2C_LOCK_POS                                (27U)
#define GLB_TZC_GLB_L2C_LOCK_LEN                                (1U)
#define GLB_TZC_GLB_L2C_LOCK_MSK                                (((1U<<GLB_TZC_GLB_L2C_LOCK_LEN)-1)<<GLB_TZC_GLB_L2C_LOCK_POS)
#define GLB_TZC_GLB_L2C_LOCK_UMSK                               (~(((1U<<GLB_TZC_GLB_L2C_LOCK_LEN)-1)<<GLB_TZC_GLB_L2C_LOCK_POS))
#define GLB_TZC_GLB_BMX_LOCK                                    GLB_TZC_GLB_BMX_LOCK
#define GLB_TZC_GLB_BMX_LOCK_POS                                (28U)
#define GLB_TZC_GLB_BMX_LOCK_LEN                                (1U)
#define GLB_TZC_GLB_BMX_LOCK_MSK                                (((1U<<GLB_TZC_GLB_BMX_LOCK_LEN)-1)<<GLB_TZC_GLB_BMX_LOCK_POS)
#define GLB_TZC_GLB_BMX_LOCK_UMSK                               (~(((1U<<GLB_TZC_GLB_BMX_LOCK_LEN)-1)<<GLB_TZC_GLB_BMX_LOCK_POS))
#define GLB_TZC_GLB_DBG_LOCK                                    GLB_TZC_GLB_DBG_LOCK
#define GLB_TZC_GLB_DBG_LOCK_POS                                (29U)
#define GLB_TZC_GLB_DBG_LOCK_LEN                                (1U)
#define GLB_TZC_GLB_DBG_LOCK_MSK                                (((1U<<GLB_TZC_GLB_DBG_LOCK_LEN)-1)<<GLB_TZC_GLB_DBG_LOCK_POS)
#define GLB_TZC_GLB_DBG_LOCK_UMSK                               (~(((1U<<GLB_TZC_GLB_DBG_LOCK_LEN)-1)<<GLB_TZC_GLB_DBG_LOCK_POS))
#define GLB_TZC_GLB_MBIST_LOCK                                  GLB_TZC_GLB_MBIST_LOCK
#define GLB_TZC_GLB_MBIST_LOCK_POS                              (30U)
#define GLB_TZC_GLB_MBIST_LOCK_LEN                              (1U)
#define GLB_TZC_GLB_MBIST_LOCK_MSK                              (((1U<<GLB_TZC_GLB_MBIST_LOCK_LEN)-1)<<GLB_TZC_GLB_MBIST_LOCK_POS)
#define GLB_TZC_GLB_MBIST_LOCK_UMSK                             (~(((1U<<GLB_TZC_GLB_MBIST_LOCK_LEN)-1)<<GLB_TZC_GLB_MBIST_LOCK_POS))
#define GLB_TZC_GLB_CLK_LOCK                                    GLB_TZC_GLB_CLK_LOCK
#define GLB_TZC_GLB_CLK_LOCK_POS                                (31U)
#define GLB_TZC_GLB_CLK_LOCK_LEN                                (1U)
#define GLB_TZC_GLB_CLK_LOCK_MSK                                (((1U<<GLB_TZC_GLB_CLK_LOCK_LEN)-1)<<GLB_TZC_GLB_CLK_LOCK_POS)
#define GLB_TZC_GLB_CLK_LOCK_UMSK                               (~(((1U<<GLB_TZC_GLB_CLK_LOCK_LEN)-1)<<GLB_TZC_GLB_CLK_LOCK_POS))

