bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0xF04 : tzc_glb_ctrl_1 */
#define GLB_TZC_GLB_CTRL_1_OFFSET                               (0xF04)
#define GLB_TZC_GLB_SWRST_S20_LOCK                              GLB_TZC_GLB_SWRST_S20_LOCK
#define GLB_TZC_GLB_SWRST_S20_LOCK_POS                          (0U)
#define GLB_TZC_GLB_SWRST_S20_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S20_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S20_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S20_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S20_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S20_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S20_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S21_LOCK                              GLB_TZC_GLB_SWRST_S21_LOCK
#define GLB_TZC_GLB_SWRST_S21_LOCK_POS                          (1U)
#define GLB_TZC_GLB_SWRST_S21_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S21_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S21_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S21_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S21_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S21_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S21_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S22_LOCK                              GLB_TZC_GLB_SWRST_S22_LOCK
#define GLB_TZC_GLB_SWRST_S22_LOCK_POS                          (2U)
#define GLB_TZC_GLB_SWRST_S22_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S22_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S22_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S22_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S22_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S22_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S22_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S23_LOCK                              GLB_TZC_GLB_SWRST_S23_LOCK
#define GLB_TZC_GLB_SWRST_S23_LOCK_POS                          (3U)
#define GLB_TZC_GLB_SWRST_S23_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S23_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S23_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S23_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S23_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S23_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S23_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S24_LOCK                              GLB_TZC_GLB_SWRST_S24_LOCK
#define GLB_TZC_GLB_SWRST_S24_LOCK_POS                          (4U)
#define GLB_TZC_GLB_SWRST_S24_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S24_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S24_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S24_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S24_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S24_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S24_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S25_LOCK                              GLB_TZC_GLB_SWRST_S25_LOCK
#define GLB_TZC_GLB_SWRST_S25_LOCK_POS                          (5U)
#define GLB_TZC_GLB_SWRST_S25_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S25_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S25_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S25_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S25_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S25_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S25_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S26_LOCK                              GLB_TZC_GLB_SWRST_S26_LOCK
#define GLB_TZC_GLB_SWRST_S26_LOCK_POS                          (6U)
#define GLB_TZC_GLB_SWRST_S26_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S26_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S26_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S26_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S26_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S26_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S26_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S27_LOCK                              GLB_TZC_GLB_SWRST_S27_LOCK
#define GLB_TZC_GLB_SWRST_S27_LOCK_POS                          (7U)
#define GLB_TZC_GLB_SWRST_S27_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S27_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S27_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S27_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S27_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S27_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S27_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S28_LOCK                              GLB_TZC_GLB_SWRST_S28_LOCK
#define GLB_TZC_GLB_SWRST_S28_LOCK_POS                          (8U)
#define GLB_TZC_GLB_SWRST_S28_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S28_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S28_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S28_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S28_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S28_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S28_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S29_LOCK                              GLB_TZC_GLB_SWRST_S29_LOCK
#define GLB_TZC_GLB_SWRST_S29_LOCK_POS                          (9U)
#define GLB_TZC_GLB_SWRST_S29_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S29_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S29_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S29_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S29_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S29_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S29_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2A_LOCK                              GLB_TZC_GLB_SWRST_S2A_LOCK
#define GLB_TZC_GLB_SWRST_S2A_LOCK_POS                          (10U)
#define GLB_TZC_GLB_SWRST_S2A_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2A_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2A_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2A_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2A_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2A_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2A_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2B_LOCK                              GLB_TZC_GLB_SWRST_S2B_LOCK
#define GLB_TZC_GLB_SWRST_S2B_LOCK_POS                          (11U)
#define GLB_TZC_GLB_SWRST_S2B_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2B_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2B_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2B_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2B_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2B_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2B_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2C_LOCK                              GLB_TZC_GLB_SWRST_S2C_LOCK
#define GLB_TZC_GLB_SWRST_S2C_LOCK_POS                          (12U)
#define GLB_TZC_GLB_SWRST_S2C_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2C_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2C_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2C_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2C_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2C_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2C_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2D_LOCK                              GLB_TZC_GLB_SWRST_S2D_LOCK
#define GLB_TZC_GLB_SWRST_S2D_LOCK_POS                          (13U)
#define GLB_TZC_GLB_SWRST_S2D_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2D_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2D_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2D_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2D_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2D_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2D_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2E_LOCK                              GLB_TZC_GLB_SWRST_S2E_LOCK
#define GLB_TZC_GLB_SWRST_S2E_LOCK_POS                          (14U)
#define GLB_TZC_GLB_SWRST_S2E_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2E_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2E_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2E_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2E_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2E_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2E_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S2F_LOCK                              GLB_TZC_GLB_SWRST_S2F_LOCK
#define GLB_TZC_GLB_SWRST_S2F_LOCK_POS                          (15U)
#define GLB_TZC_GLB_SWRST_S2F_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S2F_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S2F_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2F_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S2F_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S2F_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S2F_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S10_LOCK                              GLB_TZC_GLB_SWRST_S10_LOCK
#define GLB_TZC_GLB_SWRST_S10_LOCK_POS                          (16U)
#define GLB_TZC_GLB_SWRST_S10_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S10_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S10_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S10_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S10_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S10_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S10_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S11_LOCK                              GLB_TZC_GLB_SWRST_S11_LOCK
#define GLB_TZC_GLB_SWRST_S11_LOCK_POS                          (17U)
#define GLB_TZC_GLB_SWRST_S11_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S11_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S11_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S11_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S11_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S11_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S11_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S12_LOCK                              GLB_TZC_GLB_SWRST_S12_LOCK
#define GLB_TZC_GLB_SWRST_S12_LOCK_POS                          (18U)
#define GLB_TZC_GLB_SWRST_S12_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S12_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S12_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S12_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S12_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S12_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S12_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S13_LOCK                              GLB_TZC_GLB_SWRST_S13_LOCK
#define GLB_TZC_GLB_SWRST_S13_LOCK_POS                          (19U)
#define GLB_TZC_GLB_SWRST_S13_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S13_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S13_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S13_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S13_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S13_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S13_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S14_LOCK                              GLB_TZC_GLB_SWRST_S14_LOCK
#define GLB_TZC_GLB_SWRST_S14_LOCK_POS                          (20U)
#define GLB_TZC_GLB_SWRST_S14_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S14_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S14_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S14_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S14_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S14_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S14_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S15_LOCK                              GLB_TZC_GLB_SWRST_S15_LOCK
#define GLB_TZC_GLB_SWRST_S15_LOCK_POS                          (21U)
#define GLB_TZC_GLB_SWRST_S15_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S15_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S15_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S15_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S15_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S15_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S15_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S16_LOCK                              GLB_TZC_GLB_SWRST_S16_LOCK
#define GLB_TZC_GLB_SWRST_S16_LOCK_POS                          (22U)
#define GLB_TZC_GLB_SWRST_S16_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S16_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S16_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S16_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S16_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S16_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S16_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S17_LOCK                              GLB_TZC_GLB_SWRST_S17_LOCK
#define GLB_TZC_GLB_SWRST_S17_LOCK_POS                          (23U)
#define GLB_TZC_GLB_SWRST_S17_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S17_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S17_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S17_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S17_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S17_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S17_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S18_LOCK                              GLB_TZC_GLB_SWRST_S18_LOCK
#define GLB_TZC_GLB_SWRST_S18_LOCK_POS                          (24U)
#define GLB_TZC_GLB_SWRST_S18_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S18_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S18_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S18_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S18_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S18_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S18_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S19_LOCK                              GLB_TZC_GLB_SWRST_S19_LOCK
#define GLB_TZC_GLB_SWRST_S19_LOCK_POS                          (25U)
#define GLB_TZC_GLB_SWRST_S19_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S19_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S19_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S19_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S19_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S19_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S19_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1A_LOCK                              GLB_TZC_GLB_SWRST_S1A_LOCK
#define GLB_TZC_GLB_SWRST_S1A_LOCK_POS                          (26U)
#define GLB_TZC_GLB_SWRST_S1A_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1A_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1A_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1A_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1A_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1A_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1A_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1B_LOCK                              GLB_TZC_GLB_SWRST_S1B_LOCK
#define GLB_TZC_GLB_SWRST_S1B_LOCK_POS                          (27U)
#define GLB_TZC_GLB_SWRST_S1B_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1B_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1B_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1B_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1B_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1B_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1B_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1C_LOCK                              GLB_TZC_GLB_SWRST_S1C_LOCK
#define GLB_TZC_GLB_SWRST_S1C_LOCK_POS                          (28U)
#define GLB_TZC_GLB_SWRST_S1C_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1C_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1C_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1C_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1C_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1C_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1C_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1D_LOCK                              GLB_TZC_GLB_SWRST_S1D_LOCK
#define GLB_TZC_GLB_SWRST_S1D_LOCK_POS                          (29U)
#define GLB_TZC_GLB_SWRST_S1D_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1D_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1D_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1D_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1D_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1D_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1D_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1E_LOCK                              GLB_TZC_GLB_SWRST_S1E_LOCK
#define GLB_TZC_GLB_SWRST_S1E_LOCK_POS                          (30U)
#define GLB_TZC_GLB_SWRST_S1E_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1E_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1E_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1E_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1E_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1E_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1E_LOCK_POS))
#define GLB_TZC_GLB_SWRST_S1F_LOCK                              GLB_TZC_GLB_SWRST_S1F_LOCK
#define GLB_TZC_GLB_SWRST_S1F_LOCK_POS                          (31U)
#define GLB_TZC_GLB_SWRST_S1F_LOCK_LEN                          (1U)
#define GLB_TZC_GLB_SWRST_S1F_LOCK_MSK                          (((1U<<GLB_TZC_GLB_SWRST_S1F_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1F_LOCK_POS)
#define GLB_TZC_GLB_SWRST_S1F_LOCK_UMSK                         (~(((1U<<GLB_TZC_GLB_SWRST_S1F_LOCK_LEN)-1)<<GLB_TZC_GLB_SWRST_S1F_LOCK_POS))

