bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
/* 0xF08 : tzc_glb_ctrl_2 */
#define GLB_TZC_GLB_CTRL_2_OFFSET                               (0xF08)
#define GLB_TZC_GLB_GPIO_0_LOCK                                 GLB_TZC_GLB_GPIO_0_LOCK
#define GLB_TZC_GLB_GPIO_0_LOCK_POS                             (0U)
#define GLB_TZC_GLB_GPIO_0_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_0_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_0_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_0_LOCK_POS)
#define GLB_TZC_GLB_GPIO_0_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_0_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_0_LOCK_POS))
#define GLB_TZC_GLB_GPIO_1_LOCK                                 GLB_TZC_GLB_GPIO_1_LOCK
#define GLB_TZC_GLB_GPIO_1_LOCK_POS                             (1U)
#define GLB_TZC_GLB_GPIO_1_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_1_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_1_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_1_LOCK_POS)
#define GLB_TZC_GLB_GPIO_1_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_1_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_1_LOCK_POS))
#define GLB_TZC_GLB_GPIO_2_LOCK                                 GLB_TZC_GLB_GPIO_2_LOCK
#define GLB_TZC_GLB_GPIO_2_LOCK_POS                             (2U)
#define GLB_TZC_GLB_GPIO_2_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_2_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_2_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_2_LOCK_POS)
#define GLB_TZC_GLB_GPIO_2_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_2_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_2_LOCK_POS))
#define GLB_TZC_GLB_GPIO_3_LOCK                                 GLB_TZC_GLB_GPIO_3_LOCK
#define GLB_TZC_GLB_GPIO_3_LOCK_POS                             (3U)
#define GLB_TZC_GLB_GPIO_3_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_3_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_3_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_3_LOCK_POS)
#define GLB_TZC_GLB_GPIO_3_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_3_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_3_LOCK_POS))
#define GLB_TZC_GLB_GPIO_4_LOCK                                 GLB_TZC_GLB_GPIO_4_LOCK
#define GLB_TZC_GLB_GPIO_4_LOCK_POS                             (4U)
#define GLB_TZC_GLB_GPIO_4_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_4_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_4_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_4_LOCK_POS)
#define GLB_TZC_GLB_GPIO_4_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_4_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_4_LOCK_POS))
#define GLB_TZC_GLB_GPIO_5_LOCK                                 GLB_TZC_GLB_GPIO_5_LOCK
#define GLB_TZC_GLB_GPIO_5_LOCK_POS                             (5U)
#define GLB_TZC_GLB_GPIO_5_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_5_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_5_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_5_LOCK_POS)
#define GLB_TZC_GLB_GPIO_5_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_5_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_5_LOCK_POS))
#define GLB_TZC_GLB_GPIO_6_LOCK                                 GLB_TZC_GLB_GPIO_6_LOCK
#define GLB_TZC_GLB_GPIO_6_LOCK_POS                             (6U)
#define GLB_TZC_GLB_GPIO_6_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_6_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_6_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_6_LOCK_POS)
#define GLB_TZC_GLB_GPIO_6_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_6_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_6_LOCK_POS))
#define GLB_TZC_GLB_GPIO_7_LOCK                                 GLB_TZC_GLB_GPIO_7_LOCK
#define GLB_TZC_GLB_GPIO_7_LOCK_POS                             (7U)
#define GLB_TZC_GLB_GPIO_7_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_7_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_7_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_7_LOCK_POS)
#define GLB_TZC_GLB_GPIO_7_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_7_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_7_LOCK_POS))
#define GLB_TZC_GLB_GPIO_8_LOCK                                 GLB_TZC_GLB_GPIO_8_LOCK
#define GLB_TZC_GLB_GPIO_8_LOCK_POS                             (8U)
#define GLB_TZC_GLB_GPIO_8_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_8_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_8_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_8_LOCK_POS)
#define GLB_TZC_GLB_GPIO_8_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_8_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_8_LOCK_POS))
#define GLB_TZC_GLB_GPIO_9_LOCK                                 GLB_TZC_GLB_GPIO_9_LOCK
#define GLB_TZC_GLB_GPIO_9_LOCK_POS                             (9U)
#define GLB_TZC_GLB_GPIO_9_LOCK_LEN                             (1U)
#define GLB_TZC_GLB_GPIO_9_LOCK_MSK                             (((1U<<GLB_TZC_GLB_GPIO_9_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_9_LOCK_POS)
#define GLB_TZC_GLB_GPIO_9_LOCK_UMSK                            (~(((1U<<GLB_TZC_GLB_GPIO_9_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_9_LOCK_POS))
#define GLB_TZC_GLB_GPIO_10_LOCK                                GLB_TZC_GLB_GPIO_10_LOCK
#define GLB_TZC_GLB_GPIO_10_LOCK_POS                            (10U)
#define GLB_TZC_GLB_GPIO_10_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_10_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_10_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_10_LOCK_POS)
#define GLB_TZC_GLB_GPIO_10_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_10_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_10_LOCK_POS))
#define GLB_TZC_GLB_GPIO_11_LOCK                                GLB_TZC_GLB_GPIO_11_LOCK
#define GLB_TZC_GLB_GPIO_11_LOCK_POS                            (11U)
#define GLB_TZC_GLB_GPIO_11_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_11_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_11_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_11_LOCK_POS)
#define GLB_TZC_GLB_GPIO_11_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_11_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_11_LOCK_POS))
#define GLB_TZC_GLB_GPIO_12_LOCK                                GLB_TZC_GLB_GPIO_12_LOCK
#define GLB_TZC_GLB_GPIO_12_LOCK_POS                            (12U)
#define GLB_TZC_GLB_GPIO_12_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_12_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_12_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_12_LOCK_POS)
#define GLB_TZC_GLB_GPIO_12_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_12_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_12_LOCK_POS))
#define GLB_TZC_GLB_GPIO_13_LOCK                                GLB_TZC_GLB_GPIO_13_LOCK
#define GLB_TZC_GLB_GPIO_13_LOCK_POS                            (13U)
#define GLB_TZC_GLB_GPIO_13_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_13_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_13_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_13_LOCK_POS)
#define GLB_TZC_GLB_GPIO_13_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_13_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_13_LOCK_POS))
#define GLB_TZC_GLB_GPIO_14_LOCK                                GLB_TZC_GLB_GPIO_14_LOCK
#define GLB_TZC_GLB_GPIO_14_LOCK_POS                            (14U)
#define GLB_TZC_GLB_GPIO_14_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_14_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_14_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_14_LOCK_POS)
#define GLB_TZC_GLB_GPIO_14_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_14_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_14_LOCK_POS))
#define GLB_TZC_GLB_GPIO_15_LOCK                                GLB_TZC_GLB_GPIO_15_LOCK
#define GLB_TZC_GLB_GPIO_15_LOCK_POS                            (15U)
#define GLB_TZC_GLB_GPIO_15_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_15_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_15_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_15_LOCK_POS)
#define GLB_TZC_GLB_GPIO_15_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_15_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_15_LOCK_POS))
#define GLB_TZC_GLB_GPIO_16_LOCK                                GLB_TZC_GLB_GPIO_16_LOCK
#define GLB_TZC_GLB_GPIO_16_LOCK_POS                            (16U)
#define GLB_TZC_GLB_GPIO_16_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_16_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_16_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_16_LOCK_POS)
#define GLB_TZC_GLB_GPIO_16_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_16_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_16_LOCK_POS))
#define GLB_TZC_GLB_GPIO_17_LOCK                                GLB_TZC_GLB_GPIO_17_LOCK
#define GLB_TZC_GLB_GPIO_17_LOCK_POS                            (17U)
#define GLB_TZC_GLB_GPIO_17_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_17_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_17_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_17_LOCK_POS)
#define GLB_TZC_GLB_GPIO_17_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_17_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_17_LOCK_POS))
#define GLB_TZC_GLB_GPIO_18_LOCK                                GLB_TZC_GLB_GPIO_18_LOCK
#define GLB_TZC_GLB_GPIO_18_LOCK_POS                            (18U)
#define GLB_TZC_GLB_GPIO_18_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_18_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_18_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_18_LOCK_POS)
#define GLB_TZC_GLB_GPIO_18_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_18_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_18_LOCK_POS))
#define GLB_TZC_GLB_GPIO_19_LOCK                                GLB_TZC_GLB_GPIO_19_LOCK
#define GLB_TZC_GLB_GPIO_19_LOCK_POS                            (19U)
#define GLB_TZC_GLB_GPIO_19_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_19_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_19_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_19_LOCK_POS)
#define GLB_TZC_GLB_GPIO_19_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_19_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_19_LOCK_POS))
#define GLB_TZC_GLB_GPIO_20_LOCK                                GLB_TZC_GLB_GPIO_20_LOCK
#define GLB_TZC_GLB_GPIO_20_LOCK_POS                            (20U)
#define GLB_TZC_GLB_GPIO_20_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_20_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_20_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_20_LOCK_POS)
#define GLB_TZC_GLB_GPIO_20_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_20_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_20_LOCK_POS))
#define GLB_TZC_GLB_GPIO_21_LOCK                                GLB_TZC_GLB_GPIO_21_LOCK
#define GLB_TZC_GLB_GPIO_21_LOCK_POS                            (21U)
#define GLB_TZC_GLB_GPIO_21_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_21_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_21_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_21_LOCK_POS)
#define GLB_TZC_GLB_GPIO_21_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_21_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_21_LOCK_POS))
#define GLB_TZC_GLB_GPIO_22_LOCK                                GLB_TZC_GLB_GPIO_22_LOCK
#define GLB_TZC_GLB_GPIO_22_LOCK_POS                            (22U)
#define GLB_TZC_GLB_GPIO_22_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_22_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_22_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_22_LOCK_POS)
#define GLB_TZC_GLB_GPIO_22_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_22_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_22_LOCK_POS))
#define GLB_TZC_GLB_GPIO_23_LOCK                                GLB_TZC_GLB_GPIO_23_LOCK
#define GLB_TZC_GLB_GPIO_23_LOCK_POS                            (23U)
#define GLB_TZC_GLB_GPIO_23_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_23_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_23_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_23_LOCK_POS)
#define GLB_TZC_GLB_GPIO_23_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_23_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_23_LOCK_POS))
#define GLB_TZC_GLB_GPIO_24_LOCK                                GLB_TZC_GLB_GPIO_24_LOCK
#define GLB_TZC_GLB_GPIO_24_LOCK_POS                            (24U)
#define GLB_TZC_GLB_GPIO_24_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_24_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_24_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_24_LOCK_POS)
#define GLB_TZC_GLB_GPIO_24_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_24_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_24_LOCK_POS))
#define GLB_TZC_GLB_GPIO_25_LOCK                                GLB_TZC_GLB_GPIO_25_LOCK
#define GLB_TZC_GLB_GPIO_25_LOCK_POS                            (25U)
#define GLB_TZC_GLB_GPIO_25_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_25_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_25_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_25_LOCK_POS)
#define GLB_TZC_GLB_GPIO_25_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_25_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_25_LOCK_POS))
#define GLB_TZC_GLB_GPIO_26_LOCK                                GLB_TZC_GLB_GPIO_26_LOCK
#define GLB_TZC_GLB_GPIO_26_LOCK_POS                            (26U)
#define GLB_TZC_GLB_GPIO_26_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_26_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_26_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_26_LOCK_POS)
#define GLB_TZC_GLB_GPIO_26_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_26_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_26_LOCK_POS))
#define GLB_TZC_GLB_GPIO_27_LOCK                                GLB_TZC_GLB_GPIO_27_LOCK
#define GLB_TZC_GLB_GPIO_27_LOCK_POS                            (27U)
#define GLB_TZC_GLB_GPIO_27_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_27_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_27_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_27_LOCK_POS)
#define GLB_TZC_GLB_GPIO_27_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_27_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_27_LOCK_POS))
#define GLB_TZC_GLB_GPIO_28_LOCK                                GLB_TZC_GLB_GPIO_28_LOCK
#define GLB_TZC_GLB_GPIO_28_LOCK_POS                            (28U)
#define GLB_TZC_GLB_GPIO_28_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_28_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_28_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_28_LOCK_POS)
#define GLB_TZC_GLB_GPIO_28_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_28_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_28_LOCK_POS))
#define GLB_TZC_GLB_GPIO_29_LOCK                                GLB_TZC_GLB_GPIO_29_LOCK
#define GLB_TZC_GLB_GPIO_29_LOCK_POS                            (29U)
#define GLB_TZC_GLB_GPIO_29_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_29_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_29_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_29_LOCK_POS)
#define GLB_TZC_GLB_GPIO_29_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_29_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_29_LOCK_POS))
#define GLB_TZC_GLB_GPIO_30_LOCK                                GLB_TZC_GLB_GPIO_30_LOCK
#define GLB_TZC_GLB_GPIO_30_LOCK_POS                            (30U)
#define GLB_TZC_GLB_GPIO_30_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_30_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_30_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_30_LOCK_POS)
#define GLB_TZC_GLB_GPIO_30_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_30_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_30_LOCK_POS))
#define GLB_TZC_GLB_GPIO_31_LOCK                                GLB_TZC_GLB_GPIO_31_LOCK
#define GLB_TZC_GLB_GPIO_31_LOCK_POS                            (31U)
#define GLB_TZC_GLB_GPIO_31_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_31_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_31_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_31_LOCK_POS)
#define GLB_TZC_GLB_GPIO_31_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_31_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_31_LOCK_POS))

/* 0xF0C : tzc_glb_ctrl_3 */
#define GLB_TZC_GLB_CTRL_3_OFFSET                               (0xF0C)
#define GLB_TZC_GLB_GPIO_32_LOCK                                GLB_TZC_GLB_GPIO_32_LOCK
#define GLB_TZC_GLB_GPIO_32_LOCK_POS                            (0U)
#define GLB_TZC_GLB_GPIO_32_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_32_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_32_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_32_LOCK_POS)
#define GLB_TZC_GLB_GPIO_32_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_32_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_32_LOCK_POS))
#define GLB_TZC_GLB_GPIO_33_LOCK                                GLB_TZC_GLB_GPIO_33_LOCK
#define GLB_TZC_GLB_GPIO_33_LOCK_POS                            (1U)
#define GLB_TZC_GLB_GPIO_33_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_33_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_33_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_33_LOCK_POS)
#define GLB_TZC_GLB_GPIO_33_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_33_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_33_LOCK_POS))
#define GLB_TZC_GLB_GPIO_34_LOCK                                GLB_TZC_GLB_GPIO_34_LOCK
#define GLB_TZC_GLB_GPIO_34_LOCK_POS                            (2U)
#define GLB_TZC_GLB_GPIO_34_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_34_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_34_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_34_LOCK_POS)
#define GLB_TZC_GLB_GPIO_34_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_34_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_34_LOCK_POS))
#define GLB_TZC_GLB_GPIO_35_LOCK                                GLB_TZC_GLB_GPIO_35_LOCK
#define GLB_TZC_GLB_GPIO_35_LOCK_POS                            (3U)
#define GLB_TZC_GLB_GPIO_35_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_35_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_35_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_35_LOCK_POS)
#define GLB_TZC_GLB_GPIO_35_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_35_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_35_LOCK_POS))
#define GLB_TZC_GLB_GPIO_36_LOCK                                GLB_TZC_GLB_GPIO_36_LOCK
#define GLB_TZC_GLB_GPIO_36_LOCK_POS                            (4U)
#define GLB_TZC_GLB_GPIO_36_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_36_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_36_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_36_LOCK_POS)
#define GLB_TZC_GLB_GPIO_36_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_36_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_36_LOCK_POS))
#define GLB_TZC_GLB_GPIO_37_LOCK                                GLB_TZC_GLB_GPIO_37_LOCK
#define GLB_TZC_GLB_GPIO_37_LOCK_POS                            (5U)
#define GLB_TZC_GLB_GPIO_37_LOCK_LEN                            (1U)
#define GLB_TZC_GLB_GPIO_37_LOCK_MSK                            (((1U<<GLB_TZC_GLB_GPIO_37_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_37_LOCK_POS)
#define GLB_TZC_GLB_GPIO_37_LOCK_UMSK                           (~(((1U<<GLB_TZC_GLB_GPIO_37_LOCK_LEN)-1)<<GLB_TZC_GLB_GPIO_37_LOCK_POS))


struct  glb_reg {
    /* 0x0 : clk_cfg0 */
    union {
        struct {
            uint32_t reg_pll_en                     :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_fclk_en                    :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_hclk_en                    :  1; /* [    2],        r/w,        0x1 */
            uint32_t reg_bclk_en                    :  1; /* [    3],        r/w,        0x1 */
            uint32_t reg_pll_sel                    :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t hbn_root_clk_sel               :  2; /* [ 7: 6],          r,        0x0 */
            uint32_t reg_hclk_div                   :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_bclk_div                   :  8; /* [23:16],        r/w,        0x0 */
            uint32_t fclk_sw_state                  :  3; /* [26:24],          r,        0x0 */
            uint32_t chip_rdy                       :  1; /* [   27],          r,        0x0 */
            uint32_t glb_id                         :  4; /* [31:28],          r,        0x7 */
        }BF;
        uint32_t WORD;
    } clk_cfg0;

    /* 0x4 : clk_cfg1 */
    union {
        struct {
            uint32_t kys_1m_clk_div                 :  5; /* [ 4: 0],        r/w,       0x1f */
            uint32_t reserved_5_6                   :  2; /* [ 6: 5],       rsvd,        0x0 */
            uint32_t kys_1m_clk_sel                 :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_audio_clk_div              :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t reg_audio_clk_div_en           :  1; /* [   12],        r/w,        0x0 */
            uint32_t reg_audio_auto_div_en          :  1; /* [   13],        r/w,        0x0 */
            uint32_t reg_audio_clk_src_sel          :  1; /* [   14],        r/w,        0x0 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t ble_clk_sel                    :  6; /* [21:16],        r/w,       0x10 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t ble_en                         :  1; /* [   24],        r/w,        0x1 */
            uint32_t m154_zbEn                      :  1; /* [   25],        r/w,        0x1 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clk_cfg1;

