bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x48  reserved */
    uint8_t RESERVED0x48[4];

    /* 0x4C : XTAL_DEG_32K */
    union {
        struct {
            uint32_t xtal_deg_cnt_limit             :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_12                  :  5; /* [12: 8],       rsvd,        0x0 */
            uint32_t reg_rc32k_deg_en               :  1; /* [   13],        r/w,        0x0 */
            uint32_t rc32k_deg_end_ps               :  1; /* [   14],        w1p,        0x0 */
            uint32_t rc32k_deg_start_ps             :  1; /* [   15],        w1p,        0x0 */
            uint32_t reserved_16_26                 : 11; /* [26:16],       rsvd,        0x0 */
            uint32_t xtal_cnt_32k_cgen              :  1; /* [   27],        r/w,        0x1 */
            uint32_t clr_xtal_cnt_32k_done          :  1; /* [   28],        w1p,        0x0 */
            uint32_t reserved_29_30                 :  2; /* [30:29],       rsvd,        0x0 */
            uint32_t xtal_cnt_32k_sw_trig_ps        :  1; /* [   31],        w1p,        0x0 */
        }BF;
        uint32_t WORD;
    } XTAL_DEG_32K;

    /* 0x50 : bmx_cfg1 */
    union {
        struct {
            uint32_t bmx_timeout_en                 :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t bmx_arb_mode                   :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t bmx_err_en                     :  1; /* [    8],        r/w,        0x0 */
            uint32_t bmx_busy_option_dis            :  1; /* [    9],        r/w,        0x0 */
            uint32_t bmx_gating_dis                 :  1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t hsel_option                    :  4; /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_23                 :  8; /* [23:16],       rsvd,        0x0 */
            uint32_t hbn_apb_cfg                    :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } bmx_cfg1;

    /* 0x54 : bmx_cfg2 */
    union {
        struct {
            uint32_t bmx_err_addr_dis               :  1; /* [    0],        r/w,        0x0 */
            uint32_t bmx_err_clr                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t bmx_err_dec                    :  1; /* [    4],          r,        0x0 */
            uint32_t bmx_err_tz                     :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_w_thre_bmx                 :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_w_thre_l1c                 :  2; /* [11:10],        r/w,        0x0 */
            uint32_t reserved_12_27                 : 16; /* [27:12],       rsvd,        0x0 */
            uint32_t bmx_dbg_sel                    :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } bmx_cfg2;

    /* 0x58 : bmx_err_addr */
    union {
        struct {
            uint32_t bmx_err_addr                   : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } bmx_err_addr;

    /* 0x5C : bmx_dbg_out */
    union {
        struct {
            uint32_t bmx_dbg_out                    : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } bmx_dbg_out;

    /* 0x60 : rsv0 */
    union {
        struct {
            uint32_t rsvd_31_0                      : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rsv0;

    /* 0x64 : rsv1 */
    union {
        struct {
            uint32_t rsvd_31_0                      : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rsv1;

    /* 0x68 : rsv2 */
    union {
        struct {
            uint32_t rsvd_31_0                      : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rsv2;

    /* 0x6C : rsv3 */
    union {
        struct {
            uint32_t rsvd_31_0                      : 32; /* [31: 0],       rsvd, 0xffffffff */
        }BF;
        uint32_t WORD;
    } rsv3;

    /* 0x70  reserved */
    uint8_t RESERVED0x70[8];

    /* 0x78 : sram_parm */
    union {
        struct {
            uint32_t reg_sram_parm                  : 18; /* [17: 0],        r/w,    0x1d00b */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t reg_ocram_parm                 : 11; /* [30:20],        r/w,        0xa */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sram_parm;

    /* 0x7C : seam_misc */
    union {
        struct {
            uint32_t em_sel                         :  4; /* [ 3: 0],        r/w,        0x3 */
            uint32_t reserved_4_31                  : 28; /* [31: 4],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } seam_misc;

    /* 0x80 : glb_parm */
    union {
        struct {
            uint32_t jtag_swap_set                  :  8; /* [ 7: 0],        r/w,        0x4 */
            uint32_t cfg_sflash_swap_io0_io3        :  1; /* [    8],        r/w,        0x0 */
            uint32_t cfg_sflash_swap_cs_io2         :  1; /* [    9],        r/w,        0x0 */
            uint32_t cfg_sflash_reverse             :  1; /* [   10],        r/w,        0x0 */
            uint32_t cfg_flash2_scenario            :  1; /* [   11],        r/w,        0x0 */
            uint32_t reg_spi_0_master_mode          :  1; /* [   12],        r/w,        0x0 */
            uint32_t reg_spi_0_swap                 :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_cci_use_jtag_pin           :  1; /* [   16],        r/w,        0x1 */
            uint32_t p1_adc_test_with_cci           :  1; /* [   17],        r/w,        0x0 */
            uint32_t p2_dac_test_with_cci           :  1; /* [   18],        r/w,        0x0 */
            uint32_t p3_cci_use_io_0_2_7            :  1; /* [   19],        r/w,        0x0 */
            uint32_t p4_adc_test_with_jtag          :  1; /* [   20],        r/w,        0x0 */
            uint32_t p5_dac_test_with_jtag          :  1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22                    :  1; /* [   22],       rsvd,        0x0 */
            uint32_t p6_jtag_use_io_0_2_7           :  1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_27                 :  4; /* [27:24],       rsvd,        0x0 */
            uint32_t reg_en_gpio_o_latch_mode       :  1; /* [   28],        r/w,        0x0 */
            uint32_t reg_kys_drv_val                :  1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } glb_parm;

    /* 0x84 : PDM_CLK_CTRL */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } PDM_CLK_CTRL;

    /* 0x88 : GPIO_USE_PSRAM__IO */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_USE_PSRAM__IO;

