bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : CPU_CLK_CFG */
    union {
        struct {
            uint32_t cpu_rtc_div                    :  5; /* [ 4: 0],        r/w,        0x3 */
            uint32_t reserved_5_17                  : 13; /* [17: 5],       rsvd,        0x0 */
            uint32_t cpu_rtc_en                     :  1; /* [   18],        r/w,        0x0 */
            uint32_t cpu_rtc_sel                    :  1; /* [   19],        r/w,        0x1 */
            uint32_t debug_ndreset_gate             :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } CPU_CLK_CFG;

    /* 0x94 : CLK_DESPUR_ROOT_CLK_CFG */
    union {
        struct {
            uint32_t cfg_despur_bmap_root_clk       : 28; /* [27: 0],        r/w,  0xfffffff */
            uint32_t cfg_despur_cgen_root_clk       :  1; /* [   28],        r/w,        0x0 */
            uint32_t cfg_despur_enable_root_clk     :  1; /* [   29],        r/w,        0x0 */
            uint32_t cfg_despur_clk_sel_root_clk    :  1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } CLK_DESPUR_ROOT_CLK_CFG;

    /* 0x98 : CLK_DESPUR_CLK_SF_CFG */
    union {
        struct {
            uint32_t cfg_despur_bmap_clk_sf         : 28; /* [27: 0],        r/w,  0xfffffff */
            uint32_t cfg_despur_cgen_clk_sf         :  1; /* [   28],        r/w,        0x0 */
            uint32_t cfg_despur_enable_clk_sf       :  1; /* [   29],        r/w,        0x0 */
            uint32_t cfg_despur_clk_sel_clk_sf      :  1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } CLK_DESPUR_CLK_SF_CFG;

    /* 0x9c  reserved */
    uint8_t RESERVED0x9c[8];

    /* 0xA4 : GPADC_32M_SRC_CTRL */
    union {
        struct {
            uint32_t gpadc_32m_clk_div              :  6; /* [ 5: 0],        r/w,        0x2 */
            uint32_t reserved_6                     :  1; /* [    6],       rsvd,        0x0 */
            uint32_t gpadc_32m_clk_sel              :  1; /* [    7],        r/w,        0x1 */
            uint32_t gpadc_32m_div_en               :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } GPADC_32M_SRC_CTRL;

    /* 0xA8 : DIG32K_WAKEUP_CTRL */
    union {
        struct {
            uint32_t dig_32k_div                    : 11; /* [10: 0],        r/w,      0x3e8 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t dig_32k_en                     :  1; /* [   12],        r/w,        0x1 */
            uint32_t dig_32k_comp                   :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_27                 : 14; /* [27:14],       rsvd,        0x0 */
            uint32_t dig_clk_src_sel                :  1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_30                 :  2; /* [30:29],       rsvd,        0x0 */
            uint32_t sw_ble_wakeup_req              :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } DIG32K_WAKEUP_CTRL;

    /* 0xAC : WIFI_BT_COEX_CTRL */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } WIFI_BT_COEX_CTRL;

    /* 0xB0 : BZ_COEX_CTRL */
    union {
        struct {
            uint32_t coex_en                        :  1; /* [    0],        r/w,        0x0 */
            uint32_t wlan_en                        :  1; /* [    1],        r/w,        0x0 */
            uint32_t ble_rx_ignore                  :  1; /* [    2],        r/w,        0x0 */
            uint32_t m154_rx_ignore                 :  1; /* [    3],        r/w,        0x0 */
            uint32_t bz_pri_thr                     :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t bz_pri_en                      :  1; /* [    8],        r/w,        0x1 */
            uint32_t bz_pri_pol                     :  1; /* [    9],        r/w,        0x1 */
            uint32_t bz_active_pol                  :  1; /* [   10],        r/w,        0x1 */
            uint32_t bz_abort_pol                   :  1; /* [   11],        r/w,        0x1 */
            uint32_t coex_pri                       :  1; /* [   12],        r/w,        0x0 */
            uint32_t force_m154_win                 :  1; /* [   13],        r/w,        0x0 */
            uint32_t force_ble_win                  :  1; /* [   14],        r/w,        0x0 */
            uint32_t coex_option                    :  1; /* [   15],        r/w,        0x0 */
            uint32_t coex_force_ch                  :  7; /* [22:16],        r/w,        0x4 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t m154_rx_abort_dis              :  1; /* [   24],        r/w,        0x0 */
            uint32_t m154_tx_abort_dis              :  1; /* [   25],        r/w,        0x0 */
            uint32_t ble_rx_abort_dis               :  1; /* [   26],        r/w,        0x0 */
            uint32_t ble_tx_abort_dis               :  1; /* [   27],        r/w,        0x0 */
            uint32_t coex_arb                       :  4; /* [31:28],          r,        0x8 */
        }BF;
        uint32_t WORD;
    } BZ_COEX_CTRL;

    /* 0xb4  reserved */
    uint8_t RESERVED0xb4[12];

    /* 0xC0 : UART_SIG_SEL_0 */
    union {
        struct {
            uint32_t uart_sig_0_sel                 :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t uart_sig_1_sel                 :  4; /* [ 7: 4],        r/w,        0x1 */
            uint32_t uart_sig_2_sel                 :  4; /* [11: 8],        r/w,        0x2 */
            uint32_t uart_sig_3_sel                 :  4; /* [15:12],        r/w,        0x3 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } UART_SIG_SEL_0;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[12];

    /* 0xD0 : DBG_SEL_LL */
    union {
        struct {
            uint32_t reg_dbg_ll_ctrl                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } DBG_SEL_LL;

    /* 0xD4 : DBG_SEL_LH */
    union {
        struct {
            uint32_t reg_dbg_lh_ctrl                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } DBG_SEL_LH;

    /* 0xD8 : DBG_SEL_HL */
    union {
        struct {
            uint32_t reg_dbg_hl_ctrl                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } DBG_SEL_HL;

    /* 0xDC : DBG_SEL_HH */
    union {
        struct {
            uint32_t reg_dbg_hh_ctrl                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } DBG_SEL_HH;

    /* 0xE0 : debug */
    union {
        struct {
            uint32_t debug_oe                       :  1; /* [    0],        r/w,        0x0 */
            uint32_t debug_i                        : 31; /* [31: 1],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } debug;

    /* 0xe4  reserved */
    uint8_t RESERVED0xe4[28];

