bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x198 : GPIO_CFGCTL36 */
    union {
        struct {
            uint32_t reg_gpio_0_clr                 :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_gpio_1_clr                 :  1; /* [    1],        w1p,        0x0 */
            uint32_t reg_gpio_2_clr                 :  1; /* [    2],        w1p,        0x0 */
            uint32_t reg_gpio_3_clr                 :  1; /* [    3],        w1p,        0x0 */
            uint32_t reserved_4_6                   :  3; /* [ 6: 4],       rsvd,        0x0 */
            uint32_t reg_gpio_7_clr                 :  1; /* [    7],        w1p,        0x0 */
            uint32_t reg_gpio_8_clr                 :  1; /* [    8],        w1p,        0x0 */
            uint32_t reg_gpio_9_clr                 :  1; /* [    9],        w1p,        0x0 */
            uint32_t reg_gpio_10_clr                :  1; /* [   10],        w1p,        0x0 */
            uint32_t reg_gpio_11_clr                :  1; /* [   11],        w1p,        0x0 */
            uint32_t reg_gpio_12_clr                :  1; /* [   12],        w1p,        0x0 */
            uint32_t reg_gpio_13_clr                :  1; /* [   13],        w1p,        0x0 */
            uint32_t reg_gpio_14_clr                :  1; /* [   14],        w1p,        0x0 */
            uint32_t reg_gpio_15_clr                :  1; /* [   15],        w1p,        0x0 */
            uint32_t reg_gpio_16_clr                :  1; /* [   16],        w1p,        0x0 */
            uint32_t reg_gpio_17_clr                :  1; /* [   17],        w1p,        0x0 */
            uint32_t reg_gpio_18_clr                :  1; /* [   18],        w1p,        0x0 */
            uint32_t reg_gpio_19_clr                :  1; /* [   19],        w1p,        0x0 */
            uint32_t reg_gpio_20_clr                :  1; /* [   20],        w1p,        0x0 */
            uint32_t reg_gpio_21_clr                :  1; /* [   21],        w1p,        0x0 */
            uint32_t reg_gpio_22_clr                :  1; /* [   22],        w1p,        0x0 */
            uint32_t reg_gpio_23_clr                :  1; /* [   23],        w1p,        0x0 */
            uint32_t reg_gpio_24_clr                :  1; /* [   24],        w1p,        0x0 */
            uint32_t reg_gpio_25_clr                :  1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_26_clr                :  1; /* [   26],        w1p,        0x0 */
            uint32_t reg_gpio_27_clr                :  1; /* [   27],        w1p,        0x0 */
            uint32_t reg_gpio_28_clr                :  1; /* [   28],        w1p,        0x0 */
            uint32_t reg_gpio_29_clr                :  1; /* [   29],        w1p,        0x0 */
            uint32_t reg_gpio_30_clr                :  1; /* [   30],        w1p,        0x0 */
            uint32_t reg_gpio_31_clr                :  1; /* [   31],        w1p,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_CFGCTL36;

    /* 0x19c  reserved */
    uint8_t RESERVED0x19c[4];

    /* 0x1A0 : GPIO_INT_MASK1 */
    union {
        struct {
            uint32_t reg_gpio0_int_mask             :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio1_int_mask             :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio2_int_mask             :  1; /* [    2],        r/w,        0x1 */
            uint32_t reg_gpio3_int_mask             :  1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_6                   :  3; /* [ 6: 4],       rsvd,        0x0 */
            uint32_t reg_gpio7_int_mask             :  1; /* [    7],        r/w,        0x1 */
            uint32_t reg_gpio8_int_mask             :  1; /* [    8],        r/w,        0x1 */
            uint32_t reg_gpio9_int_mask             :  1; /* [    9],        r/w,        0x1 */
            uint32_t reg_gpio10_int_mask            :  1; /* [   10],        r/w,        0x1 */
            uint32_t reg_gpio11_int_mask            :  1; /* [   11],        r/w,        0x1 */
            uint32_t reg_gpio12_int_mask            :  1; /* [   12],        r/w,        0x1 */
            uint32_t reg_gpio13_int_mask            :  1; /* [   13],        r/w,        0x1 */
            uint32_t reg_gpio14_int_mask            :  1; /* [   14],        r/w,        0x1 */
            uint32_t reg_gpio15_int_mask            :  1; /* [   15],        r/w,        0x1 */
            uint32_t reg_gpio16_int_mask            :  1; /* [   16],        r/w,        0x1 */
            uint32_t reg_gpio17_int_mask            :  1; /* [   17],        r/w,        0x1 */
            uint32_t reg_gpio18_int_mask            :  1; /* [   18],        r/w,        0x1 */
            uint32_t reg_gpio19_int_mask            :  1; /* [   19],        r/w,        0x1 */
            uint32_t reg_gpio20_int_mask            :  1; /* [   20],        r/w,        0x1 */
            uint32_t reg_gpio21_int_mask            :  1; /* [   21],        r/w,        0x1 */
            uint32_t reg_gpio22_int_mask            :  1; /* [   22],        r/w,        0x1 */
            uint32_t reg_gpio23_int_mask            :  1; /* [   23],        r/w,        0x1 */
            uint32_t reg_gpio24_int_mask            :  1; /* [   24],        r/w,        0x1 */
            uint32_t reg_gpio25_int_mask            :  1; /* [   25],        r/w,        0x1 */
            uint32_t reg_gpio26_int_mask            :  1; /* [   26],        r/w,        0x1 */
            uint32_t reg_gpio27_int_mask            :  1; /* [   27],        r/w,        0x1 */
            uint32_t reg_gpio28_int_mask            :  1; /* [   28],        r/w,        0x1 */
            uint32_t reg_gpio29_int_mask            :  1; /* [   29],        r/w,        0x1 */
            uint32_t reg_gpio30_int_mask            :  1; /* [   30],        r/w,        0x1 */
            uint32_t reg_gpio31_int_mask            :  1; /* [   31],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_MASK1;

    /* 0x1a4  reserved */
    uint8_t RESERVED0x1a4[4];

    /* 0x1A8 : GPIO_INT_STAT1 */
    union {
        struct {
            uint32_t gpio_int_stat1                 : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_STAT1;

