bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x1ac  reserved */
    uint8_t RESERVED0x1ac[4];

    /* 0x1B0 : GPIO_INT_CLR1 */
    union {
        struct {
            uint32_t reg_gpio0_int_clr              :  1; /* [    0],        w1p,        0x0 */
            uint32_t reg_gpio1_int_clr              :  1; /* [    1],        w1p,        0x0 */
            uint32_t reg_gpio2_int_clr              :  1; /* [    2],        w1p,        0x0 */
            uint32_t reg_gpio3_int_clr              :  1; /* [    3],        w1p,        0x0 */
            uint32_t reserved_4_6                   :  3; /* [ 6: 4],       rsvd,        0x0 */
            uint32_t reg_gpio7_int_clr              :  1; /* [    7],        w1p,        0x0 */
            uint32_t reg_gpio8_int_clr              :  1; /* [    8],        w1p,        0x0 */
            uint32_t reg_gpio9_int_clr              :  1; /* [    9],        w1p,        0x0 */
            uint32_t reg_gpio10_int_clr             :  1; /* [   10],        w1p,        0x0 */
            uint32_t reg_gpio11_int_clr             :  1; /* [   11],        w1p,        0x0 */
            uint32_t reg_gpio12_int_clr             :  1; /* [   12],        w1p,        0x0 */
            uint32_t reg_gpio13_int_clr             :  1; /* [   13],        w1p,        0x0 */
            uint32_t reg_gpio14_int_clr             :  1; /* [   14],        w1p,        0x0 */
            uint32_t reg_gpio15_int_clr             :  1; /* [   15],        w1p,        0x0 */
            uint32_t reg_gpio16_int_clr             :  1; /* [   16],        w1p,        0x0 */
            uint32_t reg_gpio17_int_clr             :  1; /* [   17],        w1p,        0x0 */
            uint32_t reg_gpio18_int_clr             :  1; /* [   18],        w1p,        0x0 */
            uint32_t reg_gpio19_int_clr             :  1; /* [   19],        w1p,        0x0 */
            uint32_t reg_gpio20_int_clr             :  1; /* [   20],        w1p,        0x0 */
            uint32_t reg_gpio21_int_clr             :  1; /* [   21],        w1p,        0x0 */
            uint32_t reg_gpio22_int_clr             :  1; /* [   22],        w1p,        0x0 */
            uint32_t reg_gpio23_int_clr             :  1; /* [   23],        w1p,        0x0 */
            uint32_t reg_gpio24_int_clr             :  1; /* [   24],        w1p,        0x0 */
            uint32_t reg_gpio25_int_clr             :  1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio26_int_clr             :  1; /* [   26],        w1p,        0x0 */
            uint32_t reg_gpio27_int_clr             :  1; /* [   27],        w1p,        0x0 */
            uint32_t reg_gpio28_int_clr             :  1; /* [   28],        w1p,        0x0 */
            uint32_t reg_gpio29_int_clr             :  1; /* [   29],        w1p,        0x0 */
            uint32_t reg_gpio30_int_clr             :  1; /* [   30],        w1p,        0x0 */
            uint32_t reg_gpio31_int_clr             :  1; /* [   31],        w1p,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_CLR1;

    /* 0x1b4  reserved */
    uint8_t RESERVED0x1b4[12];

    /* 0x1C0 : GPIO_INT_MODE_SET1 */
    union {
        struct {
            uint32_t reg_gpio0_int_mode_set         :  4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reg_gpio1_int_mode_set         :  4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_gpio2_int_mode_set         :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t reg_gpio3_int_mode_set         :  4; /* [15:12],        r/w,        0x0 */
            uint32_t reserved_16_27                 : 12; /* [27:16],       rsvd,        0x0 */
            uint32_t reg_gpio7_int_mode_set         :  4; /* [31:28],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET1;

    /* 0x1C4 : GPIO_INT_MODE_SET2 */
    union {
        struct {
            uint32_t reg_gpio_int_mode_set2         : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET2;

    /* 0x1C8 : GPIO_INT_MODE_SET3 */
    union {
        struct {
            uint32_t reg_gpio_int_mode_set3         : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET3;

    /* 0x1CC : GPIO_INT_MODE_SET4 */
    union {
        struct {
            uint32_t reg_gpio_int_mode_set4         : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } GPIO_INT_MODE_SET4;

    /* 0x1d0  reserved */
    uint8_t RESERVED0x1d0[48];

    /* 0x200 : dll */
    union {
        struct {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t ten_dll                        :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7                   :  5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t dll_vctrl_sel                  :  3; /* [10: 8],        r/w,        0x4 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t dll_prechg_sel                 :  1; /* [   12],        r/w,        0x1 */
            uint32_t dll_prechg_reg                 :  1; /* [   13],        r/w,        0x1 */
            uint32_t dll_prechg_en                  :  1; /* [   14],        r/w,        0x1 */
            uint32_t dll_vctrl_force_en             :  1; /* [   15],        r/w,        0x0 */
            uint32_t dll_postdiv                    :  6; /* [21:16],        r/w,       0x15 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t dll_delay_sel                  :  2; /* [25:24],        r/w,        0x1 */
            uint32_t dll_cp_op_en                   :  1; /* [   26],        r/w,        0x1 */
            uint32_t dll_cp_hiz                     :  1; /* [   27],        r/w,        0x0 */
            uint32_t dll_refclk_sel                 :  1; /* [   28],        r/w,        0x0 */
            uint32_t dll_reset                      :  1; /* [   29],        r/w,        0x1 */
            uint32_t pu_dll                         :  1; /* [   30],        r/w,        0x0 */
            uint32_t ppu_dll                        :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } dll;

    /* 0x204 : dll2 */
    union {
        struct {
            uint32_t dll_en_div1_rf                 :  1; /* [    0],        r/w,        0x0 */
            uint32_t dll_en_div63                   :  1; /* [    1],        r/w,        0x0 */
            uint32_t dll_en_div21                   :  1; /* [    2],        r/w,        0x0 */
            uint32_t dll_en_div5                    :  1; /* [    3],        r/w,        0x0 */
            uint32_t dll_en_div3                    :  1; /* [    4],        r/w,        0x0 */
            uint32_t dll_en_div2                    :  1; /* [    5],        r/w,        0x0 */
            uint32_t dll_en_div1                    :  1; /* [    6],        r/w,        0x1 */
            uint32_t dll_dl_ctrl_div1_rf            :  1; /* [    7],        r/w,        0x0 */
            uint32_t dll_dl_ctrl_div5               :  1; /* [    8],        r/w,        0x0 */
            uint32_t dll_dl_ctrl_div3               :  1; /* [    9],        r/w,        0x0 */
            uint32_t dll_dl_ctrl_div2               :  1; /* [   10],        r/w,        0x0 */
            uint32_t dll_dl_ctrl_div1               :  1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t dll_postdiv_dl_ctrl            :  1; /* [   16],        r/w,        0x0 */
            uint32_t dll_postdiv_stg2_div2          :  1; /* [   17],        r/w,        0x0 */
            uint32_t dll_postdiv_en                 :  1; /* [   18],        r/w,        0x0 */
            uint32_t dll_ref_polarity               :  1; /* [   19],        r/w,        0x0 */
            uint32_t dten_dll_refbuf                :  1; /* [   20],        r/w,        0x0 */
            uint32_t dten_dll_postdiv               :  1; /* [   21],        r/w,        0x0 */
            uint32_t dten_dll_clkdiv63              :  1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t dll_resv                       :  8; /* [31:24],        r/w,        0x3 */
        }BF;
        uint32_t WORD;
    } dll2;

