bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x208  reserved */
    uint8_t RESERVED0x208[28];

    /* 0x224 : led_driver */
    union {
        struct {
            uint32_t led_din_reg                    :  1; /* [    0],        r/w,        0x0 */
            uint32_t led_din_sel                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t led_din_polarity_sel           :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t leddrv_ibias                   :  3; /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7_27                  : 21; /* [27: 7],       rsvd,        0x0 */
            uint32_t leddrv_out_en                  :  2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30                    :  1; /* [   30],       rsvd,        0x0 */
            uint32_t pu_leddrv                      :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } led_driver;

    /* 0x228 : usb_xcvr */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } usb_xcvr;

    /* 0x22C : usb_xcvr_config */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } usb_xcvr_config;

    /* 0x230  reserved */
    uint8_t RESERVED0x230[208];

    /* 0x300 : rc32m_ctrl0 */
    union {
        struct {
            uint32_t rc32m_cal_done                 :  1; /* [    0],          r,        0x0 */
            uint32_t rc32m_rdy                      :  1; /* [    1],          r,        0x0 */
            uint32_t rc32m_cal_inprogress           :  1; /* [    2],          r,        0x0 */
            uint32_t rc32m_cal_div                  :  2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32m_cal_precharge            :  1; /* [    5],          r,        0x0 */
            uint32_t rc32m_dig_code_fr_cal          :  8; /* [13: 6],          r,        0x0 */
            uint32_t reserved_14_16                 :  3; /* [16:14],       rsvd,        0x0 */
            uint32_t rc32m_allow_cal                :  1; /* [   17],        r/w,        0x0 */
            uint32_t reserved_18                    :  1; /* [   18],       rsvd,        0x0 */
            uint32_t rc32m_ext_code_en              :  1; /* [   19],        r/w,        0x1 */
            uint32_t rc32m_cal_en                   :  1; /* [   20],        r/w,        0x0 */
            uint32_t rc32m_pd                       :  1; /* [   21],        r/w,        0x0 */
            uint32_t rc32m_code_fr_ext              :  8; /* [29:22],        r/w,       0x60 */
            uint32_t rc32m_rc32k_cal_cgen           :  1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rc32m_ctrl0;

    /* 0x304 : rc32m_ctrl1 */
    union {
        struct {
            uint32_t rc32m_test_en                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7                   :  7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t rc32m_code_fr_ext2             :  8; /* [15: 8],        r/w,       0x60 */
            uint32_t rc32m_ext_code_sel             :  1; /* [   16],        r/w,        0x0 */
            uint32_t rc32m_ext_code_sel_cgen        :  1; /* [   17],        r/w,        0x0 */
            uint32_t reserved_18_23                 :  6; /* [23:18],       rsvd,        0x0 */
            uint32_t rc32m_reserved                 :  8; /* [31:24],        r/w,        0xf */
        }BF;
        uint32_t WORD;
    } rc32m_ctrl1;

    /* 0x308 : rc32k_ctrl2 */
    union {
        struct {
            uint32_t rc32k_dig_cal_done             :  1; /* [    0],          r,        0x1 */
            uint32_t rc32k_rdy                      :  1; /* [    1],          r,        0x1 */
            uint32_t rc32k_dig_cal_inprogress       :  1; /* [    2],          r,        0x0 */
            uint32_t rc32k_dig_cal_div              :  2; /* [ 4: 3],        r/w,        0x3 */
            uint32_t rc32k_dig_cal_precharge        :  1; /* [    5],          r,        0x0 */
            uint32_t rc32k_dig_cap_code_fr_cal      :  4; /* [ 9: 6],          r,        0x8 */
            uint32_t reserved_10_15                 :  6; /* [15:10],       rsvd,        0x0 */
            uint32_t rc32k_dig_vref_dly             :  2; /* [17:16],        r/w,        0x0 */
            uint32_t rc32k_allow_cal                :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } rc32k_ctrl2;

    /* 0x30c  reserved */
    uint8_t RESERVED0x30c[512];

    /* 0x50C : gpadc_reg_cmd */
    union {
        struct {
            uint32_t gpadc_global_en                :  1; /* [    0],        r/w,        0x0 */
            uint32_t gpadc_conv_start               :  1; /* [    1],        r/w,        0x0 */
            uint32_t gpadc_soft_rst                 :  1; /* [    2],        r/w,        0x0 */
            uint32_t gpadc_neg_sel                  :  5; /* [ 7: 3],        r/w,        0xf */
            uint32_t gpadc_pos_sel                  :  5; /* [12: 8],        r/w,        0xf */
            uint32_t gpadc_neg_gnd                  :  1; /* [   13],        r/w,        0x0 */
            uint32_t gpadc_micbias_en               :  1; /* [   14],        r/w,        0x0 */
            uint32_t gpadc_micpga_en                :  1; /* [   15],        r/w,        0x0 */
            uint32_t gpadc_byp_micboost             :  1; /* [   16],        r/w,        0x0 */
            uint32_t gpadc_rcal_en                  :  1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_dwa_en                   :  1; /* [   18],        r/w,        0x0 */
            uint32_t gpadc_mic2_diff                :  1; /* [   19],        r/w,        0x0 */
            uint32_t gpadc_mic1_diff                :  1; /* [   20],        r/w,        0x0 */
            uint32_t gpadc_mic_pga2_gain            :  2; /* [22:21],        r/w,        0x0 */
            uint32_t gpadc_micboost_32db_en         :  1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_26                 :  3; /* [26:24],       rsvd,        0x0 */
            uint32_t gpadc_chip_sen_pu              :  1; /* [   27],        r/w,        0x0 */
            uint32_t gpadc_sen_sel                  :  3; /* [30:28],        r/w,        0x0 */
            uint32_t gpadc_sen_test_en              :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_cmd;

    /* 0x510 : gpadc_reg_config1 */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t gpadc_cont_conv_en             :  1; /* [    1],        r/w,        0x1 */
            uint32_t gpadc_res_sel                  :  3; /* [ 4: 2],        r/w,        0x0 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gpadc_vcm_sel_en               :  1; /* [    8],        r/w,        0x0 */
            uint32_t gpadc_vcm_hyst_sel             :  1; /* [    9],        r/w,        0x0 */
            uint32_t gpadc_lowv_det_en              :  1; /* [   10],        r/w,        0x0 */
            uint32_t gpadc_pwm_trg_en               :  1; /* [   11],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_dly              :  4; /* [15:12],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_dly_en           :  1; /* [   16],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_inv              :  1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_clk_div_ratio            :  3; /* [20:18],        r/w,        0x3 */
            uint32_t gpadc_scan_length              :  4; /* [24:21],        r/w,        0x0 */
            uint32_t gpadc_scan_en                  :  1; /* [   25],        r/w,        0x0 */
            uint32_t gpadc_dither_en                :  1; /* [   26],        r/w,        0x0 */
            uint32_t gpadc_v11_sel                  :  2; /* [28:27],        r/w,        0x0 */
            uint32_t gpadc_v18_sel                  :  2; /* [30:29],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_config1;

