bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x514 : gpadc_reg_config2 */
    union {
        struct {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t gpadc_diff_mode                :  1; /* [    2],        r/w,        0x0 */
            uint32_t gpadc_vref_sel                 :  1; /* [    3],        r/w,        0x0 */
            uint32_t gpadc_vbat_en                  :  1; /* [    4],        r/w,        0x0 */
            uint32_t gpadc_tsext_sel                :  1; /* [    5],        r/w,        0x0 */
            uint32_t gpadc_ts_en                    :  1; /* [    6],        r/w,        0x0 */
            uint32_t gpadc_pga_vcm                  :  2; /* [ 8: 7],        r/w,        0x2 */
            uint32_t gpadc_pga_os_cal               :  4; /* [12: 9],        r/w,        0x8 */
            uint32_t gpadc_pga_en                   :  1; /* [   13],        r/w,        0x0 */
            uint32_t gpadc_pga_vcmi_en              :  1; /* [   14],        r/w,        0x0 */
            uint32_t gpadc_chop_mode                :  2; /* [16:15],        r/w,        0x3 */
            uint32_t gpadc_bias_sel                 :  1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_test_en                  :  1; /* [   18],        r/w,        0x0 */
            uint32_t gpadc_test_sel                 :  3; /* [21:19],        r/w,        0x0 */
            uint32_t gpadc_pga2_gain                :  3; /* [24:22],        r/w,        0x0 */
            uint32_t gpadc_pga1_gain                :  3; /* [27:25],        r/w,        0x0 */
            uint32_t gpadc_dly_sel                  :  3; /* [30:28],        r/w,        0x0 */
            uint32_t gpadc_tsvbe_low                :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_config2;

    /* 0x518 : adc converation sequence 1 */
    union {
        struct {
            uint32_t gpadc_scan_pos_0               :  5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_pos_1               :  5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_pos_2               :  5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_pos_3               :  5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_pos_4               :  5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_pos_5               :  5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_scn_pos1;

    /* 0x51C : adc converation sequence 2 */
    union {
        struct {
            uint32_t gpadc_scan_pos_6               :  5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_pos_7               :  5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_pos_8               :  5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_pos_9               :  5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_pos_10              :  5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_pos_11              :  5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_scn_pos2;

    /* 0x520 : adc converation sequence 3 */
    union {
        struct {
            uint32_t gpadc_scan_neg_0               :  5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_neg_1               :  5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_neg_2               :  5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_neg_3               :  5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_neg_4               :  5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_neg_5               :  5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_scn_neg1;

    /* 0x524 : adc converation sequence 4 */
    union {
        struct {
            uint32_t gpadc_scan_neg_6               :  5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_neg_7               :  5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_neg_8               :  5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_neg_9               :  5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_neg_10              :  5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_neg_11              :  5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_scn_neg2;

    /* 0x528 : gpadc_reg_status */
    union {
        struct {
            uint32_t gpadc_data_rdy                 :  1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_15                  : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t gpadc_reserved                 : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_status;

    /* 0x52C : gpadc_reg_isr */
    union {
        struct {
            uint32_t gpadc_neg_satur                :  1; /* [    0],          r,        0x0 */
            uint32_t gpadc_pos_satur                :  1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gpadc_neg_satur_clr            :  1; /* [    4],        r/w,        0x0 */
            uint32_t gpadc_pos_satur_clr            :  1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t gpadc_neg_satur_mask           :  1; /* [    8],        r/w,        0x0 */
            uint32_t gpadc_pos_satur_mask           :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_isr;

    /* 0x530 : gpadc_reg_result */
    union {
        struct {
            uint32_t gpadc_data_out                 : 26; /* [25: 0],          r,  0x1ef0000 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_result;

