bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/glb_reg.h
    /* 0x534 : gpadc_reg_raw_result */
    union {
        struct {
            uint32_t gpadc_raw_data                 : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_raw_result;

    /* 0x538 : gpadc_reg_define */
    union {
        struct {
            uint32_t gpadc_os_cal_data              : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } gpadc_reg_define;

    /* 0x53c  reserved */
    uint8_t RESERVED0x53c[2500];

    /* 0xF00 : tzc_glb_ctrl_0 */
    union {
        struct {
            uint32_t tzc_glb_swrst_s00_lock         :  1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_swrst_s01_lock         :  1; /* [    1],          r,        0x0 */
            uint32_t reserved_2_7                   :  6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t tzc_glb_swrst_s30_lock         :  1; /* [    8],          r,        0x0 */
            uint32_t reserved_9_11                  :  3; /* [11: 9],       rsvd,        0x0 */
            uint32_t tzc_glb_ctrl_pwron_rst_lock    :  1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_ctrl_cpu_reset_lock    :  1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_ctrl_sys_reset_lock    :  1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_ctrl_ungated_ap_lock   :  1; /* [   15],          r,        0x0 */
            uint32_t reserved_16_24                 :  9; /* [24:16],       rsvd,        0x0 */
            uint32_t tzc_glb_misc_lock              :  1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_sram_lock              :  1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_l2c_lock               :  1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_bmx_lock               :  1; /* [   28],          r,        0x0 */
            uint32_t tzc_glb_dbg_lock               :  1; /* [   29],          r,        0x0 */
            uint32_t tzc_glb_mbist_lock             :  1; /* [   30],          r,        0x0 */
            uint32_t tzc_glb_clk_lock               :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } tzc_glb_ctrl_0;

    /* 0xF04 : tzc_glb_ctrl_1 */
    union {
        struct {
            uint32_t tzc_glb_swrst_s20_lock         :  1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_swrst_s21_lock         :  1; /* [    1],          r,        0x0 */
            uint32_t tzc_glb_swrst_s22_lock         :  1; /* [    2],          r,        0x0 */
            uint32_t tzc_glb_swrst_s23_lock         :  1; /* [    3],          r,        0x0 */
            uint32_t tzc_glb_swrst_s24_lock         :  1; /* [    4],          r,        0x0 */
            uint32_t tzc_glb_swrst_s25_lock         :  1; /* [    5],          r,        0x0 */
            uint32_t tzc_glb_swrst_s26_lock         :  1; /* [    6],          r,        0x0 */
            uint32_t tzc_glb_swrst_s27_lock         :  1; /* [    7],          r,        0x0 */
            uint32_t tzc_glb_swrst_s28_lock         :  1; /* [    8],          r,        0x0 */
            uint32_t tzc_glb_swrst_s29_lock         :  1; /* [    9],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2a_lock         :  1; /* [   10],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2b_lock         :  1; /* [   11],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2c_lock         :  1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2d_lock         :  1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2e_lock         :  1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_swrst_s2f_lock         :  1; /* [   15],          r,        0x0 */
            uint32_t tzc_glb_swrst_s10_lock         :  1; /* [   16],          r,        0x0 */
            uint32_t tzc_glb_swrst_s11_lock         :  1; /* [   17],          r,        0x0 */
            uint32_t tzc_glb_swrst_s12_lock         :  1; /* [   18],          r,        0x0 */
            uint32_t tzc_glb_swrst_s13_lock         :  1; /* [   19],          r,        0x0 */
            uint32_t tzc_glb_swrst_s14_lock         :  1; /* [   20],          r,        0x0 */
            uint32_t tzc_glb_swrst_s15_lock         :  1; /* [   21],          r,        0x0 */
            uint32_t tzc_glb_swrst_s16_lock         :  1; /* [   22],          r,        0x0 */
            uint32_t tzc_glb_swrst_s17_lock         :  1; /* [   23],          r,        0x0 */
            uint32_t tzc_glb_swrst_s18_lock         :  1; /* [   24],          r,        0x0 */
            uint32_t tzc_glb_swrst_s19_lock         :  1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1a_lock         :  1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1b_lock         :  1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1c_lock         :  1; /* [   28],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1d_lock         :  1; /* [   29],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1e_lock         :  1; /* [   30],          r,        0x0 */
            uint32_t tzc_glb_swrst_s1f_lock         :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } tzc_glb_ctrl_1;

    /* 0xF08 : tzc_glb_ctrl_2 */
    union {
        struct {
            uint32_t tzc_glb_gpio_0_lock            :  1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_gpio_1_lock            :  1; /* [    1],          r,        0x0 */
            uint32_t tzc_glb_gpio_2_lock            :  1; /* [    2],          r,        0x0 */
            uint32_t tzc_glb_gpio_3_lock            :  1; /* [    3],          r,        0x0 */
            uint32_t tzc_glb_gpio_4_lock            :  1; /* [    4],          r,        0x0 */
            uint32_t tzc_glb_gpio_5_lock            :  1; /* [    5],          r,        0x0 */
            uint32_t tzc_glb_gpio_6_lock            :  1; /* [    6],          r,        0x0 */
            uint32_t tzc_glb_gpio_7_lock            :  1; /* [    7],          r,        0x0 */
            uint32_t tzc_glb_gpio_8_lock            :  1; /* [    8],          r,        0x0 */
            uint32_t tzc_glb_gpio_9_lock            :  1; /* [    9],          r,        0x0 */
            uint32_t tzc_glb_gpio_10_lock           :  1; /* [   10],          r,        0x0 */
            uint32_t tzc_glb_gpio_11_lock           :  1; /* [   11],          r,        0x0 */
            uint32_t tzc_glb_gpio_12_lock           :  1; /* [   12],          r,        0x0 */
            uint32_t tzc_glb_gpio_13_lock           :  1; /* [   13],          r,        0x0 */
            uint32_t tzc_glb_gpio_14_lock           :  1; /* [   14],          r,        0x0 */
            uint32_t tzc_glb_gpio_15_lock           :  1; /* [   15],          r,        0x0 */
            uint32_t tzc_glb_gpio_16_lock           :  1; /* [   16],          r,        0x0 */
            uint32_t tzc_glb_gpio_17_lock           :  1; /* [   17],          r,        0x0 */
            uint32_t tzc_glb_gpio_18_lock           :  1; /* [   18],          r,        0x0 */
            uint32_t tzc_glb_gpio_19_lock           :  1; /* [   19],          r,        0x0 */
            uint32_t tzc_glb_gpio_20_lock           :  1; /* [   20],          r,        0x0 */
            uint32_t tzc_glb_gpio_21_lock           :  1; /* [   21],          r,        0x0 */
            uint32_t tzc_glb_gpio_22_lock           :  1; /* [   22],          r,        0x0 */
            uint32_t tzc_glb_gpio_23_lock           :  1; /* [   23],          r,        0x0 */
            uint32_t tzc_glb_gpio_24_lock           :  1; /* [   24],          r,        0x0 */
            uint32_t tzc_glb_gpio_25_lock           :  1; /* [   25],          r,        0x0 */
            uint32_t tzc_glb_gpio_26_lock           :  1; /* [   26],          r,        0x0 */
            uint32_t tzc_glb_gpio_27_lock           :  1; /* [   27],          r,        0x0 */
            uint32_t tzc_glb_gpio_28_lock           :  1; /* [   28],          r,        0x0 */
            uint32_t tzc_glb_gpio_29_lock           :  1; /* [   29],          r,        0x0 */
            uint32_t tzc_glb_gpio_30_lock           :  1; /* [   30],          r,        0x0 */
            uint32_t tzc_glb_gpio_31_lock           :  1; /* [   31],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } tzc_glb_ctrl_2;

    /* 0xF0C : tzc_glb_ctrl_3 */
    union {
        struct {
            uint32_t tzc_glb_gpio_32_lock           :  1; /* [    0],          r,        0x0 */
            uint32_t tzc_glb_gpio_33_lock           :  1; /* [    1],          r,        0x0 */
            uint32_t tzc_glb_gpio_34_lock           :  1; /* [    2],          r,        0x0 */
            uint32_t tzc_glb_gpio_35_lock           :  1; /* [    3],          r,        0x0 */
            uint32_t tzc_glb_gpio_36_lock           :  1; /* [    4],          r,        0x0 */
            uint32_t tzc_glb_gpio_37_lock           :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_31                  : 26; /* [31: 6],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } tzc_glb_ctrl_3;

};

typedef volatile struct glb_reg glb_reg_t;


#endif  /* __GLB_REG_H__ */
